/* automatically generated by rust-bindgen 0.69.4 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const ETIME: u32 = 62;
pub const ENOSR: u32 = 63;
pub const ENONET: u32 = 64;
pub const ENOPKG: u32 = 65;
pub const EREMOTE: u32 = 66;
pub const ENOLINK: u32 = 67;
pub const EADV: u32 = 68;
pub const ESRMNT: u32 = 69;
pub const ECOMM: u32 = 70;
pub const EPROTO: u32 = 71;
pub const EMULTIHOP: u32 = 74;
pub const ELBIN: u32 = 75;
pub const EDOTDOT: u32 = 76;
pub const EBADMSG: u32 = 77;
pub const EFTYPE: u32 = 79;
pub const ENOTUNIQ: u32 = 80;
pub const EBADFD: u32 = 81;
pub const EREMCHG: u32 = 82;
pub const ELIBACC: u32 = 83;
pub const ELIBBAD: u32 = 84;
pub const ELIBSCN: u32 = 85;
pub const ELIBMAX: u32 = 86;
pub const ELIBEXEC: u32 = 87;
pub const ENOSYS: u32 = 88;
pub const ENOTEMPTY: u32 = 90;
pub const ENAMETOOLONG: u32 = 91;
pub const ELOOP: u32 = 92;
pub const EOPNOTSUPP: u32 = 95;
pub const EPFNOSUPPORT: u32 = 96;
pub const ECONNRESET: u32 = 104;
pub const ENOBUFS: u32 = 105;
pub const EAFNOSUPPORT: u32 = 106;
pub const EPROTOTYPE: u32 = 107;
pub const ENOTSOCK: u32 = 108;
pub const ENOPROTOOPT: u32 = 109;
pub const ESHUTDOWN: u32 = 110;
pub const ECONNREFUSED: u32 = 111;
pub const EADDRINUSE: u32 = 112;
pub const ECONNABORTED: u32 = 113;
pub const ENETUNREACH: u32 = 114;
pub const ENETDOWN: u32 = 115;
pub const ETIMEDOUT: u32 = 116;
pub const EHOSTDOWN: u32 = 117;
pub const EHOSTUNREACH: u32 = 118;
pub const EINPROGRESS: u32 = 119;
pub const EALREADY: u32 = 120;
pub const EDESTADDRREQ: u32 = 121;
pub const EMSGSIZE: u32 = 122;
pub const EPROTONOSUPPORT: u32 = 123;
pub const ESOCKTNOSUPPORT: u32 = 124;
pub const EADDRNOTAVAIL: u32 = 125;
pub const ENETRESET: u32 = 126;
pub const EISCONN: u32 = 127;
pub const ENOTCONN: u32 = 128;
pub const ETOOMANYREFS: u32 = 129;
pub const EPROCLIM: u32 = 130;
pub const EUSERS: u32 = 131;
pub const EDQUOT: u32 = 132;
pub const ESTALE: u32 = 133;
pub const ENOTSUP: u32 = 134;
pub const ENOMEDIUM: u32 = 135;
pub const EILSEQ: u32 = 138;
pub const EOVERFLOW: u32 = 139;
pub const ECANCELED: u32 = 140;
pub const ENOTRECOVERABLE: u32 = 141;
pub const EOWNERDEAD: u32 = 142;
pub const ESTRPIPE: u32 = 143;
pub const EWOULDBLOCK: u32 = 11;
pub const __ELASTERROR: u32 = 2000;
pub const K_HIGHEST_THREAD_PRIO: i32 = -16;
pub const K_LOWEST_THREAD_PRIO: u32 = 15;
pub const K_IDLE_PRIO: u32 = 15;
pub const K_HIGHEST_APPLICATION_THREAD_PRIO: i32 = -16;
pub const K_LOWEST_APPLICATION_THREAD_PRIO: u32 = 14;
pub const K_POLL_TYPE_IGNORE: u32 = 0;
pub const K_POLL_STATE_NOT_READY: u32 = 0;
pub const SYS_REBOOT_WARM: u32 = 0;
pub const SYS_REBOOT_COLD: u32 = 1;
pub type wchar_t = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::core::ffi::c_longlong,
    pub __clang_max_align_nonce2: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::core::mem::MaybeUninit<max_align_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<max_align_t>(),
        16usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<max_align_t>(),
        8usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type __int8_t = ::core::ffi::c_schar;
pub type __uint8_t = ::core::ffi::c_uchar;
pub type __int16_t = ::core::ffi::c_short;
pub type __uint16_t = ::core::ffi::c_ushort;
pub type __int32_t = ::core::ffi::c_int;
pub type __uint32_t = ::core::ffi::c_uint;
pub type __int64_t = ::core::ffi::c_longlong;
pub type __uint64_t = ::core::ffi::c_ulonglong;
pub type __int_least8_t = ::core::ffi::c_schar;
pub type __uint_least8_t = ::core::ffi::c_uchar;
pub type __int_least16_t = ::core::ffi::c_short;
pub type __uint_least16_t = ::core::ffi::c_ushort;
pub type __int_least32_t = ::core::ffi::c_int;
pub type __uint_least32_t = ::core::ffi::c_uint;
pub type __int_least64_t = ::core::ffi::c_longlong;
pub type __uint_least64_t = ::core::ffi::c_ulonglong;
pub type __intmax_t = ::core::ffi::c_longlong;
pub type __uintmax_t = ::core::ffi::c_ulonglong;
pub type __intptr_t = ::core::ffi::c_int;
pub type __uintptr_t = ::core::ffi::c_uint;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type int_least8_t = __int_least8_t;
pub type uint_least8_t = __uint_least8_t;
pub type int_least16_t = __int_least16_t;
pub type uint_least16_t = __uint_least16_t;
pub type int_least32_t = __int_least32_t;
pub type uint_least32_t = __uint_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::core::ffi::c_schar;
pub type uint_fast8_t = ::core::ffi::c_uchar;
pub type int_fast16_t = ::core::ffi::c_short;
pub type uint_fast16_t = ::core::ffi::c_ushort;
pub type int_fast32_t = ::core::ffi::c_int;
pub type uint_fast32_t = ::core::ffi::c_uint;
pub type int_fast64_t = ::core::ffi::c_longlong;
pub type uint_fast64_t = ::core::ffi::c_ulonglong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union z_max_align_t {
    pub thelonglong: ::core::ffi::c_longlong,
    pub thelongdouble: f64,
    pub theuintmax_t: uintmax_t,
    pub thesize_t: usize,
    pub theuintptr_t: usize,
    pub thepvoid: *mut ::core::ffi::c_void,
    pub thepfunc: ::core::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_z_max_align_t() {
    const UNINIT: ::core::mem::MaybeUninit<z_max_align_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<z_max_align_t>(),
        8usize,
        concat!("Size of: ", stringify!(z_max_align_t))
    );
    assert_eq!(
        ::core::mem::align_of::<z_max_align_t>(),
        8usize,
        concat!("Alignment of ", stringify!(z_max_align_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).thelonglong) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_max_align_t),
            "::",
            stringify!(thelonglong)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).thelongdouble) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_max_align_t),
            "::",
            stringify!(thelongdouble)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).theuintmax_t) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_max_align_t),
            "::",
            stringify!(theuintmax_t)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).thesize_t) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_max_align_t),
            "::",
            stringify!(thesize_t)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).theuintptr_t) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_max_align_t),
            "::",
            stringify!(theuintptr_t)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).thepvoid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_max_align_t),
            "::",
            stringify!(thepvoid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).thepfunc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_max_align_t),
            "::",
            stringify!(thepfunc)
        )
    );
}
pub type atomic_t = ::core::ffi::c_long;
pub type atomic_val_t = atomic_t;
pub type atomic_ptr_t = *mut ::core::ffi::c_void;
pub type atomic_ptr_val_t = atomic_ptr_t;
extern "C" {
    #[doc = " @brief Atomic compare-and-set.\n\n This routine performs an atomic compare-and-set on @a target. If the current\n value of @a target equals @a old_value, @a target is set to @a new_value.\n If the current value of @a target does not equal @a old_value, @a target\n is left unchanged.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param old_value Original value to compare against.\n @param new_value New value to store.\n @return true if @a new_value is written, false otherwise."]
    #[link_name = "atomic_cas__extern"]
    pub fn atomic_cas(
        target: *mut atomic_t,
        old_value: atomic_val_t,
        new_value: atomic_val_t,
    ) -> bool;
}
extern "C" {
    #[doc = " @brief Atomic compare-and-set with pointer values\n\n This routine performs an atomic compare-and-set on @a target. If the current\n value of @a target equals @a old_value, @a target is set to @a new_value.\n If the current value of @a target does not equal @a old_value, @a target\n is left unchanged.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param old_value Original value to compare against.\n @param new_value New value to store.\n @return true if @a new_value is written, false otherwise."]
    #[link_name = "atomic_ptr_cas__extern"]
    pub fn atomic_ptr_cas(
        target: *mut atomic_ptr_t,
        old_value: atomic_ptr_val_t,
        new_value: atomic_ptr_val_t,
    ) -> bool;
}
extern "C" {
    #[doc = " @brief Atomic addition.\n\n This routine performs an atomic addition on @a target.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param value Value to add.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_add__extern"]
    pub fn atomic_add(target: *mut atomic_t, value: atomic_val_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic subtraction.\n\n This routine performs an atomic subtraction on @a target.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param value Value to subtract.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_sub__extern"]
    pub fn atomic_sub(target: *mut atomic_t, value: atomic_val_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic increment.\n\n This routine performs an atomic increment by 1 on @a target.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_inc__extern"]
    pub fn atomic_inc(target: *mut atomic_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic decrement.\n\n This routine performs an atomic decrement by 1 on @a target.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_dec__extern"]
    pub fn atomic_dec(target: *mut atomic_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic get.\n\n This routine performs an atomic read on @a target.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n\n @return Value of @a target."]
    #[link_name = "atomic_get__extern"]
    pub fn atomic_get(target: *const atomic_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic get a pointer value\n\n This routine performs an atomic read on @a target.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of pointer variable.\n\n @return Value of @a target."]
    #[link_name = "atomic_ptr_get__extern"]
    pub fn atomic_ptr_get(target: *const atomic_ptr_t) -> atomic_ptr_val_t;
}
extern "C" {
    #[doc = " @brief Atomic get-and-set.\n\n This routine atomically sets @a target to @a value and returns\n the previous value of @a target.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param value Value to write to @a target.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_set__extern"]
    pub fn atomic_set(target: *mut atomic_t, value: atomic_val_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic get-and-set for pointer values\n\n This routine atomically sets @a target to @a value and returns\n the previous value of @a target.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param value Value to write to @a target.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_ptr_set__extern"]
    pub fn atomic_ptr_set(target: *mut atomic_ptr_t, value: atomic_ptr_val_t) -> atomic_ptr_val_t;
}
extern "C" {
    #[doc = " @brief Atomic clear.\n\n This routine atomically sets @a target to zero and returns its previous\n value. (Hence, it is equivalent to atomic_set(target, 0).)\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_clear__extern"]
    pub fn atomic_clear(target: *mut atomic_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic clear of a pointer value\n\n This routine atomically sets @a target to zero and returns its previous\n value. (Hence, it is equivalent to atomic_set(target, 0).)\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_ptr_clear__extern"]
    pub fn atomic_ptr_clear(target: *mut atomic_ptr_t) -> atomic_ptr_val_t;
}
extern "C" {
    #[doc = " @brief Atomic bitwise inclusive OR.\n\n This routine atomically sets @a target to the bitwise inclusive OR of\n @a target and @a value.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param value Value to OR.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_or__extern"]
    pub fn atomic_or(target: *mut atomic_t, value: atomic_val_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic bitwise exclusive OR (XOR).\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n This routine atomically sets @a target to the bitwise exclusive OR (XOR) of\n @a target and @a value.\n\n @param target Address of atomic variable.\n @param value Value to XOR\n\n @return Previous value of @a target."]
    #[link_name = "atomic_xor__extern"]
    pub fn atomic_xor(target: *mut atomic_t, value: atomic_val_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic bitwise AND.\n\n This routine atomically sets @a target to the bitwise AND of @a target\n and @a value.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param value Value to AND.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_and__extern"]
    pub fn atomic_and(target: *mut atomic_t, value: atomic_val_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomic bitwise NAND.\n\n This routine atomically sets @a target to the bitwise NAND of @a target\n and @a value. (This operation is equivalent to target = ~(target & value).)\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable.\n @param value Value to NAND.\n\n @return Previous value of @a target."]
    #[link_name = "atomic_nand__extern"]
    pub fn atomic_nand(target: *mut atomic_t, value: atomic_val_t) -> atomic_val_t;
}
extern "C" {
    #[doc = " @brief Atomically test a bit.\n\n This routine tests whether bit number @a bit of @a target is set or not.\n The target may be a single atomic variable or an array of them.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable or array.\n @param bit Bit number (starting from 0).\n\n @return true if the bit was set, false if it wasn't."]
    #[link_name = "atomic_test_bit__extern"]
    pub fn atomic_test_bit(target: *const atomic_t, bit: ::core::ffi::c_int) -> bool;
}
extern "C" {
    #[doc = " @brief Atomically test and clear a bit.\n\n Atomically clear bit number @a bit of @a target and return its old value.\n The target may be a single atomic variable or an array of them.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable or array.\n @param bit Bit number (starting from 0).\n\n @return false if the bit was already cleared, true if it wasn't."]
    #[link_name = "atomic_test_and_clear_bit__extern"]
    pub fn atomic_test_and_clear_bit(target: *mut atomic_t, bit: ::core::ffi::c_int) -> bool;
}
extern "C" {
    #[doc = " @brief Atomically set a bit.\n\n Atomically set bit number @a bit of @a target and return its old value.\n The target may be a single atomic variable or an array of them.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable or array.\n @param bit Bit number (starting from 0).\n\n @return true if the bit was already set, false if it wasn't."]
    #[link_name = "atomic_test_and_set_bit__extern"]
    pub fn atomic_test_and_set_bit(target: *mut atomic_t, bit: ::core::ffi::c_int) -> bool;
}
extern "C" {
    #[doc = " @brief Atomically clear a bit.\n\n Atomically clear bit number @a bit of @a target.\n The target may be a single atomic variable or an array of them.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable or array.\n @param bit Bit number (starting from 0)."]
    #[link_name = "atomic_clear_bit__extern"]
    pub fn atomic_clear_bit(target: *mut atomic_t, bit: ::core::ffi::c_int);
}
extern "C" {
    #[doc = " @brief Atomically set a bit.\n\n Atomically set bit number @a bit of @a target.\n The target may be a single atomic variable or an array of them.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable or array.\n @param bit Bit number (starting from 0)."]
    #[link_name = "atomic_set_bit__extern"]
    pub fn atomic_set_bit(target: *mut atomic_t, bit: ::core::ffi::c_int);
}
extern "C" {
    #[doc = " @brief Atomically set a bit to a given value.\n\n Atomically set bit number @a bit of @a target to value @a val.\n The target may be a single atomic variable or an array of them.\n\n @note As for all atomic APIs, includes a\n full/sequentially-consistent memory barrier (where applicable).\n\n @param target Address of atomic variable or array.\n @param bit Bit number (starting from 0).\n @param val true for 1, false for 0."]
    #[link_name = "atomic_set_bit_to__extern"]
    pub fn atomic_set_bit_to(target: *mut atomic_t, bit: ::core::ffi::c_int, val: bool);
}
extern "C" {
    pub fn assert_print(fmt: *const ::core::ffi::c_char, ...);
}
extern "C" {
    #[doc = " @brief Is @p x a power of two?\n @param x value to check\n @return true if @p x is a power of two, false otherwise"]
    #[link_name = "is_power_of_two__extern"]
    pub fn is_power_of_two(x: ::core::ffi::c_uint) -> bool;
}
extern "C" {
    #[doc = " @brief Arithmetic shift right\n @param value value to shift\n @param shift number of bits to shift\n @return @p value shifted right by @p shift; opened bit positions are\n         filled with the sign bit"]
    #[link_name = "arithmetic_shift_right__extern"]
    pub fn arithmetic_shift_right(value: i64, shift: u8) -> i64;
}
extern "C" {
    #[doc = " @brief byte by byte memcpy.\n\n Copy `size` bytes of `src` into `dest`. This is guaranteed to be done byte by byte.\n\n @param dst Pointer to the destination memory.\n @param src Pointer to the source of the data.\n @param size The number of bytes to copy."]
    #[link_name = "bytecpy__extern"]
    pub fn bytecpy(dst: *mut ::core::ffi::c_void, src: *const ::core::ffi::c_void, size: usize);
}
extern "C" {
    #[doc = " @brief byte by byte swap.\n\n Swap @a size bytes between memory regions @a a and @a b. This is\n guaranteed to be done byte by byte.\n\n @param a Pointer to the the first memory region.\n @param b Pointer to the the second memory region.\n @param size The number of bytes to swap."]
    #[link_name = "byteswp__extern"]
    pub fn byteswp(a: *mut ::core::ffi::c_void, b: *mut ::core::ffi::c_void, size: usize);
}
extern "C" {
    #[doc = " @brief      Convert a single character into a hexadecimal nibble.\n\n @param c     The character to convert\n @param x     The address of storage for the converted number.\n\n  @return Zero on success or (negative) error code otherwise."]
    pub fn char2hex(c: ::core::ffi::c_char, x: *mut u8) -> ::core::ffi::c_int;
}
extern "C" {
    #[doc = " @brief      Convert a single hexadecimal nibble into a character.\n\n @param c     The number to convert\n @param x     The address of storage for the converted character.\n\n  @return Zero on success or (negative) error code otherwise."]
    pub fn hex2char(x: u8, c: *mut ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    #[doc = " @brief      Convert a binary array into string representation.\n\n @param buf     The binary array to convert\n @param buflen  The length of the binary array to convert\n @param hex     Address of where to store the string representation.\n @param hexlen  Size of the storage area for string representation.\n\n @return     The length of the converted string, or 0 if an error occurred."]
    pub fn bin2hex(
        buf: *const u8,
        buflen: usize,
        hex: *mut ::core::ffi::c_char,
        hexlen: usize,
    ) -> usize;
}
extern "C" {
    #[doc = " @brief      Convert a hexadecimal string into a binary array.\n\n @param hex     The hexadecimal string to convert\n @param hexlen  The length of the hexadecimal string to convert.\n @param buf     Address of where to store the binary data\n @param buflen  Size of the storage area for binary data\n\n @return     The length of the binary array, or 0 if an error occurred."]
    pub fn hex2bin(
        hex: *const ::core::ffi::c_char,
        hexlen: usize,
        buf: *mut u8,
        buflen: usize,
    ) -> usize;
}
extern "C" {
    #[doc = " @brief Convert a binary coded decimal (BCD 8421) value to binary.\n\n @param bcd BCD 8421 value to convert.\n\n @return Binary representation of input value."]
    #[link_name = "bcd2bin__extern"]
    pub fn bcd2bin(bcd: u8) -> u8;
}
extern "C" {
    #[doc = " @brief Convert a binary value to binary coded decimal (BCD 8421).\n\n @param bin Binary value to convert.\n\n @return BCD 8421 representation of input value."]
    #[link_name = "bin2bcd__extern"]
    pub fn bin2bcd(bin: u8) -> u8;
}
extern "C" {
    #[doc = " @brief      Convert a uint8_t into a decimal string representation.\n\n Convert a uint8_t value into its ASCII decimal string representation.\n The string is terminated if there is enough space in buf.\n\n @param buf     Address of where to store the string representation.\n @param buflen  Size of the storage area for string representation.\n @param value   The value to convert to decimal string\n\n @return     The length of the converted string (excluding terminator if\n             any), or 0 if an error occurred."]
    pub fn u8_to_dec(buf: *mut ::core::ffi::c_char, buflen: u8, value: u8) -> u8;
}
extern "C" {
    #[doc = " @brief Properly truncate a NULL-terminated UTF-8 string\n\n Take a NULL-terminated UTF-8 string and ensure that if the string has been\n truncated (by setting the NULL terminator) earlier by other means, that\n the string ends with a properly formatted UTF-8 character (1-4 bytes).\n\n @htmlonly\n Example:\n      char test_str[] = \"\";\n      char trunc_utf8[8];\n\n      printf(\"Original : %s\\n\", test_str); // \n      strncpy(trunc_utf8, test_str, sizeof(trunc_utf8));\n      trunc_utf8[sizeof(trunc_utf8) - 1] = '\\0';\n      printf(\"Bad      : %s\\n\", trunc_utf8); // \n      utf8_trunc(trunc_utf8);\n      printf(\"Truncated: %s\\n\", trunc_utf8); // \n @endhtmlonly\n\n @param utf8_str NULL-terminated string\n\n @return Pointer to the @p utf8_str"]
    pub fn utf8_trunc(utf8_str: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    #[doc = " @brief Copies a UTF-8 encoded string from @p src to @p dst\n\n The resulting @p dst will always be NULL terminated if @p n is larger than 0,\n and the @p dst string will always be properly UTF-8 truncated.\n\n @param dst The destination of the UTF-8 string.\n @param src The source string\n @param n   The size of the @p dst buffer. Maximum number of characters copied\n            is @p n - 1. If 0 nothing will be done, and the @p dst will not be\n            NULL terminated.\n\n @return Pointer to the @p dst"]
    pub fn utf8_lcpy(
        dst: *mut ::core::ffi::c_char,
        src: *const ::core::ffi::c_char,
        n: usize,
    ) -> *mut ::core::ffi::c_char;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _dnode {
    pub __bindgen_anon_1: _dnode__bindgen_ty_1,
    pub __bindgen_anon_2: _dnode__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _dnode__bindgen_ty_1 {
    pub head: *mut _dnode,
    pub next: *mut _dnode,
}
#[test]
fn bindgen_test_layout__dnode__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_dnode__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_dnode__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_dnode__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<_dnode__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_dnode__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dnode__bindgen_ty_1),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dnode__bindgen_ty_1),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _dnode__bindgen_ty_2 {
    pub tail: *mut _dnode,
    pub prev: *mut _dnode,
}
#[test]
fn bindgen_test_layout__dnode__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<_dnode__bindgen_ty_2> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_dnode__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(_dnode__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<_dnode__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(_dnode__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tail) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dnode__bindgen_ty_2),
            "::",
            stringify!(tail)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_dnode__bindgen_ty_2),
            "::",
            stringify!(prev)
        )
    );
}
#[test]
fn bindgen_test_layout__dnode() {
    assert_eq!(
        ::core::mem::size_of::<_dnode>(),
        8usize,
        concat!("Size of: ", stringify!(_dnode))
    );
    assert_eq!(
        ::core::mem::align_of::<_dnode>(),
        4usize,
        concat!("Alignment of ", stringify!(_dnode))
    );
}
#[doc = " @brief Doubly-linked list structure."]
pub type sys_dlist_t = _dnode;
#[doc = " @brief Doubly-linked list node structure."]
pub type sys_dnode_t = _dnode;
extern "C" {
    #[doc = " @brief initialize list to its empty state\n\n @param list the doubly-linked list"]
    #[link_name = "sys_dlist_init__extern"]
    pub fn sys_dlist_init(list: *mut sys_dlist_t);
}
extern "C" {
    #[doc = " @brief initialize node to its state when not in a list\n\n @param node the node"]
    #[link_name = "sys_dnode_init__extern"]
    pub fn sys_dnode_init(node: *mut sys_dnode_t);
}
extern "C" {
    #[doc = " @brief check if a node is a member of any list\n\n @param node the node\n\n @return true if node is linked into a list, false if it is not"]
    #[link_name = "sys_dnode_is_linked__extern"]
    pub fn sys_dnode_is_linked(node: *const sys_dnode_t) -> bool;
}
extern "C" {
    #[doc = " @brief check if a node is the list's head\n\n @param list the doubly-linked list to operate on\n @param node the node to check\n\n @return true if node is the head, false otherwise"]
    #[link_name = "sys_dlist_is_head__extern"]
    pub fn sys_dlist_is_head(list: *mut sys_dlist_t, node: *mut sys_dnode_t) -> bool;
}
extern "C" {
    #[doc = " @brief check if a node is the list's tail\n\n @param list the doubly-linked list to operate on\n @param node the node to check\n\n @return true if node is the tail, false otherwise"]
    #[link_name = "sys_dlist_is_tail__extern"]
    pub fn sys_dlist_is_tail(list: *mut sys_dlist_t, node: *mut sys_dnode_t) -> bool;
}
extern "C" {
    #[doc = " @brief check if the list is empty\n\n @param list the doubly-linked list to operate on\n\n @return true if empty, false otherwise"]
    #[link_name = "sys_dlist_is_empty__extern"]
    pub fn sys_dlist_is_empty(list: *mut sys_dlist_t) -> bool;
}
extern "C" {
    #[doc = " @brief check if more than one node present\n\n This and other sys_dlist_*() functions are not thread safe.\n\n @param list the doubly-linked list to operate on\n\n @return true if multiple nodes, false otherwise"]
    #[link_name = "sys_dlist_has_multiple_nodes__extern"]
    pub fn sys_dlist_has_multiple_nodes(list: *mut sys_dlist_t) -> bool;
}
extern "C" {
    #[doc = " @brief get a reference to the head item in the list\n\n @param list the doubly-linked list to operate on\n\n @return a pointer to the head element, NULL if list is empty"]
    #[link_name = "sys_dlist_peek_head__extern"]
    pub fn sys_dlist_peek_head(list: *mut sys_dlist_t) -> *mut sys_dnode_t;
}
extern "C" {
    #[doc = " @brief get a reference to the head item in the list\n\n The list must be known to be non-empty.\n\n @param list the doubly-linked list to operate on\n\n @return a pointer to the head element"]
    #[link_name = "sys_dlist_peek_head_not_empty__extern"]
    pub fn sys_dlist_peek_head_not_empty(list: *mut sys_dlist_t) -> *mut sys_dnode_t;
}
extern "C" {
    #[doc = " @brief get a reference to the next item in the list, node is not NULL\n\n Faster than sys_dlist_peek_next() if node is known not to be NULL.\n\n @param list the doubly-linked list to operate on\n @param node the node from which to get the next element in the list\n\n @return a pointer to the next element from a node, NULL if node is the tail"]
    #[link_name = "sys_dlist_peek_next_no_check__extern"]
    pub fn sys_dlist_peek_next_no_check(
        list: *mut sys_dlist_t,
        node: *mut sys_dnode_t,
    ) -> *mut sys_dnode_t;
}
extern "C" {
    #[doc = " @brief get a reference to the next item in the list\n\n @param list the doubly-linked list to operate on\n @param node the node from which to get the next element in the list\n\n @return a pointer to the next element from a node, NULL if node is the tail\n or NULL (when node comes from reading the head of an empty list)."]
    #[link_name = "sys_dlist_peek_next__extern"]
    pub fn sys_dlist_peek_next(list: *mut sys_dlist_t, node: *mut sys_dnode_t) -> *mut sys_dnode_t;
}
extern "C" {
    #[doc = " @brief get a reference to the previous item in the list, node is not NULL\n\n Faster than sys_dlist_peek_prev() if node is known not to be NULL.\n\n @param list the doubly-linked list to operate on\n @param node the node from which to get the previous element in the list\n\n @return a pointer to the previous element from a node, NULL if node is the\n\t   tail"]
    #[link_name = "sys_dlist_peek_prev_no_check__extern"]
    pub fn sys_dlist_peek_prev_no_check(
        list: *mut sys_dlist_t,
        node: *mut sys_dnode_t,
    ) -> *mut sys_dnode_t;
}
extern "C" {
    #[doc = " @brief get a reference to the previous item in the list\n\n @param list the doubly-linked list to operate on\n @param node the node from which to get the previous element in the list\n\n @return a pointer to the previous element from a node, NULL if node is the\n \t   tail or NULL (when node comes from reading the head of an empty\n \t   list)."]
    #[link_name = "sys_dlist_peek_prev__extern"]
    pub fn sys_dlist_peek_prev(list: *mut sys_dlist_t, node: *mut sys_dnode_t) -> *mut sys_dnode_t;
}
extern "C" {
    #[doc = " @brief get a reference to the tail item in the list\n\n @param list the doubly-linked list to operate on\n\n @return a pointer to the tail element, NULL if list is empty"]
    #[link_name = "sys_dlist_peek_tail__extern"]
    pub fn sys_dlist_peek_tail(list: *mut sys_dlist_t) -> *mut sys_dnode_t;
}
extern "C" {
    #[doc = " @brief add node to tail of list\n\n This and other sys_dlist_*() functions are not thread safe.\n\n @param list the doubly-linked list to operate on\n @param node the element to append"]
    #[link_name = "sys_dlist_append__extern"]
    pub fn sys_dlist_append(list: *mut sys_dlist_t, node: *mut sys_dnode_t);
}
extern "C" {
    #[doc = " @brief add node to head of list\n\n This and other sys_dlist_*() functions are not thread safe.\n\n @param list the doubly-linked list to operate on\n @param node the element to append"]
    #[link_name = "sys_dlist_prepend__extern"]
    pub fn sys_dlist_prepend(list: *mut sys_dlist_t, node: *mut sys_dnode_t);
}
extern "C" {
    #[doc = " @brief Insert a node into a list\n\n Insert a node before a specified node in a dlist.\n\n @param successor the position before which \"node\" will be inserted\n @param node the element to insert"]
    #[link_name = "sys_dlist_insert__extern"]
    pub fn sys_dlist_insert(successor: *mut sys_dnode_t, node: *mut sys_dnode_t);
}
extern "C" {
    #[doc = " @brief insert node at position\n\n Insert a node in a location depending on a external condition. The cond()\n function checks if the node is to be inserted _before_ the current node\n against which it is checked.\n This and other sys_dlist_*() functions are not thread safe.\n\n @param list the doubly-linked list to operate on\n @param node the element to insert\n @param cond a function that determines if the current node is the correct\n             insert point\n @param data parameter to cond()"]
    #[link_name = "sys_dlist_insert_at__extern"]
    pub fn sys_dlist_insert_at(
        list: *mut sys_dlist_t,
        node: *mut sys_dnode_t,
        cond: ::core::option::Option<
            unsafe extern "C" fn(
                node: *mut sys_dnode_t,
                data: *mut ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
        data: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " @brief remove a specific node from a list\n\n The list is implicit from the node. The node must be part of a list.\n This and other sys_dlist_*() functions are not thread safe.\n\n @param node the node to remove"]
    #[link_name = "sys_dlist_remove__extern"]
    pub fn sys_dlist_remove(node: *mut sys_dnode_t);
}
extern "C" {
    #[doc = " @brief get the first node in a list\n\n This and other sys_dlist_*() functions are not thread safe.\n\n @param list the doubly-linked list to operate on\n\n @return the first node in the list, NULL if list is empty"]
    #[link_name = "sys_dlist_get__extern"]
    pub fn sys_dlist_get(list: *mut sys_dlist_t) -> *mut sys_dnode_t;
}
extern "C" {
    #[doc = " @brief Compute the size of the given list in O(n) time\n\n @param list A pointer on the list\n\n @return an integer equal to the size of the list, or 0 if empty"]
    #[link_name = "sys_dlist_len__extern"]
    pub fn sys_dlist_len(list: *mut sys_dlist_t) -> usize;
}
#[doc = " @brief Balanced red/black tree node structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rbnode {
    #[doc = " @cond INTERNAL_HIDDEN"]
    pub children: [*mut rbnode; 2usize],
}
#[test]
fn bindgen_test_layout_rbnode() {
    const UNINIT: ::core::mem::MaybeUninit<rbnode> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rbnode>(),
        8usize,
        concat!("Size of: ", stringify!(rbnode))
    );
    assert_eq!(
        ::core::mem::align_of::<rbnode>(),
        4usize,
        concat!("Alignment of ", stringify!(rbnode))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).children) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rbnode),
            "::",
            stringify!(children)
        )
    );
}
#[doc = " @typedef rb_lessthan_t\n @brief Red/black tree comparison predicate\n\n Compares the two nodes and returns true if node A is strictly less\n than B according to the tree's sorting criteria, false otherwise.\n\n Note that during insert, the new node being inserted will always be\n \"A\", where \"B\" is the existing node within the tree against which\n it is being compared.  This trait can be used (with care!) to\n implement \"most/least recently added\" semantics between nodes which\n would otherwise compare as equal."]
pub type rb_lessthan_t =
    ::core::option::Option<unsafe extern "C" fn(a: *mut rbnode, b: *mut rbnode) -> bool>;
#[doc = " @brief Balanced red/black tree structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rbtree {
    #[doc = " Root node of the tree"]
    pub root: *mut rbnode,
    #[doc = " Comparison function for nodes in the tree"]
    pub lessthan_fn: rb_lessthan_t,
    #[doc = " @cond INTERNAL_HIDDEN"]
    pub max_depth: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_rbtree() {
    const UNINIT: ::core::mem::MaybeUninit<rbtree> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<rbtree>(),
        12usize,
        concat!("Size of: ", stringify!(rbtree))
    );
    assert_eq!(
        ::core::mem::align_of::<rbtree>(),
        4usize,
        concat!("Alignment of ", stringify!(rbtree))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).root) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rbtree),
            "::",
            stringify!(root)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lessthan_fn) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rbtree),
            "::",
            stringify!(lessthan_fn)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_depth) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rbtree),
            "::",
            stringify!(max_depth)
        )
    );
}
#[doc = " @brief Prototype for node visitor callback.\n @param node Node being visited\n @param cookie User-specified data"]
pub type rb_visit_t = ::core::option::Option<
    unsafe extern "C" fn(node: *mut rbnode, cookie: *mut ::core::ffi::c_void),
>;
extern "C" {
    pub fn z_rb_child(node: *mut rbnode, side: u8) -> *mut rbnode;
}
extern "C" {
    pub fn z_rb_is_black(node: *mut rbnode) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn z_rb_walk(node: *mut rbnode, visit_fn: rb_visit_t, cookie: *mut ::core::ffi::c_void);
}
extern "C" {
    pub fn z_rb_get_minmax(tree: *mut rbtree, side: u8) -> *mut rbnode;
}
extern "C" {
    #[doc = " @brief Insert node into tree"]
    pub fn rb_insert(tree: *mut rbtree, node: *mut rbnode);
}
extern "C" {
    #[doc = " @brief Remove node from tree"]
    pub fn rb_remove(tree: *mut rbtree, node: *mut rbnode);
}
extern "C" {
    #[doc = " @brief Returns the lowest-sorted member of the tree"]
    #[link_name = "rb_get_min__extern"]
    pub fn rb_get_min(tree: *mut rbtree) -> *mut rbnode;
}
extern "C" {
    #[doc = " @brief Returns the highest-sorted member of the tree"]
    #[link_name = "rb_get_max__extern"]
    pub fn rb_get_max(tree: *mut rbtree) -> *mut rbnode;
}
extern "C" {
    #[doc = " @brief Returns true if the given node is part of the tree\n\n Note that this does not internally dereference the node pointer\n (though the tree's lessthan callback might!), it just tests it for\n equality with items in the tree.  So it's feasible to use this to\n implement a \"set\" construct by simply testing the pointer value\n itself."]
    pub fn rb_contains(tree: *mut rbtree, node: *mut rbnode) -> bool;
}
extern "C" {
    #[doc = " @brief Walk/enumerate a rbtree\n\n Very simple recursive enumeration.  Low code size, but requiring a\n separate function can be clumsy for the user and there is no way to\n break out of the loop early.  See RB_FOR_EACH for an iterative\n implementation."]
    #[link_name = "rb_walk__extern"]
    pub fn rb_walk(tree: *mut rbtree, visit_fn: rb_visit_t, cookie: *mut ::core::ffi::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _rb_foreach {
    pub stack: *mut *mut rbnode,
    pub is_left: *mut u8,
    pub top: i32,
}
#[test]
fn bindgen_test_layout__rb_foreach() {
    const UNINIT: ::core::mem::MaybeUninit<_rb_foreach> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_rb_foreach>(),
        12usize,
        concat!("Size of: ", stringify!(_rb_foreach))
    );
    assert_eq!(
        ::core::mem::align_of::<_rb_foreach>(),
        4usize,
        concat!("Alignment of ", stringify!(_rb_foreach))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stack) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_rb_foreach),
            "::",
            stringify!(stack)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_left) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_rb_foreach),
            "::",
            stringify!(is_left)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).top) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_rb_foreach),
            "::",
            stringify!(top)
        )
    );
}
extern "C" {
    pub fn z_rb_foreach_next(tree: *mut rbtree, f: *mut _rb_foreach) -> *mut rbnode;
}
extern "C" {
    pub fn z_priq_dumb_best(pq: *mut sys_dlist_t) -> *mut k_thread;
}
extern "C" {
    pub fn z_priq_dumb_remove(pq: *mut sys_dlist_t, thread: *mut k_thread);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _priq_rb {
    pub tree: rbtree,
    pub next_order_key: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout__priq_rb() {
    const UNINIT: ::core::mem::MaybeUninit<_priq_rb> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_priq_rb>(),
        16usize,
        concat!("Size of: ", stringify!(_priq_rb))
    );
    assert_eq!(
        ::core::mem::align_of::<_priq_rb>(),
        4usize,
        concat!("Alignment of ", stringify!(_priq_rb))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tree) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_priq_rb),
            "::",
            stringify!(tree)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next_order_key) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_priq_rb),
            "::",
            stringify!(next_order_key)
        )
    );
}
extern "C" {
    pub fn z_priq_rb_add(pq: *mut _priq_rb, thread: *mut k_thread);
}
extern "C" {
    pub fn z_priq_rb_remove(pq: *mut _priq_rb, thread: *mut k_thread);
}
extern "C" {
    pub fn z_priq_rb_best(pq: *mut _priq_rb) -> *mut k_thread;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _priq_mq {
    pub queues: [sys_dlist_t; 32usize],
    pub bitmask: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout__priq_mq() {
    const UNINIT: ::core::mem::MaybeUninit<_priq_mq> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_priq_mq>(),
        260usize,
        concat!("Size of: ", stringify!(_priq_mq))
    );
    assert_eq!(
        ::core::mem::align_of::<_priq_mq>(),
        4usize,
        concat!("Alignment of ", stringify!(_priq_mq))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).queues) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_priq_mq),
            "::",
            stringify!(queues)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).bitmask) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(_priq_mq),
            "::",
            stringify!(bitmask)
        )
    );
}
extern "C" {
    pub fn z_priq_mq_best(pq: *mut _priq_mq) -> *mut k_thread;
}
#[doc = " @cond INTERNAL_HIDDEN"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _snode {
    pub next: *mut _snode,
}
#[test]
fn bindgen_test_layout__snode() {
    const UNINIT: ::core::mem::MaybeUninit<_snode> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_snode>(),
        4usize,
        concat!("Size of: ", stringify!(_snode))
    );
    assert_eq!(
        ::core::mem::align_of::<_snode>(),
        4usize,
        concat!("Alignment of ", stringify!(_snode))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_snode),
            "::",
            stringify!(next)
        )
    );
}
#[doc = " Single-linked list node structure."]
pub type sys_snode_t = _snode;
#[doc = " @cond INTERNAL_HIDDEN"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _slist {
    pub head: *mut sys_snode_t,
    pub tail: *mut sys_snode_t,
}
#[test]
fn bindgen_test_layout__slist() {
    const UNINIT: ::core::mem::MaybeUninit<_slist> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_slist>(),
        8usize,
        concat!("Size of: ", stringify!(_slist))
    );
    assert_eq!(
        ::core::mem::align_of::<_slist>(),
        4usize,
        concat!("Alignment of ", stringify!(_slist))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_slist),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tail) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_slist),
            "::",
            stringify!(tail)
        )
    );
}
#[doc = " Single-linked list structure."]
pub type sys_slist_t = _slist;
extern "C" {
    #[doc = " @brief Initialize a list\n\n @param list A pointer on the list to initialize"]
    #[link_name = "sys_slist_init__extern"]
    pub fn sys_slist_init(list: *mut sys_slist_t);
}
extern "C" {
    #[link_name = "z_snode_next_peek__extern"]
    pub fn z_snode_next_peek(node: *mut sys_snode_t) -> *mut sys_snode_t;
}
extern "C" {
    #[link_name = "z_snode_next_set__extern"]
    pub fn z_snode_next_set(parent: *mut sys_snode_t, child: *mut sys_snode_t);
}
extern "C" {
    #[link_name = "z_slist_head_set__extern"]
    pub fn z_slist_head_set(list: *mut sys_slist_t, node: *mut sys_snode_t);
}
extern "C" {
    #[link_name = "z_slist_tail_set__extern"]
    pub fn z_slist_tail_set(list: *mut sys_slist_t, node: *mut sys_snode_t);
}
extern "C" {
    #[doc = " @brief Peek the first node from the list\n\n @param list A point on the list to peek the first node from\n\n @return A pointer on the first node of the list (or NULL if none)"]
    #[link_name = "sys_slist_peek_head__extern"]
    pub fn sys_slist_peek_head(list: *mut sys_slist_t) -> *mut sys_snode_t;
}
extern "C" {
    #[doc = " @brief Peek the last node from the list\n\n @param list A point on the list to peek the last node from\n\n @return A pointer on the last node of the list (or NULL if none)"]
    #[link_name = "sys_slist_peek_tail__extern"]
    pub fn sys_slist_peek_tail(list: *mut sys_slist_t) -> *mut sys_snode_t;
}
extern "C" {
    #[doc = " @brief Test if the given list is empty\n\n @param list A pointer on the list to test\n\n @return a boolean, true if it's empty, false otherwise"]
    #[link_name = "sys_slist_is_empty__extern"]
    pub fn sys_slist_is_empty(list: *mut sys_slist_t) -> bool;
}
extern "C" {
    #[doc = " @brief Peek the next node from current node, node is not NULL\n\n Faster then sys_slist_peek_next() if node is known not to be NULL.\n\n @param node A pointer on the node where to peek the next node\n\n @return a pointer on the next node (or NULL if none)"]
    #[link_name = "sys_slist_peek_next_no_check__extern"]
    pub fn sys_slist_peek_next_no_check(node: *mut sys_snode_t) -> *mut sys_snode_t;
}
extern "C" {
    #[doc = " @brief Peek the next node from current node\n\n @param node A pointer on the node where to peek the next node\n\n @return a pointer on the next node (or NULL if none)"]
    #[link_name = "sys_slist_peek_next__extern"]
    pub fn sys_slist_peek_next(node: *mut sys_snode_t) -> *mut sys_snode_t;
}
extern "C" {
    #[doc = " @brief Prepend a node to the given list\n\n This and other sys_slist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param node A pointer on the node to prepend"]
    #[link_name = "sys_slist_prepend__extern"]
    pub fn sys_slist_prepend(list: *mut sys_slist_t, node: *mut sys_snode_t);
}
extern "C" {
    #[doc = " @brief Append a node to the given list\n\n This and other sys_slist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param node A pointer on the node to append"]
    #[link_name = "sys_slist_append__extern"]
    pub fn sys_slist_append(list: *mut sys_slist_t, node: *mut sys_snode_t);
}
extern "C" {
    #[doc = " @brief Append a list to the given list\n\n Append a singly-linked, NULL-terminated list consisting of nodes containing\n the pointer to the next node as the first element of a node, to @a list.\n This and other sys_slist_*() functions are not thread safe.\n\n FIXME: Why are the element parameters void *?\n\n @param list A pointer on the list to affect\n @param head A pointer to the first element of the list to append\n @param tail A pointer to the last element of the list to append"]
    #[link_name = "sys_slist_append_list__extern"]
    pub fn sys_slist_append_list(
        list: *mut sys_slist_t,
        head: *mut ::core::ffi::c_void,
        tail: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " @brief merge two slists, appending the second one to the first\n\n When the operation is completed, the appending list is empty.\n This and other sys_slist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param list_to_append A pointer to the list to append."]
    #[link_name = "sys_slist_merge_slist__extern"]
    pub fn sys_slist_merge_slist(list: *mut sys_slist_t, list_to_append: *mut sys_slist_t);
}
extern "C" {
    #[doc = " @brief Insert a node to the given list\n\n This and other sys_slist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param prev A pointer on the previous node\n @param node A pointer on the node to insert"]
    #[link_name = "sys_slist_insert__extern"]
    pub fn sys_slist_insert(list: *mut sys_slist_t, prev: *mut sys_snode_t, node: *mut sys_snode_t);
}
extern "C" {
    #[doc = " @brief Fetch and remove the first node of the given list\n\n List must be known to be non-empty.\n This and other sys_slist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n\n @return A pointer to the first node of the list"]
    #[link_name = "sys_slist_get_not_empty__extern"]
    pub fn sys_slist_get_not_empty(list: *mut sys_slist_t) -> *mut sys_snode_t;
}
extern "C" {
    #[doc = " @brief Fetch and remove the first node of the given list\n\n This and other sys_slist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n\n @return A pointer to the first node of the list (or NULL if empty)"]
    #[link_name = "sys_slist_get__extern"]
    pub fn sys_slist_get(list: *mut sys_slist_t) -> *mut sys_snode_t;
}
extern "C" {
    #[doc = " @brief Remove a node\n\n This and other sys_slist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param prev_node A pointer on the previous node\n        (can be NULL, which means the node is the list's head)\n @param node A pointer on the node to remove"]
    #[link_name = "sys_slist_remove__extern"]
    pub fn sys_slist_remove(
        list: *mut sys_slist_t,
        prev_node: *mut sys_snode_t,
        node: *mut sys_snode_t,
    );
}
extern "C" {
    #[doc = " @brief Find and remove a node from a list\n\n This and other sys_slist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param node A pointer on the node to remove from the list\n\n @return true if node was removed"]
    #[link_name = "sys_slist_find_and_remove__extern"]
    pub fn sys_slist_find_and_remove(list: *mut sys_slist_t, node: *mut sys_snode_t) -> bool;
}
extern "C" {
    #[doc = " @brief Compute the size of the given list in O(n) time\n\n @param list A pointer on the list\n\n @return an integer equal to the size of the list, or 0 if empty"]
    #[link_name = "sys_slist_len__extern"]
    pub fn sys_slist_len(list: *mut sys_slist_t) -> usize;
}
pub type unative_t = u32;
#[doc = " @cond INTERNAL_HIDDEN"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _sfnode {
    pub next_and_flags: unative_t,
}
#[test]
fn bindgen_test_layout__sfnode() {
    const UNINIT: ::core::mem::MaybeUninit<_sfnode> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_sfnode>(),
        4usize,
        concat!("Size of: ", stringify!(_sfnode))
    );
    assert_eq!(
        ::core::mem::align_of::<_sfnode>(),
        4usize,
        concat!("Alignment of ", stringify!(_sfnode))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next_and_flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_sfnode),
            "::",
            stringify!(next_and_flags)
        )
    );
}
#[doc = " Flagged single-linked list node structure."]
pub type sys_sfnode_t = _sfnode;
#[doc = " @cond INTERNAL_HIDDEN"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _sflist {
    pub head: *mut sys_sfnode_t,
    pub tail: *mut sys_sfnode_t,
}
#[test]
fn bindgen_test_layout__sflist() {
    const UNINIT: ::core::mem::MaybeUninit<_sflist> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_sflist>(),
        8usize,
        concat!("Size of: ", stringify!(_sflist))
    );
    assert_eq!(
        ::core::mem::align_of::<_sflist>(),
        4usize,
        concat!("Alignment of ", stringify!(_sflist))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).head) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_sflist),
            "::",
            stringify!(head)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tail) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_sflist),
            "::",
            stringify!(tail)
        )
    );
}
#[doc = " Flagged single-linked list structure."]
pub type sys_sflist_t = _sflist;
extern "C" {
    #[doc = " @brief Initialize a list\n\n @param list A pointer on the list to initialize"]
    #[link_name = "sys_sflist_init__extern"]
    pub fn sys_sflist_init(list: *mut sys_sflist_t);
}
extern "C" {
    #[link_name = "z_sfnode_next_peek__extern"]
    pub fn z_sfnode_next_peek(node: *mut sys_sfnode_t) -> *mut sys_sfnode_t;
}
extern "C" {
    #[doc = " @brief Fetch flags value for a particular sfnode\n\n @param node A pointer to the node to fetch flags from\n @return The value of flags, which will be between 0 and 3"]
    #[link_name = "sys_sfnode_flags_get__extern"]
    pub fn sys_sfnode_flags_get(node: *mut sys_sfnode_t) -> u8;
}
extern "C" {
    #[link_name = "z_sfnode_next_set__extern"]
    pub fn z_sfnode_next_set(parent: *mut sys_sfnode_t, child: *mut sys_sfnode_t);
}
extern "C" {
    #[link_name = "z_sflist_head_set__extern"]
    pub fn z_sflist_head_set(list: *mut sys_sflist_t, node: *mut sys_sfnode_t);
}
extern "C" {
    #[link_name = "z_sflist_tail_set__extern"]
    pub fn z_sflist_tail_set(list: *mut sys_sflist_t, node: *mut sys_sfnode_t);
}
extern "C" {
    #[doc = " @brief Peek the first node from the list\n\n @param list A point on the list to peek the first node from\n\n @return A pointer on the first node of the list (or NULL if none)"]
    #[link_name = "sys_sflist_peek_head__extern"]
    pub fn sys_sflist_peek_head(list: *mut sys_sflist_t) -> *mut sys_sfnode_t;
}
extern "C" {
    #[doc = " @brief Peek the last node from the list\n\n @param list A point on the list to peek the last node from\n\n @return A pointer on the last node of the list (or NULL if none)"]
    #[link_name = "sys_sflist_peek_tail__extern"]
    pub fn sys_sflist_peek_tail(list: *mut sys_sflist_t) -> *mut sys_sfnode_t;
}
extern "C" {
    #[doc = " @brief Initialize an sflist node\n\n Set an initial flags value for this slist node, which can be a value between\n 0 and 3. These flags will persist even if the node is moved around\n within a list, removed, or transplanted to a different slist.\n\n This is ever so slightly faster than sys_sfnode_flags_set() and should\n only be used on a node that hasn't been added to any list.\n\n @param node A pointer to the node to set the flags on\n @param flags A value between 0 and 3 to set the flags value"]
    #[link_name = "sys_sfnode_init__extern"]
    pub fn sys_sfnode_init(node: *mut sys_sfnode_t, flags: u8);
}
extern "C" {
    #[doc = " @brief Set flags value for an sflist node\n\n Set a flags value for this slist node, which can be a value between\n 0 and 3. These flags will persist even if the node is moved around\n within a list, removed, or transplanted to a different slist.\n\n @param node A pointer to the node to set the flags on\n @param flags A value between 0 and 3 to set the flags value"]
    #[link_name = "sys_sfnode_flags_set__extern"]
    pub fn sys_sfnode_flags_set(node: *mut sys_sfnode_t, flags: u8);
}
extern "C" {
    #[doc = " @brief Test if the given list is empty\n\n @param list A pointer on the list to test\n\n @return a boolean, true if it's empty, false otherwise"]
    #[link_name = "sys_sflist_is_empty__extern"]
    pub fn sys_sflist_is_empty(list: *mut sys_sflist_t) -> bool;
}
extern "C" {
    #[doc = " @brief Peek the next node from current node, node is not NULL\n\n Faster then sys_sflist_peek_next() if node is known not to be NULL.\n\n @param node A pointer on the node where to peek the next node\n\n @return a pointer on the next node (or NULL if none)"]
    #[link_name = "sys_sflist_peek_next_no_check__extern"]
    pub fn sys_sflist_peek_next_no_check(node: *mut sys_sfnode_t) -> *mut sys_sfnode_t;
}
extern "C" {
    #[doc = " @brief Peek the next node from current node\n\n @param node A pointer on the node where to peek the next node\n\n @return a pointer on the next node (or NULL if none)"]
    #[link_name = "sys_sflist_peek_next__extern"]
    pub fn sys_sflist_peek_next(node: *mut sys_sfnode_t) -> *mut sys_sfnode_t;
}
extern "C" {
    #[doc = " @brief Prepend a node to the given list\n\n This and other sys_sflist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param node A pointer on the node to prepend"]
    #[link_name = "sys_sflist_prepend__extern"]
    pub fn sys_sflist_prepend(list: *mut sys_sflist_t, node: *mut sys_sfnode_t);
}
extern "C" {
    #[doc = " @brief Append a node to the given list\n\n This and other sys_sflist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param node A pointer on the node to append"]
    #[link_name = "sys_sflist_append__extern"]
    pub fn sys_sflist_append(list: *mut sys_sflist_t, node: *mut sys_sfnode_t);
}
extern "C" {
    #[doc = " @brief Append a list to the given list\n\n Append a singly-linked, NULL-terminated list consisting of nodes containing\n the pointer to the next node as the first element of a node, to @a list.\n This and other sys_sflist_*() functions are not thread safe.\n\n FIXME: Why are the element parameters void *?\n\n @param list A pointer on the list to affect\n @param head A pointer to the first element of the list to append\n @param tail A pointer to the last element of the list to append"]
    #[link_name = "sys_sflist_append_list__extern"]
    pub fn sys_sflist_append_list(
        list: *mut sys_sflist_t,
        head: *mut ::core::ffi::c_void,
        tail: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " @brief merge two sflists, appending the second one to the first\n\n When the operation is completed, the appending list is empty.\n This and other sys_sflist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param list_to_append A pointer to the list to append."]
    #[link_name = "sys_sflist_merge_sflist__extern"]
    pub fn sys_sflist_merge_sflist(list: *mut sys_sflist_t, list_to_append: *mut sys_sflist_t);
}
extern "C" {
    #[doc = " @brief Insert a node to the given list\n\n This and other sys_sflist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param prev A pointer on the previous node\n @param node A pointer on the node to insert"]
    #[link_name = "sys_sflist_insert__extern"]
    pub fn sys_sflist_insert(
        list: *mut sys_sflist_t,
        prev: *mut sys_sfnode_t,
        node: *mut sys_sfnode_t,
    );
}
extern "C" {
    #[doc = " @brief Fetch and remove the first node of the given list\n\n List must be known to be non-empty.\n This and other sys_sflist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n\n @return A pointer to the first node of the list"]
    #[link_name = "sys_sflist_get_not_empty__extern"]
    pub fn sys_sflist_get_not_empty(list: *mut sys_sflist_t) -> *mut sys_sfnode_t;
}
extern "C" {
    #[doc = " @brief Fetch and remove the first node of the given list\n\n This and other sys_sflist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n\n @return A pointer to the first node of the list (or NULL if empty)"]
    #[link_name = "sys_sflist_get__extern"]
    pub fn sys_sflist_get(list: *mut sys_sflist_t) -> *mut sys_sfnode_t;
}
extern "C" {
    #[doc = " @brief Remove a node\n\n This and other sys_sflist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param prev_node A pointer on the previous node\n        (can be NULL, which means the node is the list's head)\n @param node A pointer on the node to remove"]
    #[link_name = "sys_sflist_remove__extern"]
    pub fn sys_sflist_remove(
        list: *mut sys_sflist_t,
        prev_node: *mut sys_sfnode_t,
        node: *mut sys_sfnode_t,
    );
}
extern "C" {
    #[doc = " @brief Find and remove a node from a list\n\n This and other sys_sflist_*() functions are not thread safe.\n\n @param list A pointer on the list to affect\n @param node A pointer on the node to remove from the list\n\n @return true if node was removed"]
    #[link_name = "sys_sflist_find_and_remove__extern"]
    pub fn sys_sflist_find_and_remove(list: *mut sys_sflist_t, node: *mut sys_sfnode_t) -> bool;
}
extern "C" {
    #[doc = " @brief Compute the size of the given list in O(n) time\n\n @param list A pointer on the list\n\n @return an integer equal to the size of the list, or 0 if empty"]
    #[link_name = "sys_sflist_len__extern"]
    pub fn sys_sflist_len(list: *mut sys_sflist_t) -> usize;
}
extern "C" {
    #[doc = " Tools may use this list as an entry point to identify all registered\n object types and the object cores linked to them."]
    pub static mut z_obj_type_list: sys_slist_t;
}
#[doc = " Object core statistics descriptor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_obj_core_stats_desc {
    #[doc = "< Internal representation stats buffer size"]
    pub raw_size: usize,
    #[doc = "< Stats buffer size used for reporting"]
    pub query_size: usize,
    #[doc = " Function pointer to retrieve internal representation of stats"]
    pub raw: ::core::option::Option<
        unsafe extern "C" fn(
            obj_core: *mut k_obj_core,
            stats: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    #[doc = " Function pointer to retrieve reported statistics"]
    pub query: ::core::option::Option<
        unsafe extern "C" fn(
            obj_core: *mut k_obj_core,
            stats: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    #[doc = " Function pointer to reset object's statistics"]
    pub reset: ::core::option::Option<
        unsafe extern "C" fn(obj_core: *mut k_obj_core) -> ::core::ffi::c_int,
    >,
    #[doc = " Function pointer to disable object's statistics gathering"]
    pub disable: ::core::option::Option<
        unsafe extern "C" fn(obj_core: *mut k_obj_core) -> ::core::ffi::c_int,
    >,
    #[doc = " Function pointer to enable object's statistics gathering"]
    pub enable: ::core::option::Option<
        unsafe extern "C" fn(obj_core: *mut k_obj_core) -> ::core::ffi::c_int,
    >,
}
#[test]
fn bindgen_test_layout_k_obj_core_stats_desc() {
    const UNINIT: ::core::mem::MaybeUninit<k_obj_core_stats_desc> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<k_obj_core_stats_desc>(),
        28usize,
        concat!("Size of: ", stringify!(k_obj_core_stats_desc))
    );
    assert_eq!(
        ::core::mem::align_of::<k_obj_core_stats_desc>(),
        4usize,
        concat!("Alignment of ", stringify!(k_obj_core_stats_desc))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).raw_size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core_stats_desc),
            "::",
            stringify!(raw_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).query_size) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core_stats_desc),
            "::",
            stringify!(query_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).raw) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core_stats_desc),
            "::",
            stringify!(raw)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).query) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core_stats_desc),
            "::",
            stringify!(query)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reset) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core_stats_desc),
            "::",
            stringify!(reset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).disable) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core_stats_desc),
            "::",
            stringify!(disable)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core_stats_desc),
            "::",
            stringify!(enable)
        )
    );
}
#[doc = " Object type structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_obj_type {
    #[doc = "< Node within list of object types"]
    pub node: sys_snode_t,
    #[doc = "< List of objects of this object type"]
    pub list: sys_slist_t,
    #[doc = "< Unique type ID"]
    pub id: u32,
    #[doc = "< Offset to obj_core field"]
    pub obj_core_offset: usize,
}
#[test]
fn bindgen_test_layout_k_obj_type() {
    const UNINIT: ::core::mem::MaybeUninit<k_obj_type> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<k_obj_type>(),
        20usize,
        concat!("Size of: ", stringify!(k_obj_type))
    );
    assert_eq!(
        ::core::mem::align_of::<k_obj_type>(),
        4usize,
        concat!("Alignment of ", stringify!(k_obj_type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_type),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).list) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_type),
            "::",
            stringify!(list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_type),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).obj_core_offset) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_type),
            "::",
            stringify!(obj_core_offset)
        )
    );
}
#[doc = " Object core structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_obj_core {
    #[doc = "< Object node within object type's list"]
    pub node: sys_snode_t,
    #[doc = "< Object type to which object belongs"]
    pub type_: *mut k_obj_type,
}
#[test]
fn bindgen_test_layout_k_obj_core() {
    const UNINIT: ::core::mem::MaybeUninit<k_obj_core> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<k_obj_core>(),
        8usize,
        concat!("Size of: ", stringify!(k_obj_core))
    );
    assert_eq!(
        ::core::mem::align_of::<k_obj_core>(),
        4usize,
        concat!("Alignment of ", stringify!(k_obj_core))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(k_obj_core),
            "::",
            stringify!(type_)
        )
    );
}
extern "C" {
    #[doc = " @brief Initialize a specific object type\n\n Initializes a specific object type and links it into the object core\n framework.\n\n @param type Pointer to the object type to initialize\n @param id A means to identify the object type\n @param off Offset of object core within the structure\n\n @retval Pointer to initialized object type"]
    pub fn z_obj_type_init(type_: *mut k_obj_type, id: u32, off: usize) -> *mut k_obj_type;
}
extern "C" {
    #[doc = " @brief Find a specific object type by ID\n\n Given an object type ID, this function searches for the object type that\n is associated with the specified type ID @a type_id.\n\n @param type_id  Type ID associated with object type\n\n @retval NULL if object type not found\n @retval Pointer to object type if found"]
    pub fn k_obj_type_find(type_id: u32) -> *mut k_obj_type;
}
extern "C" {
    #[doc = " @brief Walk the object type's list of object cores\n\n This function takes a global spinlock and walks the object type's list\n of object cores and invokes the callback function on each element while\n holding that lock. Although this will ensure that the list is not modified,\n one can expect a significant penalty in terms of performance and latency.\n\n The callback function shall either return non-zero to stop further walking,\n or it shall return 0 to continue walking.\n\n @param type  Pointer to the object type\n @param func  Callback to invoke on each object core of the object type\n @param data  Custom data passed to the callback\n\n @retval non-zero if walk is terminated by the callback; otherwise 0"]
    pub fn k_obj_type_walk_locked(
        type_: *mut k_obj_type,
        func: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut k_obj_core,
                arg2: *mut ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
        data: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[doc = " @brief Walk the object type's list of object cores\n\n This function is similar to k_obj_type_walk_locked() except that it walks\n the list without obtaining the global spinlock. No synchronization is\n provided here. Mutation of the list of objects while this function is in\n progress must be prevented at the application layer, otherwise\n undefined/unreliable behavior, corruption and/or crashes may result.\n\n The callback function shall either return non-zero to stop further walking,\n or it shall return 0 to continue walking.\n\n @param type  Pointer to the object type\n @param func  Callback to invoke on each object core of the object type\n @param data  Custom data passed to the callback\n\n @retval non-zero if walk is terminated by the callback; otherwise 0"]
    pub fn k_obj_type_walk_unlocked(
        type_: *mut k_obj_type,
        func: ::core::option::Option<
            unsafe extern "C" fn(
                arg1: *mut k_obj_core,
                arg2: *mut ::core::ffi::c_void,
            ) -> ::core::ffi::c_int,
        >,
        data: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[doc = " @brief Initialize the core of the kernel object\n\n Initializing the kernel object core associates it with the specified\n kernel object type.\n\n @param obj_core Pointer to the kernel object to initialize\n @param type Pointer to the kernel object type"]
    pub fn k_obj_core_init(obj_core: *mut k_obj_core, type_: *mut k_obj_type);
}
extern "C" {
    #[doc = " @brief Link the kernel object to the kernel object type list\n\n A kernel object can be optionally linked into the kernel object type's\n list of objects. A kernel object must have been initialized before it\n can be linked. Linked kernel objects can be traversed and have information\n extracted from them by system tools.\n\n @param obj_core Pointer to the kernel object"]
    pub fn k_obj_core_link(obj_core: *mut k_obj_core);
}
extern "C" {
    #[doc = " @brief Automatically link the kernel object after initializing it\n\n A useful wrapper to both initialize the core of the kernel object and\n automatically link it into the kernel object type's list of objects.\n\n @param obj_core Pointer to the kernel object to initialize\n @param type Pointer to the kernel object type"]
    pub fn k_obj_core_init_and_link(obj_core: *mut k_obj_core, type_: *mut k_obj_type);
}
extern "C" {
    #[doc = " @brief Unlink the kernel object from the kernel object type list\n\n Kernel objects can be unlinked from their respective kernel object type\n lists. If on a list, it must be done at the end of the kernel object's life\n cycle.\n\n @param obj_core Pointer to the kernel object"]
    pub fn k_obj_core_unlink(obj_core: *mut k_obj_core);
}
extern "C" {
    #[doc = " @brief Register kernel object for gathering statistics\n\n Before a kernel object can gather statistics, it must be registered to do\n so. Registering will also automatically enable the kernel object to gather\n its statistics.\n\n @param obj_core Pointer to kernel object core\n @param stats Pointer to raw kernel statistics\n @param stats_len Size of raw kernel statistics buffer\n\n @retval 0 on success\n @retval -errno on failure"]
    pub fn k_obj_core_stats_register(
        obj_core: *mut k_obj_core,
        stats: *mut ::core::ffi::c_void,
        stats_len: usize,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[doc = " @brief Deregister kernel object from gathering statistics\n\n Deregistering a kernel object core from gathering statistics prevents it\n from gathering any more statistics. It is expected to be invoked at the end\n of a kernel object's life cycle.\n\n @param obj_core Pointer to kernel object core\n\n @retval 0 on success\n @retval -errno on failure"]
    pub fn k_obj_core_stats_deregister(obj_core: *mut k_obj_core) -> ::core::ffi::c_int;
}
extern "C" {
    #[doc = " @brief Retrieve the raw statistics associated with the kernel object\n\n This function copies the raw statistics associated with the kernel object\n core specified by @a obj_core into the buffer @a stats. Note that the size\n of the buffer (@a stats_len) must match the size specified by the kernel\n object type's statistics descriptor.\n\n @param obj_core Pointer to kernel object core\n @param stats Pointer to memory buffer into which to copy raw stats\n @param stats_len Length of the memory buffer\n\n @retval 0 on success\n @retval -errno on failure"]
    pub fn k_obj_core_stats_raw(
        obj_core: *mut k_obj_core,
        stats: *mut ::core::ffi::c_void,
        stats_len: usize,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[doc = " @brief Retrieve the statistics associated with the kernel object\n\n This function copies the statistics associated with the kernel object core\n specified by @a obj_core into the buffer @a stats. Unlike the raw statistics\n this may report calculated values such as averages.  Note that the size of\n the buffer (@a stats_len) must match the size specified by the kernel object\n type's statistics descriptor.\n\n @param obj_core Pointer to kernel object core\n @param stats Pointer to memory buffer into which to copy the queried stats\n @param stats_len Length of the memory buffer\n\n @retval 0 on success\n @retval -errno on failure"]
    pub fn k_obj_core_stats_query(
        obj_core: *mut k_obj_core,
        stats: *mut ::core::ffi::c_void,
        stats_len: usize,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[doc = " @brief Reset the stats associated with the kernel object\n\n This function resets the statistics associated with the kernel object core\n specified by @a obj_core.\n\n @param obj_core Pointer to kernel object core\n\n @retval 0 on success\n @retval -errno on failure"]
    pub fn k_obj_core_stats_reset(obj_core: *mut k_obj_core) -> ::core::ffi::c_int;
}
extern "C" {
    #[doc = " @brief Stop gathering the stats associated with the kernel object\n\n This function temporarily stops the gathering of statistics associated with\n the kernel object core specified by @a obj_core. The gathering of statistics\n can be resumed by invoking :c:func :`k_obj_core_stats_enable`.\n\n @param obj_core Pointer to kernel object core\n\n @retval 0 on success\n @retval -errno on failure"]
    pub fn k_obj_core_stats_disable(obj_core: *mut k_obj_core) -> ::core::ffi::c_int;
}
extern "C" {
    #[doc = " @brief Reset the stats associated with the kernel object\n\n This function resumes the gathering of statistics associated with the kernel\n object core specified by @a obj_core.\n\n @param obj_core Pointer to kernel object core\n\n @retval 0 on success\n @retval -errno on failure"]
    pub fn k_obj_core_stats_enable(obj_core: *mut k_obj_core) -> ::core::ffi::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sys_memory_stats {
    pub free_bytes: usize,
    pub allocated_bytes: usize,
    pub max_allocated_bytes: usize,
}
#[test]
fn bindgen_test_layout_sys_memory_stats() {
    const UNINIT: ::core::mem::MaybeUninit<sys_memory_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sys_memory_stats>(),
        12usize,
        concat!("Size of: ", stringify!(sys_memory_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<sys_memory_stats>(),
        4usize,
        concat!("Alignment of ", stringify!(sys_memory_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).free_bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_memory_stats),
            "::",
            stringify!(free_bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).allocated_bytes) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_memory_stats),
            "::",
            stringify!(allocated_bytes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).max_allocated_bytes) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_memory_stats),
            "::",
            stringify!(max_allocated_bytes)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sys_heap {
    pub heap: *mut z_heap,
    pub init_mem: *mut ::core::ffi::c_void,
    pub init_bytes: usize,
}
#[test]
fn bindgen_test_layout_sys_heap() {
    const UNINIT: ::core::mem::MaybeUninit<sys_heap> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sys_heap>(),
        12usize,
        concat!("Size of: ", stringify!(sys_heap))
    );
    assert_eq!(
        ::core::mem::align_of::<sys_heap>(),
        4usize,
        concat!("Alignment of ", stringify!(sys_heap))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).heap) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_heap),
            "::",
            stringify!(heap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_mem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_heap),
            "::",
            stringify!(init_mem)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_bytes) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sys_heap),
            "::",
            stringify!(init_bytes)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct z_heap_stress_result {
    pub total_allocs: u32,
    pub successful_allocs: u32,
    pub total_frees: u32,
    pub accumulated_in_use_bytes: u64,
}
#[test]
fn bindgen_test_layout_z_heap_stress_result() {
    const UNINIT: ::core::mem::MaybeUninit<z_heap_stress_result> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<z_heap_stress_result>(),
        24usize,
        concat!("Size of: ", stringify!(z_heap_stress_result))
    );
    assert_eq!(
        ::core::mem::align_of::<z_heap_stress_result>(),
        8usize,
        concat!("Alignment of ", stringify!(z_heap_stress_result))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).total_allocs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_heap_stress_result),
            "::",
            stringify!(total_allocs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).successful_allocs) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(z_heap_stress_result),
            "::",
            stringify!(successful_allocs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).total_frees) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(z_heap_stress_result),
            "::",
            stringify!(total_frees)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).accumulated_in_use_bytes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(z_heap_stress_result),
            "::",
            stringify!(accumulated_in_use_bytes)
        )
    );
}
extern "C" {
    #[doc = " @brief Initialize sys_heap\n\n Initializes a sys_heap struct to manage the specified memory.\n\n @param heap Heap to initialize\n @param mem Untyped pointer to unused memory\n @param bytes Size of region pointed to by @a mem"]
    pub fn sys_heap_init(heap: *mut sys_heap, mem: *mut ::core::ffi::c_void, bytes: usize);
}
extern "C" {
    #[doc = " @brief Allocate memory from a sys_heap\n\n Returns a pointer to a block of unused memory in the heap.  This\n memory will not otherwise be used until it is freed with\n sys_heap_free().  If no memory can be allocated, NULL will be\n returned.  The allocated memory is guaranteed to have a starting\n address which is a multiple of sizeof(void *).  If a bigger alignment\n is necessary then sys_heap_aligned_alloc() should be used instead.\n\n @note The sys_heap implementation is not internally synchronized.\n No two sys_heap functions should operate on the same heap at the\n same time.  All locking must be provided by the user.\n\n @param heap Heap from which to allocate\n @param bytes Number of bytes requested\n @return Pointer to memory the caller can now use"]
    pub fn sys_heap_alloc(heap: *mut sys_heap, bytes: usize) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " @brief Allocate aligned memory from a sys_heap\n\n Behaves in all ways like sys_heap_alloc(), except that the returned\n memory (if available) will have a starting address in memory which\n is a multiple of the specified power-of-two alignment value in\n bytes.  With align=0 this behaves exactly like sys_heap_alloc().\n The resulting memory can be returned to the heap using sys_heap_free().\n\n @param heap Heap from which to allocate\n @param align Alignment in bytes, must be a power of two\n @param bytes Number of bytes requested\n @return Pointer to memory the caller can now use"]
    pub fn sys_heap_aligned_alloc(
        heap: *mut sys_heap,
        align: usize,
        bytes: usize,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " @brief Free memory into a sys_heap\n\n De-allocates a pointer to memory previously returned from\n sys_heap_alloc such that it can be used for other purposes.  The\n caller must not use the memory region after entry to this function.\n\n @note The sys_heap implementation is not internally synchronized.\n No two sys_heap functions should operate on the same heap at the\n same time.  All locking must be provided by the user.\n\n @param heap Heap to which to return the memory\n @param mem A pointer previously returned from sys_heap_alloc()"]
    pub fn sys_heap_free(heap: *mut sys_heap, mem: *mut ::core::ffi::c_void);
}
extern "C" {
    #[doc = " @brief Expand the size of an existing allocation\n\n Returns a pointer to a new memory region with the same contents,\n but a different allocated size.  If the new allocation can be\n expanded in place, the pointer returned will be identical.\n Otherwise the data will be copies to a new block and the old one\n will be freed as per sys_heap_free().  If the specified size is\n smaller than the original, the block will be truncated in place and\n the remaining memory returned to the heap.  If the allocation of a\n new block fails, then NULL will be returned and the old block will\n not be freed or modified.\n\n @note The return of a NULL on failure is a different behavior than\n POSIX realloc(), which specifies that the original pointer will be\n returned (i.e. it is not possible to safely detect realloc()\n failure in POSIX, but it is here).\n\n @param heap Heap from which to allocate\n @param ptr Original pointer returned from a previous allocation\n @param align Alignment in bytes, must be a power of two\n @param bytes Number of bytes requested for the new block\n @return Pointer to memory the caller can now use, or NULL"]
    pub fn sys_heap_aligned_realloc(
        heap: *mut sys_heap,
        ptr: *mut ::core::ffi::c_void,
        align: usize,
        bytes: usize,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " @brief Return allocated memory size\n\n Returns the size, in bytes, of a block returned from a successful\n sys_heap_alloc() or sys_heap_alloc_aligned() call.  The value\n returned is the size of the heap-managed memory, which may be\n larger than the number of bytes requested due to allocation\n granularity.  The heap code is guaranteed to make no access to this\n region of memory until a subsequent sys_heap_free() on the same\n pointer.\n\n @param heap Heap containing the block\n @param mem Pointer to memory allocated from this heap\n @return Size in bytes of the memory region"]
    pub fn sys_heap_usable_size(heap: *mut sys_heap, mem: *mut ::core::ffi::c_void) -> usize;
}
extern "C" {
    #[doc = " @brief Validate heap integrity\n\n Validates the internal integrity of a sys_heap.  Intended for unit\n test and validation code, though potentially useful as a user API\n for applications with complicated runtime reliability requirements.\n Note: this cannot catch every possible error, but if it returns\n true then the heap is in a consistent state and can correctly\n handle any sys_heap_alloc() request and free any live pointer\n returned from a previous allocation.\n\n @param heap Heap to validate\n @return true, if the heap is valid, otherwise false"]
    pub fn sys_heap_validate(heap: *mut sys_heap) -> bool;
}
extern "C" {
    #[doc = " @brief sys_heap stress test rig\n\n Test rig for heap allocation validation.  This will loop for @a\n op_count cycles, in each iteration making a random choice to\n allocate or free a pointer of randomized (power law) size based on\n heuristics designed to keep the heap in a state where it is near @a\n target_percent full.  Allocation and free operations are provided\n by the caller as callbacks (i.e. this can in theory test any heap).\n Results, including counts of frees and successful/unsuccessful\n allocations, are returned via the @a result struct.\n\n @param alloc_fn Callback to perform an allocation.  Passes back the @a\n              arg parameter as a context handle.\n @param free_fn Callback to perform a free of a pointer returned from\n             @a alloc.  Passes back the @a arg parameter as a\n             context handle.\n @param arg Context handle to pass back to the callbacks\n @param total_bytes Size of the byte array the heap was initialized in\n @param op_count How many iterations to test\n @param scratch_mem A pointer to scratch memory to be used by the\n                    test.  Should be about 1/2 the size of the heap\n                    for tests that need to stress fragmentation.\n @param scratch_bytes Size of the memory pointed to by @a scratch_mem\n @param target_percent Percentage fill value (1-100) to which the\n                       random allocation choices will seek.  High\n                       values will result in significant allocation\n                       failures and a very fragmented heap.\n @param result Struct into which to store test results."]
    pub fn sys_heap_stress(
        alloc_fn: ::core::option::Option<
            unsafe extern "C" fn(
                arg: *mut ::core::ffi::c_void,
                bytes: usize,
            ) -> *mut ::core::ffi::c_void,
        >,
        free_fn: ::core::option::Option<
            unsafe extern "C" fn(arg: *mut ::core::ffi::c_void, p: *mut ::core::ffi::c_void),
        >,
        arg: *mut ::core::ffi::c_void,
        total_bytes: usize,
        op_count: u32,
        scratch_mem: *mut ::core::ffi::c_void,
        scratch_bytes: usize,
        target_percent: ::core::ffi::c_int,
        result: *mut z_heap_stress_result,
    );
}
extern "C" {
    #[doc = " @brief Print heap internal structure information to the console\n\n Print information on the heap structure such as its size, chunk buckets,\n chunk list and some statistics for debugging purpose.\n\n @param heap Heap to print information about\n @param dump_chunks True to print the entire heap chunk list"]
    pub fn sys_heap_print_info(heap: *mut sys_heap, dump_chunks: bool);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpu_arch {}
#[test]
fn bindgen_test_layout__cpu_arch() {
    assert_eq!(
        ::core::mem::size_of::<_cpu_arch>(),
        0usize,
        concat!("Size of: ", stringify!(_cpu_arch))
    );
    assert_eq!(
        ::core::mem::align_of::<_cpu_arch>(),
        1usize,
        concat!("Alignment of ", stringify!(_cpu_arch))
    );
}
pub type _cpu_arch_t = _cpu_arch;
#[doc = " Structure used to track internal statistics about both thread\n and CPU usage."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_cycle_stats {
    #[doc = "< total usage in cycles"]
    pub total: u64,
    #[doc = "< true if gathering usage stats"]
    pub track_usage: bool,
}
#[test]
fn bindgen_test_layout_k_cycle_stats() {
    const UNINIT: ::core::mem::MaybeUninit<k_cycle_stats> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<k_cycle_stats>(),
        16usize,
        concat!("Size of: ", stringify!(k_cycle_stats))
    );
    assert_eq!(
        ::core::mem::align_of::<k_cycle_stats>(),
        8usize,
        concat!("Alignment of ", stringify!(k_cycle_stats))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).total) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(k_cycle_stats),
            "::",
            stringify!(total)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).track_usage) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(k_cycle_stats),
            "::",
            stringify!(track_usage)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ready_q {
    pub cache: *mut k_thread,
    pub runq: sys_dlist_t,
}
#[test]
fn bindgen_test_layout__ready_q() {
    const UNINIT: ::core::mem::MaybeUninit<_ready_q> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_ready_q>(),
        12usize,
        concat!("Size of: ", stringify!(_ready_q))
    );
    assert_eq!(
        ::core::mem::align_of::<_ready_q>(),
        4usize,
        concat!("Alignment of ", stringify!(_ready_q))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cache) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ready_q),
            "::",
            stringify!(cache)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).runq) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ready_q),
            "::",
            stringify!(runq)
        )
    );
}
pub type _ready_q_t = _ready_q;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _cpu {
    pub nested: u32,
    pub irq_stack: *mut ::core::ffi::c_char,
    pub current: *mut k_thread,
    pub idle_thread: *mut k_thread,
    pub id: u8,
    pub arch: _cpu_arch,
}
#[test]
fn bindgen_test_layout__cpu() {
    const UNINIT: ::core::mem::MaybeUninit<_cpu> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_cpu>(),
        20usize,
        concat!("Size of: ", stringify!(_cpu))
    );
    assert_eq!(
        ::core::mem::align_of::<_cpu>(),
        4usize,
        concat!("Alignment of ", stringify!(_cpu))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nested) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_cpu),
            "::",
            stringify!(nested)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).irq_stack) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_cpu),
            "::",
            stringify!(irq_stack)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).current) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_cpu),
            "::",
            stringify!(current)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).idle_thread) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_cpu),
            "::",
            stringify!(idle_thread)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(_cpu), "::", stringify!(id))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).arch) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(_cpu),
            "::",
            stringify!(arch)
        )
    );
}
pub type _cpu_t = _cpu;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct z_kernel {
    pub cpus: [_cpu; 1usize],
    pub ready_q: _ready_q,
}
#[test]
fn bindgen_test_layout_z_kernel() {
    const UNINIT: ::core::mem::MaybeUninit<z_kernel> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<z_kernel>(),
        32usize,
        concat!("Size of: ", stringify!(z_kernel))
    );
    assert_eq!(
        ::core::mem::align_of::<z_kernel>(),
        4usize,
        concat!("Alignment of ", stringify!(z_kernel))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cpus) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_kernel),
            "::",
            stringify!(cpus)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ready_q) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(z_kernel),
            "::",
            stringify!(ready_q)
        )
    );
}
pub type _kernel_t = z_kernel;
extern "C" {
    pub static mut _kernel: z_kernel;
}
extern "C" {
    pub static mut _cpus_active: atomic_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _wait_q_t {
    pub waitq: sys_dlist_t,
}
#[test]
fn bindgen_test_layout__wait_q_t() {
    const UNINIT: ::core::mem::MaybeUninit<_wait_q_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_wait_q_t>(),
        8usize,
        concat!("Size of: ", stringify!(_wait_q_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_wait_q_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_wait_q_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).waitq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_wait_q_t),
            "::",
            stringify!(waitq)
        )
    );
}
pub type _timeout_func_t = ::core::option::Option<unsafe extern "C" fn(t: *mut _timeout)>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _timeout {
    pub node: sys_dnode_t,
    pub fn_: _timeout_func_t,
    pub dticks: i64,
}
#[test]
fn bindgen_test_layout__timeout() {
    const UNINIT: ::core::mem::MaybeUninit<_timeout> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_timeout>(),
        24usize,
        concat!("Size of: ", stringify!(_timeout))
    );
    assert_eq!(
        ::core::mem::align_of::<_timeout>(),
        8usize,
        concat!("Alignment of ", stringify!(_timeout))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_timeout),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fn_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_timeout),
            "::",
            stringify!(fn_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dticks) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_timeout),
            "::",
            stringify!(dticks)
        )
    );
}
pub type k_thread_timeslice_fn_t = ::core::option::Option<
    unsafe extern "C" fn(thread: *mut k_thread, data: *mut ::core::ffi::c_void),
>;
extern "C" {
    #[doc = " @brief Return the kernel version of the present build\n\n The kernel version is a four-byte value, whose format is described in the\n file \"kernel_version.h\".\n\n @return kernel version"]
    pub fn sys_kernel_version_get() -> u32;
}
pub type __gnuc_va_list = u32;
pub type va_list = u32;
#[doc = " @typedef _k_syscall_handler_t\n @brief System call handler function type\n\n These are kernel-side skeleton functions for system calls. They are\n necessary to sanitize the arguments passed into the system call:\n\n - Any kernel object or device pointers are validated with _SYSCALL_IS_OBJ()\n - Any memory buffers passed in are checked to ensure that the calling thread\n   actually has access to them\n - Many kernel calls do no sanity checking of parameters other than\n   assertions. The handler must check all of these conditions using\n   _SYSCALL_ASSERT()\n - If the system call has more than 6 arguments, then arg6 will be a pointer\n   to some struct containing arguments 6+. The struct itself needs to be\n   validated like any other buffer passed in from userspace, and its members\n   individually validated (if necessary) and then passed to the real\n   implementation like normal arguments\n\n Even if the system call implementation has no return value, these always\n return something, even 0, to prevent register leakage to userspace.\n\n Once everything has been validated, the real implementation will be executed.\n\n @param arg1 system call argument 1\n @param arg2 system call argument 2\n @param arg3 system call argument 3\n @param arg4 system call argument 4\n @param arg5 system call argument 5\n @param arg6 system call argument 6\n @param ssf System call stack frame pointer. Used to generate kernel oops\n            via _arch_syscall_oops_at(). Contents are arch-specific.\n @return system call return value, or 0 if the system call implementation\n         return void\n"]
pub type _k_syscall_handler_t = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: usize,
        arg2: usize,
        arg3: usize,
        arg4: usize,
        arg5: usize,
        arg6: usize,
        ssf: *mut ::core::ffi::c_void,
    ) -> usize,
>;
extern "C" {
    #[link_name = "z_syscall_trap__extern"]
    pub fn z_syscall_trap() -> bool;
}
extern "C" {
    #[doc = " Indicate whether the CPU is currently in user mode\n\n @return true if the CPU is currently running with user permissions"]
    #[link_name = "k_is_user_context__extern"]
    pub fn k_is_user_context() -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: intmax_t,
    pub rem: intmax_t,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    const UNINIT: ::core::mem::MaybeUninit<imaxdiv_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(j: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(numer: intmax_t, denomer: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn _strtoimax_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut *mut ::core::ffi::c_char,
        arg4: ::core::ffi::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        arg1: *const ::core::ffi::c_char,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn _strtoumax_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut *mut ::core::ffi::c_char,
        arg4: ::core::ffi::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        arg1: *const wchar_t,
        arg2: *mut *mut wchar_t,
        arg3: ::core::ffi::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn _wcstoimax_r(
        arg1: *mut _reent,
        arg2: *const wchar_t,
        arg3: *mut *mut wchar_t,
        arg4: ::core::ffi::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        arg1: *const wchar_t,
        arg2: *mut *mut wchar_t,
        arg3: ::core::ffi::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn _wcstoumax_r(
        arg1: *mut _reent,
        arg2: *const wchar_t,
        arg3: *mut *mut wchar_t,
        arg4: ::core::ffi::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn printk(fmt: *const ::core::ffi::c_char, ...);
}
extern "C" {
    pub fn vprintk(fmt: *const ::core::ffi::c_char, ap: va_list);
}
pub type wint_t = ::core::ffi::c_int;
pub type __blkcnt_t = ::core::ffi::c_long;
pub type __blksize_t = ::core::ffi::c_long;
pub type __fsblkcnt_t = __uint64_t;
pub type __fsfilcnt_t = __uint32_t;
pub type _off_t = ::core::ffi::c_long;
pub type __pid_t = ::core::ffi::c_int;
pub type __dev_t = ::core::ffi::c_short;
pub type __uid_t = ::core::ffi::c_ushort;
pub type __gid_t = ::core::ffi::c_ushort;
pub type __id_t = __uint32_t;
pub type __ino_t = ::core::ffi::c_ushort;
pub type __mode_t = __uint32_t;
pub type _off64_t = ::core::ffi::c_longlong;
pub type __off_t = _off_t;
pub type __loff_t = _off64_t;
pub type __key_t = ::core::ffi::c_long;
pub type _fpos_t = ::core::ffi::c_long;
pub type __size_t = ::core::ffi::c_uint;
pub type _ssize_t = ::core::ffi::c_int;
pub type __ssize_t = _ssize_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _mbstate_t {
    pub __count: ::core::ffi::c_int,
    pub __value: _mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _mbstate_t__bindgen_ty_1 {
    pub __wch: wint_t,
    pub __wchb: [::core::ffi::c_uchar; 4usize],
}
#[test]
fn bindgen_test_layout__mbstate_t__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_mbstate_t__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(_mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<_mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(_mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout__mbstate_t() {
    const UNINIT: ::core::mem::MaybeUninit<_mbstate_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(_mbstate_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_mbstate_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
pub type _iconv_t = *mut ::core::ffi::c_void;
pub type __clock_t = ::core::ffi::c_ulong;
pub type __time_t = __int_least64_t;
pub type __clockid_t = ::core::ffi::c_ulong;
pub type __timer_t = ::core::ffi::c_ulong;
pub type __sa_family_t = __uint8_t;
pub type __socklen_t = __uint32_t;
pub type __nl_item = ::core::ffi::c_int;
pub type __nlink_t = ::core::ffi::c_ushort;
pub type __suseconds_t = ::core::ffi::c_long;
pub type __useconds_t = ::core::ffi::c_ulong;
pub type __va_list = u32;
pub type __ULong = ::core::ffi::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __lock {
    _unused: [u8; 0],
}
pub type _LOCK_T = *mut __lock;
extern "C" {
    pub fn __retarget_lock_init(lock: *mut _LOCK_T);
}
extern "C" {
    pub fn __retarget_lock_init_recursive(lock: *mut _LOCK_T);
}
extern "C" {
    pub fn __retarget_lock_close(lock: _LOCK_T);
}
extern "C" {
    pub fn __retarget_lock_close_recursive(lock: _LOCK_T);
}
extern "C" {
    pub fn __retarget_lock_acquire(lock: _LOCK_T);
}
extern "C" {
    pub fn __retarget_lock_acquire_recursive(lock: _LOCK_T);
}
extern "C" {
    pub fn __retarget_lock_try_acquire(lock: _LOCK_T) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __retarget_lock_try_acquire_recursive(lock: _LOCK_T) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __retarget_lock_release(lock: _LOCK_T);
}
extern "C" {
    pub fn __retarget_lock_release_recursive(lock: _LOCK_T);
}
pub type _flock_t = _LOCK_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Bigint {
    pub _next: *mut _Bigint,
    pub _k: ::core::ffi::c_int,
    pub _maxwds: ::core::ffi::c_int,
    pub _sign: ::core::ffi::c_int,
    pub _wds: ::core::ffi::c_int,
    pub _x: [__ULong; 1usize],
}
#[test]
fn bindgen_test_layout__Bigint() {
    const UNINIT: ::core::mem::MaybeUninit<_Bigint> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_Bigint>(),
        24usize,
        concat!("Size of: ", stringify!(_Bigint))
    );
    assert_eq!(
        ::core::mem::align_of::<_Bigint>(),
        4usize,
        concat!("Alignment of ", stringify!(_Bigint))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._k) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_k)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._maxwds) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_maxwds)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._sign) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_sign)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._wds) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_wds)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._x) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_Bigint),
            "::",
            stringify!(_x)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __tm {
    pub __tm_sec: ::core::ffi::c_int,
    pub __tm_min: ::core::ffi::c_int,
    pub __tm_hour: ::core::ffi::c_int,
    pub __tm_mday: ::core::ffi::c_int,
    pub __tm_mon: ::core::ffi::c_int,
    pub __tm_year: ::core::ffi::c_int,
    pub __tm_wday: ::core::ffi::c_int,
    pub __tm_yday: ::core::ffi::c_int,
    pub __tm_isdst: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout___tm() {
    const UNINIT: ::core::mem::MaybeUninit<__tm> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__tm>(),
        36usize,
        concat!("Size of: ", stringify!(__tm))
    );
    assert_eq!(
        ::core::mem::align_of::<__tm>(),
        4usize,
        concat!("Alignment of ", stringify!(__tm))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_sec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_min) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_min)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_hour) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_hour)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_mday) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_mday)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_mon) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_mon)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_year) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_year)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_wday) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_wday)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_yday) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_yday)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__tm_isdst) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__tm),
            "::",
            stringify!(__tm_isdst)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _on_exit_args {
    pub _fnargs: [*mut ::core::ffi::c_void; 32usize],
    pub _dso_handle: [*mut ::core::ffi::c_void; 32usize],
    pub _fntypes: __ULong,
    pub _is_cxa: __ULong,
}
#[test]
fn bindgen_test_layout__on_exit_args() {
    const UNINIT: ::core::mem::MaybeUninit<_on_exit_args> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_on_exit_args>(),
        264usize,
        concat!("Size of: ", stringify!(_on_exit_args))
    );
    assert_eq!(
        ::core::mem::align_of::<_on_exit_args>(),
        4usize,
        concat!("Alignment of ", stringify!(_on_exit_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._fnargs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_on_exit_args),
            "::",
            stringify!(_fnargs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._dso_handle) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_on_exit_args),
            "::",
            stringify!(_dso_handle)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._fntypes) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(_on_exit_args),
            "::",
            stringify!(_fntypes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._is_cxa) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(_on_exit_args),
            "::",
            stringify!(_is_cxa)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _atexit {
    pub _next: *mut _atexit,
    pub _ind: ::core::ffi::c_int,
    pub _fns: [::core::option::Option<unsafe extern "C" fn()>; 32usize],
    pub _on_exit_args: _on_exit_args,
}
#[test]
fn bindgen_test_layout__atexit() {
    const UNINIT: ::core::mem::MaybeUninit<_atexit> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_atexit>(),
        400usize,
        concat!("Size of: ", stringify!(_atexit))
    );
    assert_eq!(
        ::core::mem::align_of::<_atexit>(),
        4usize,
        concat!("Alignment of ", stringify!(_atexit))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_atexit),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._ind) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_atexit),
            "::",
            stringify!(_ind)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._fns) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_atexit),
            "::",
            stringify!(_fns)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._on_exit_args) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_atexit),
            "::",
            stringify!(_on_exit_args)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::core::ffi::c_uchar,
    pub _size: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout___sbuf() {
    const UNINIT: ::core::mem::MaybeUninit<__sbuf> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__sbuf>(),
        8usize,
        concat!("Size of: ", stringify!(__sbuf))
    );
    assert_eq!(
        ::core::mem::align_of::<__sbuf>(),
        4usize,
        concat!("Alignment of ", stringify!(__sbuf))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sbuf),
            "::",
            stringify!(_base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._size) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__sbuf),
            "::",
            stringify!(_size)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::core::ffi::c_uchar,
    pub _r: ::core::ffi::c_int,
    pub _w: ::core::ffi::c_int,
    pub _flags: ::core::ffi::c_short,
    pub _file: ::core::ffi::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::core::ffi::c_int,
    pub _cookie: *mut ::core::ffi::c_void,
    pub _read: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut ::core::ffi::c_void,
            arg3: *mut ::core::ffi::c_char,
            arg4: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub _write: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut ::core::ffi::c_void,
            arg3: *const ::core::ffi::c_char,
            arg4: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub _seek: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut ::core::ffi::c_void,
            arg3: _fpos_t,
            arg4: ::core::ffi::c_int,
        ) -> _fpos_t,
    >,
    pub _close: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub _ub: __sbuf,
    pub _up: *mut ::core::ffi::c_uchar,
    pub _ur: ::core::ffi::c_int,
    pub _ubuf: [::core::ffi::c_uchar; 3usize],
    pub _nbuf: [::core::ffi::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::core::ffi::c_int,
    pub _offset: _off_t,
    pub _data: *mut _reent,
    pub _lock: _flock_t,
    pub _mbstate: _mbstate_t,
    pub _flags2: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout___sFILE() {
    const UNINIT: ::core::mem::MaybeUninit<__sFILE> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__sFILE>(),
        104usize,
        concat!("Size of: ", stringify!(__sFILE))
    );
    assert_eq!(
        ::core::mem::align_of::<__sFILE>(),
        4usize,
        concat!("Alignment of ", stringify!(__sFILE))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._p) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_p)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._r) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_r)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._w) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_w)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._file) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_file)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._bf) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_bf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._lbfsize) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lbfsize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._cookie) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_cookie)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._read) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_read)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._write) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_write)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._seek) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_seek)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._close) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_close)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._ub) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ub)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._up) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_up)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._ur) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ur)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._ubuf) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_ubuf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._nbuf) as usize - ptr as usize },
        67usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_nbuf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._lb) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._blksize) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_blksize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._data) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mbstate) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_mbstate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(__sFILE),
            "::",
            stringify!(_flags2)
        )
    );
}
pub type __FILE = __sFILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _glue {
    pub _next: *mut _glue,
    pub _niobs: ::core::ffi::c_int,
    pub _iobs: *mut __FILE,
}
#[test]
fn bindgen_test_layout__glue() {
    const UNINIT: ::core::mem::MaybeUninit<_glue> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_glue>(),
        12usize,
        concat!("Size of: ", stringify!(_glue))
    );
    assert_eq!(
        ::core::mem::align_of::<_glue>(),
        4usize,
        concat!("Alignment of ", stringify!(_glue))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_glue),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._niobs) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_glue),
            "::",
            stringify!(_niobs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._iobs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_glue),
            "::",
            stringify!(_iobs)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _rand48 {
    pub _seed: [::core::ffi::c_ushort; 3usize],
    pub _mult: [::core::ffi::c_ushort; 3usize],
    pub _add: ::core::ffi::c_ushort,
}
#[test]
fn bindgen_test_layout__rand48() {
    const UNINIT: ::core::mem::MaybeUninit<_rand48> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_rand48>(),
        14usize,
        concat!("Size of: ", stringify!(_rand48))
    );
    assert_eq!(
        ::core::mem::align_of::<_rand48>(),
        2usize,
        concat!("Alignment of ", stringify!(_rand48))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._seed) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_rand48),
            "::",
            stringify!(_seed)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mult) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_rand48),
            "::",
            stringify!(_mult)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._add) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_rand48),
            "::",
            stringify!(_add)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _reent {
    pub _errno: ::core::ffi::c_int,
    pub _stdin: *mut __FILE,
    pub _stdout: *mut __FILE,
    pub _stderr: *mut __FILE,
    pub _inc: ::core::ffi::c_int,
    pub _emergency: [::core::ffi::c_char; 25usize],
    pub _unspecified_locale_info: ::core::ffi::c_int,
    pub _locale: *mut __locale_t,
    pub __sdidinit: ::core::ffi::c_int,
    pub __cleanup: ::core::option::Option<unsafe extern "C" fn(arg1: *mut _reent)>,
    pub _result: *mut _Bigint,
    pub _result_k: ::core::ffi::c_int,
    pub _p5s: *mut _Bigint,
    pub _freelist: *mut *mut _Bigint,
    pub _cvtlen: ::core::ffi::c_int,
    pub _cvtbuf: *mut ::core::ffi::c_char,
    pub _new: _reent__bindgen_ty_1,
    pub _sig_func: *mut ::core::option::Option<unsafe extern "C" fn(arg1: ::core::ffi::c_int)>,
    pub __sglue: _glue,
    pub __sf: [__FILE; 3usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _reent__bindgen_ty_1 {
    pub _reent: _reent__bindgen_ty_1__bindgen_ty_1,
    pub _unused: _reent__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _reent__bindgen_ty_1__bindgen_ty_1 {
    pub _unused_rand: ::core::ffi::c_uint,
    pub _strtok_last: *mut ::core::ffi::c_char,
    pub _asctime_buf: [::core::ffi::c_char; 26usize],
    pub _localtime_buf: __tm,
    pub _gamma_signgam: ::core::ffi::c_int,
    pub _rand_next: ::core::ffi::c_ulonglong,
    pub _r48: _rand48,
    pub _mblen_state: _mbstate_t,
    pub _mbtowc_state: _mbstate_t,
    pub _wctomb_state: _mbstate_t,
    pub _l64a_buf: [::core::ffi::c_char; 8usize],
    pub _signal_buf: [::core::ffi::c_char; 24usize],
    pub _getdate_err: ::core::ffi::c_int,
    pub _mbrlen_state: _mbstate_t,
    pub _mbrtowc_state: _mbstate_t,
    pub _mbsrtowcs_state: _mbstate_t,
    pub _wcrtomb_state: _mbstate_t,
    pub _wcsrtombs_state: _mbstate_t,
    pub _h_errno: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout__reent__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_reent__bindgen_ty_1__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_reent__bindgen_ty_1__bindgen_ty_1>(),
        208usize,
        concat!("Size of: ", stringify!(_reent__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<_reent__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._unused_rand) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_unused_rand)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._strtok_last) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_strtok_last)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._asctime_buf) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_asctime_buf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._localtime_buf) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_localtime_buf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._gamma_signgam) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_gamma_signgam)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._rand_next) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_rand_next)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._r48) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_r48)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mblen_state) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_mblen_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mbtowc_state) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_mbtowc_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._wctomb_state) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_wctomb_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._l64a_buf) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_l64a_buf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._signal_buf) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_signal_buf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._getdate_err) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_getdate_err)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mbrlen_state) as usize - ptr as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_mbrlen_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mbrtowc_state) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_mbrtowc_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._mbsrtowcs_state) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_mbsrtowcs_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._wcrtomb_state) as usize - ptr as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_wcrtomb_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._wcsrtombs_state) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_wcsrtombs_state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._h_errno) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(_h_errno)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _reent__bindgen_ty_1__bindgen_ty_2 {
    pub _nextf: [*mut ::core::ffi::c_uchar; 30usize],
    pub _nmalloc: [::core::ffi::c_uint; 30usize],
}
#[test]
fn bindgen_test_layout__reent__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<_reent__bindgen_ty_1__bindgen_ty_2> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_reent__bindgen_ty_1__bindgen_ty_2>(),
        240usize,
        concat!("Size of: ", stringify!(_reent__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<_reent__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._nextf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(_nextf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._nmalloc) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(_nmalloc)
        )
    );
}
#[test]
fn bindgen_test_layout__reent__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<_reent__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_reent__bindgen_ty_1>(),
        240usize,
        concat!("Size of: ", stringify!(_reent__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<_reent__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(_reent__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._reent) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1),
            "::",
            stringify!(_reent)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._unused) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent__bindgen_ty_1),
            "::",
            stringify!(_unused)
        )
    );
}
#[test]
fn bindgen_test_layout__reent() {
    const UNINIT: ::core::mem::MaybeUninit<_reent> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_reent>(),
        656usize,
        concat!("Size of: ", stringify!(_reent))
    );
    assert_eq!(
        ::core::mem::align_of::<_reent>(),
        8usize,
        concat!("Alignment of ", stringify!(_reent))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._errno) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_errno)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._stdin) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_stdin)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._stdout) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_stdout)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._stderr) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_stderr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._inc) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_inc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._emergency) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_emergency)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._unspecified_locale_info) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_unspecified_locale_info)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._locale) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_locale)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__sdidinit) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(__sdidinit)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__cleanup) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(__cleanup)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._result) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_result)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._result_k) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_result_k)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._p5s) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_p5s)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._freelist) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_freelist)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._cvtlen) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_cvtlen)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._cvtbuf) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_cvtbuf)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._new) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_new)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._sig_func) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(_sig_func)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__sglue) as usize - ptr as usize },
        332usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(__sglue)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__sf) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(_reent),
            "::",
            stringify!(__sf)
        )
    );
}
extern "C" {
    pub static mut _impure_ptr: *mut _reent;
}
extern "C" {
    pub static _global_impure_ptr: *mut _reent;
}
extern "C" {
    pub fn _reclaim_reent(arg1: *mut _reent);
}
extern "C" {
    pub static mut _global_atexit: *mut _atexit;
}
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = __intptr_t;
pub type blkcnt_t = __blkcnt_t;
pub type blksize_t = __blksize_t;
pub type clock_t = ::core::ffi::c_ulong;
pub type time_t = __int_least64_t;
pub type daddr_t = ::core::ffi::c_long;
pub type caddr_t = *mut ::core::ffi::c_char;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type id_t = __id_t;
pub type ino_t = __ino_t;
pub type off_t = __off_t;
pub type dev_t = __dev_t;
pub type uid_t = __uid_t;
pub type gid_t = __gid_t;
pub type pid_t = __pid_t;
pub type key_t = __key_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
pub type useconds_t = __useconds_t;
pub type suseconds_t = __suseconds_t;
pub type sbintime_t = __int64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: time_t,
    pub tv_nsec: ::core::ffi::c_long,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::core::mem::MaybeUninit<timespec> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::core::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sched_param {
    pub sched_priority: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_sched_param() {
    const UNINIT: ::core::mem::MaybeUninit<sched_param> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<sched_param>(),
        4usize,
        concat!("Size of: ", stringify!(sched_param))
    );
    assert_eq!(
        ::core::mem::align_of::<sched_param>(),
        4usize,
        concat!("Alignment of ", stringify!(sched_param))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sched_priority) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sched_param),
            "::",
            stringify!(sched_priority)
        )
    );
}
pub type pthread_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_attr_t {
    pub is_initialized: ::core::ffi::c_int,
    pub stackaddr: *mut ::core::ffi::c_void,
    pub stacksize: ::core::ffi::c_int,
    pub contentionscope: ::core::ffi::c_int,
    pub inheritsched: ::core::ffi::c_int,
    pub schedpolicy: ::core::ffi::c_int,
    pub schedparam: sched_param,
    pub detachstate: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_attr_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_attr_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_attr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_initialized) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stackaddr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(stackaddr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stacksize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(stacksize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).contentionscope) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(contentionscope)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).inheritsched) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(inheritsched)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).schedpolicy) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(schedpolicy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).schedparam) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(schedparam)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).detachstate) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(detachstate)
        )
    );
}
pub type pthread_mutex_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_mutexattr_t {
    pub is_initialized: ::core::ffi::c_int,
    pub recursive: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_mutexattr_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_mutexattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_initialized) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).recursive) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(recursive)
        )
    );
}
pub type pthread_cond_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_condattr_t {
    pub is_initialized: ::core::ffi::c_int,
    pub clock: clock_t,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_condattr_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_condattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_initialized) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clock) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(clock)
        )
    );
}
pub type pthread_key_t = __uint32_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_once_t {
    pub is_initialized: ::core::ffi::c_int,
    pub init_executed: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout_pthread_once_t() {
    const UNINIT: ::core::mem::MaybeUninit<pthread_once_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<pthread_once_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_once_t))
    );
    assert_eq!(
        ::core::mem::align_of::<pthread_once_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_once_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_initialized) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_once_t),
            "::",
            stringify!(is_initialized)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_executed) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_once_t),
            "::",
            stringify!(init_executed)
        )
    );
}
pub type FILE = __FILE;
pub type fpos_t = _fpos_t;
extern "C" {
    pub fn ctermid(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn tempnam(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn freopen(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::core::ffi::c_char);
}
extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: usize,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fprintf(arg1: *mut FILE, arg2: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fscanf(arg1: *mut FILE, arg2: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn printf(arg1: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn scanf(arg1: *const ::core::ffi::c_char, ...) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn sscanf(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vfprintf(
        arg1: *mut FILE,
        arg2: *const ::core::ffi::c_char,
        arg3: u32,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vprintf(arg1: *const ::core::ffi::c_char, arg2: u32) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vsprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: u32,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fgets(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: *mut FILE,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn fputc(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fputs(arg1: *const ::core::ffi::c_char, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn getchar() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn gets(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn putc(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn putchar(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn puts(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ungetc(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fread(
        arg1: *mut ::core::ffi::c_void,
        _size: ::core::ffi::c_uint,
        _n: ::core::ffi::c_uint,
        arg2: *mut FILE,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    pub fn fwrite(
        arg1: *const ::core::ffi::c_void,
        _size: ::core::ffi::c_uint,
        _n: ::core::ffi::c_uint,
        arg2: *mut FILE,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fseek(
        arg1: *mut FILE,
        arg2: ::core::ffi::c_long,
        arg3: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn perror(arg1: *const ::core::ffi::c_char);
}
extern "C" {
    pub fn fopen(_name: *const ::core::ffi::c_char, _type: *const ::core::ffi::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn sprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn remove(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn rename(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fseeko(arg1: *mut FILE, arg2: off_t, arg3: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn ftello(arg1: *mut FILE) -> off_t;
}
extern "C" {
    pub fn snprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_uint,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vsnprintf(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_uint,
        arg3: *const ::core::ffi::c_char,
        arg4: u32,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vfscanf(
        arg1: *mut FILE,
        arg2: *const ::core::ffi::c_char,
        arg3: u32,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vscanf(arg1: *const ::core::ffi::c_char, arg2: u32) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn vsscanf(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: u32,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fdopen(arg1: ::core::ffi::c_int, arg2: *const ::core::ffi::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn popen(arg1: *const ::core::ffi::c_char, arg2: *const ::core::ffi::c_char) -> *mut FILE;
}
extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::core::ffi::c_int;
}
extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn putc_unlocked(arg1: ::core::ffi::c_int, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn putchar_unlocked(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn dprintf(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fmemopen(
        arg1: *mut ::core::ffi::c_void,
        arg2: usize,
        arg3: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(arg1: *mut *mut ::core::ffi::c_char, arg2: *mut usize) -> *mut FILE;
}
extern "C" {
    pub fn vdprintf(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn renameat(
        arg1: ::core::ffi::c_int,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _asiprintf_r(
        arg1: *mut _reent,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _asniprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *mut usize,
        arg4: *const ::core::ffi::c_char,
        ...
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _asnprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *mut usize,
        arg4: *const ::core::ffi::c_char,
        ...
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _asprintf_r(
        arg1: *mut _reent,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _diprintf_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _dprintf_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fclose_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fcloseall_r(arg1: *mut _reent) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fdopen_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _fflush_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fgetc_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fgetc_unlocked_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fgets_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: *mut FILE,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _fgets_unlocked_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: ::core::ffi::c_int,
        arg4: *mut FILE,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _fgetpos_r(arg1: *mut _reent, arg2: *mut FILE, arg3: *mut fpos_t) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fsetpos_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const fpos_t,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fiprintf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fiscanf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fmemopen_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_void,
        arg3: usize,
        arg4: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _fopen_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _freopen_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        arg4: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _fprintf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fpurge_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fputc_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fputc_unlocked_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fputs_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fputs_unlocked_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fread_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_void,
        _size: usize,
        _n: usize,
        arg3: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _fread_unlocked_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_void,
        _size: usize,
        _n: usize,
        arg3: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _fscanf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fseek_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: ::core::ffi::c_long,
        arg4: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _fseeko_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: _off_t,
        arg4: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _ftell_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_long;
}
extern "C" {
    pub fn _ftello_r(arg1: *mut _reent, arg2: *mut FILE) -> _off_t;
}
extern "C" {
    pub fn _rewind_r(arg1: *mut _reent, arg2: *mut FILE);
}
extern "C" {
    pub fn _fwrite_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_void,
        _size: usize,
        _n: usize,
        arg3: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _fwrite_unlocked_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_void,
        _size: usize,
        _n: usize,
        arg3: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _getc_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _getc_unlocked_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _getchar_r(arg1: *mut _reent) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _getchar_unlocked_r(arg1: *mut _reent) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _gets_r(arg1: *mut _reent, arg2: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _iprintf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _iscanf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _open_memstream_r(
        arg1: *mut _reent,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _perror_r(arg1: *mut _reent, arg2: *const ::core::ffi::c_char);
}
extern "C" {
    pub fn _printf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _putc_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _putc_unlocked_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _putchar_unlocked_r(arg1: *mut _reent, arg2: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _putchar_r(arg1: *mut _reent, arg2: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _puts_r(arg1: *mut _reent, arg2: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _remove_r(arg1: *mut _reent, arg2: *const ::core::ffi::c_char) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _rename_r(
        arg1: *mut _reent,
        _old: *const ::core::ffi::c_char,
        _new: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _scanf_r(arg1: *mut _reent, arg2: *const ::core::ffi::c_char, ...)
        -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _siprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _siscanf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _sniprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
        arg4: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _snprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
        arg4: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _sprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _sscanf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _tempnam_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _tmpfile_r(arg1: *mut _reent) -> *mut FILE;
}
extern "C" {
    pub fn _tmpnam_r(arg1: *mut _reent, arg2: *mut ::core::ffi::c_char)
        -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _ungetc_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vasiprintf_r(
        arg1: *mut _reent,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vasniprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *mut usize,
        arg4: *const ::core::ffi::c_char,
        arg5: __gnuc_va_list,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _vasnprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *mut usize,
        arg4: *const ::core::ffi::c_char,
        arg5: __gnuc_va_list,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _vasprintf_r(
        arg1: *mut _reent,
        arg2: *mut *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vdiprintf_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vdprintf_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vfiprintf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vfiscanf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vfprintf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vfscanf_r(
        arg1: *mut _reent,
        arg2: *mut FILE,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _viprintf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _viscanf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vprintf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vscanf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vsiprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vsiscanf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vsniprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
        arg4: *const ::core::ffi::c_char,
        arg5: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vsnprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
        arg4: *const ::core::ffi::c_char,
        arg5: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vsprintf_r(
        arg1: *mut _reent,
        arg2: *mut ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _vsscanf_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: *const ::core::ffi::c_char,
        arg4: __gnuc_va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn fpurge(arg1: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __getdelim(
        arg1: *mut *mut ::core::ffi::c_char,
        arg2: *mut usize,
        arg3: ::core::ffi::c_int,
        arg4: *mut FILE,
    ) -> isize;
}
extern "C" {
    pub fn __getline(
        arg1: *mut *mut ::core::ffi::c_char,
        arg2: *mut usize,
        arg3: *mut FILE,
    ) -> isize;
}
extern "C" {
    pub fn __srget_r(arg1: *mut _reent, arg2: *mut FILE) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __swbuf_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[link_name = "__sputc_r__extern"]
    pub fn __sputc_r(
        _ptr: *mut _reent,
        _c: ::core::ffi::c_int,
        _p: *mut FILE,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[link_name = "_getchar_unlocked__extern"]
    pub fn _getchar_unlocked() -> ::core::ffi::c_int;
}
extern "C" {
    #[link_name = "_putchar_unlocked__extern"]
    pub fn _putchar_unlocked(_c: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __stack_chk_fail() -> !;
}
extern "C" {
    pub fn __chk_fail() -> !;
}
extern "C" {
    pub fn __sprintf_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: usize,
        arg4: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __vsprintf_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
        arg3: usize,
        arg4: *const ::core::ffi::c_char,
        arg5: __va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __snprintf_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: usize,
        arg3: ::core::ffi::c_int,
        arg4: usize,
        arg5: *const ::core::ffi::c_char,
        ...
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __vsnprintf_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: usize,
        arg3: ::core::ffi::c_int,
        arg4: usize,
        arg5: *const ::core::ffi::c_char,
        arg6: __va_list,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn __gets_chk(arg1: *mut ::core::ffi::c_char, arg2: usize) -> *mut ::core::ffi::c_char;
}
pub type irq_offload_routine_t =
    ::core::option::Option<unsafe extern "C" fn(parameter: *const ::core::ffi::c_void)>;
extern "C" {
    #[doc = " @brief Run a function in interrupt context\n\n This function synchronously runs the provided function in interrupt\n context, passing in the supplied device. Useful for test code\n which needs to show that kernel objects work correctly in interrupt\n context.\n\n Additionally, when CONFIG_IRQ_OFFLOAD_NESTED is set by the\n architecture, this routine works to synchronously invoke a nested\n interrupt when called from an ISR context (i.e. when k_is_in_isr()\n is true).  Note that not all platforms will have hardware support\n for this capability, and even on those some interrupts may be\n running at unpreemptible priorities.\n\n @param routine The function to run\n @param parameter Argument to pass to the function when it is run as an\n interrupt"]
    pub fn irq_offload(routine: irq_offload_routine_t, parameter: *const ::core::ffi::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_mem_domain {
    _unused: [u8; 0],
}
pub type k_thread_stack_t = z_thread_stack_element;
pub type k_thread_entry_t = ::core::option::Option<
    unsafe extern "C" fn(
        p1: *mut ::core::ffi::c_void,
        p2: *mut ::core::ffi::c_void,
        p3: *mut ::core::ffi::c_void,
    ),
>;
extern "C" {
    #[doc = " Obtain the current cycle count, in units specified by\n CONFIG_SYS_CLOCK_HW_CYCLES_PER_SEC.  While this is historically\n specified as part of the architecture API, in practice virtually\n all platforms forward it to the sys_clock_cycle_get_32() API\n provided by the timer driver.\n\n @see k_cycle_get_32()\n\n @return The current cycle time.  This should count up monotonically\n through the full 32 bit space, wrapping at 0xffffffff.  Hardware\n with fewer bits of precision in the timer is expected to synthesize\n a 32 bit count."]
    #[link_name = "arch_k_cycle_get_32__extern"]
    pub fn arch_k_cycle_get_32() -> u32;
}
extern "C" {
    #[doc = " As for arch_k_cycle_get_32(), but with a 64 bit return value.  Not\n all timer hardware has a 64 bit timer, this needs to be implemented\n only if CONFIG_TIMER_HAS_64BIT_CYCLE_COUNTER is set.\n\n @see arch_k_cycle_get_32()\n\n @return The current cycle time.  This should count up monotonically\n through the full 64 bit space, wrapping at 2^64-1.  Hardware with\n fewer bits of precision in the timer is generally not expected to\n implement this API."]
    #[link_name = "arch_k_cycle_get_64__extern"]
    pub fn arch_k_cycle_get_64() -> u64;
}
extern "C" {
    #[doc = " @brief Power save idle routine\n\n This function will be called by the kernel idle loop or possibly within\n an implementation of z_pm_save_idle in the kernel when the\n '_pm_save_flag' variable is non-zero.\n\n Architectures that do not implement power management instructions may\n immediately return, otherwise a power-saving instruction should be\n issued to wait for an interrupt.\n\n @note The function is expected to return after the interrupt that has\n caused the CPU to exit power-saving mode has been serviced, although\n this is not a firm requirement.\n\n @see k_cpu_idle()"]
    pub fn arch_cpu_idle();
}
extern "C" {
    #[doc = " @brief Atomically re-enable interrupts and enter low power mode\n\n The requirements for arch_cpu_atomic_idle() are as follows:\n\n -# Enabling interrupts and entering a low-power mode needs to be\n    atomic, i.e. there should be no period of time where interrupts are\n    enabled before the processor enters a low-power mode.  See the comments\n    in k_lifo_get(), for example, of the race condition that\n    occurs if this requirement is not met.\n\n -# After waking up from the low-power mode, the interrupt lockout state\n    must be restored as indicated in the 'key' input parameter.\n\n @see k_cpu_atomic_idle()\n\n @param key Lockout key returned by previous invocation of arch_irq_lock()"]
    pub fn arch_cpu_atomic_idle(key: ::core::ffi::c_uint);
}
#[doc = " Per-cpu entry function\n\n @param data context parameter, implementation specific"]
pub type arch_cpustart_t =
    ::core::option::Option<unsafe extern "C" fn(data: *mut ::core::ffi::c_void) -> !>;
extern "C" {
    #[doc = " @brief Start a numbered CPU on a MP-capable system\n\n This starts and initializes a specific CPU.  The main thread on startup is\n running on CPU zero, other processors are numbered sequentially.  On return\n from this function, the CPU is known to have begun operating and will enter\n the provided function.  Its interrupts will be initialized but disabled such\n that irq_unlock() with the provided key will work to enable them.\n\n Normally, in SMP mode this function will be called by the kernel\n initialization and should not be used as a user API.  But it is defined here\n for special-purpose apps which want Zephyr running on one core and to use\n others for design-specific processing.\n\n @param cpu_num Integer number of the CPU\n @param stack Stack memory for the CPU\n @param sz Stack buffer size, in bytes\n @param fn Function to begin running on the CPU.\n @param arg Untyped argument to be passed to \"fn\""]
    pub fn arch_start_cpu(
        cpu_num: ::core::ffi::c_int,
        stack: *mut k_thread_stack_t,
        sz: ::core::ffi::c_int,
        fn_: arch_cpustart_t,
        arg: *mut ::core::ffi::c_void,
    );
}
extern "C" {
    #[doc = " @brief Return CPU power status\n\n @param cpu_num Integer number of the CPU"]
    pub fn arch_cpu_active(cpu_num: ::core::ffi::c_int) -> bool;
}
extern "C" {
    #[doc = " Lock interrupts on the current CPU\n\n @see irq_lock()"]
    #[link_name = "arch_irq_lock__extern"]
    pub fn arch_irq_lock() -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " Unlock interrupts on the current CPU\n\n @see irq_unlock()"]
    #[link_name = "arch_irq_unlock__extern"]
    pub fn arch_irq_unlock(key: ::core::ffi::c_uint);
}
extern "C" {
    #[doc = " Test if calling arch_irq_unlock() with this key would unlock irqs\n\n @param key value returned by arch_irq_lock()\n @return true if interrupts were unlocked prior to the arch_irq_lock()\n call that produced the key argument."]
    #[link_name = "arch_irq_unlocked__extern"]
    pub fn arch_irq_unlocked(key: ::core::ffi::c_uint) -> bool;
}
extern "C" {
    #[doc = " Disable the specified interrupt line\n\n @note: The behavior of interrupts that arrive after this call\n returns and before the corresponding call to arch_irq_enable() is\n undefined.  The hardware is not required to latch and deliver such\n an interrupt, though on some architectures that may work.  Other\n architectures will simply lose such an interrupt and never deliver\n it.  Many drivers and subsystems are not tolerant of such dropped\n interrupts and it is the job of the application layer to ensure\n that behavior remains correct.\n\n @see irq_disable()"]
    pub fn arch_irq_disable(irq: ::core::ffi::c_uint);
}
extern "C" {
    #[doc = " Enable the specified interrupt line\n\n @see irq_enable()"]
    pub fn arch_irq_enable(irq: ::core::ffi::c_uint);
}
extern "C" {
    #[doc = " Test if an interrupt line is enabled\n\n @see irq_is_enabled()"]
    pub fn arch_irq_is_enabled(irq: ::core::ffi::c_uint) -> ::core::ffi::c_int;
}
extern "C" {
    #[doc = " Arch-specific hook to install a dynamic interrupt.\n\n @param irq IRQ line number\n @param priority Interrupt priority\n @param routine Interrupt service routine\n @param parameter ISR parameter\n @param flags Arch-specific IRQ configuration flag\n\n @return The vector assigned to this interrupt"]
    pub fn arch_irq_connect_dynamic(
        irq: ::core::ffi::c_uint,
        priority: ::core::ffi::c_uint,
        routine: ::core::option::Option<
            unsafe extern "C" fn(parameter: *const ::core::ffi::c_void),
        >,
        parameter: *const ::core::ffi::c_void,
        flags: u32,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[doc = " Arch-specific hook to dynamically uninstall a shared interrupt.\n If the interrupt is not being shared, then the associated\n _sw_isr_table entry will be replaced by (NULL, z_irq_spurious)\n (default entry).\n\n @param irq IRQ line number\n @param priority Interrupt priority\n @param routine Interrupt service routine\n @param parameter ISR parameter\n @param flags Arch-specific IRQ configuration flag\n\n @return 0 in case of success, negative value otherwise"]
    pub fn arch_irq_disconnect_dynamic(
        irq: ::core::ffi::c_uint,
        priority: ::core::ffi::c_uint,
        routine: ::core::option::Option<
            unsafe extern "C" fn(parameter: *const ::core::ffi::c_void),
        >,
        parameter: *const ::core::ffi::c_void,
        flags: u32,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[doc = " @brief Arch-specific hook for allocating IRQs\n\n Note: disable/enable IRQ relevantly inside the implementation of such\n function to avoid concurrency issues. Also, an allocated IRQ is assumed\n to be used thus a following @see arch_irq_is_used() should return true.\n\n @return The newly allocated IRQ or UINT_MAX on error."]
    pub fn arch_irq_allocate() -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " @brief Arch-specific hook for declaring an IRQ being used\n\n Note: disable/enable IRQ relevantly inside the implementation of such\n function to avoid concurrency issues.\n\n @param irq the IRQ to declare being used"]
    pub fn arch_irq_set_used(irq: ::core::ffi::c_uint);
}
extern "C" {
    #[doc = " @brief Arch-specific hook for checking if an IRQ is being used already\n\n @param irq the IRQ to check\n\n @return true if being, false otherwise"]
    pub fn arch_irq_is_used(irq: ::core::ffi::c_uint) -> bool;
}
extern "C" {
    #[doc = " @brief Returns the number of CPUs\n\n For most systems this will be the same as CONFIG_MP_MAX_NUM_CPUS,\n however some systems may determine this at runtime instead.\n\n @return the number of CPUs"]
    #[link_name = "arch_num_cpus__extern"]
    pub fn arch_num_cpus() -> ::core::ffi::c_uint;
}
extern "C" {
    #[link_name = "arch_mem_coherent__extern"]
    pub fn arch_mem_coherent(ptr: *mut ::core::ffi::c_void) -> bool;
}
extern "C" {
    #[link_name = "arch_cohere_stacks__extern"]
    pub fn arch_cohere_stacks(
        old_thread: *mut k_thread,
        old_switch_handle: *mut ::core::ffi::c_void,
        new_thread: *mut k_thread,
    );
}
extern "C" {
    #[doc = " @brief Perform architecture specific processing within spin loops\n\n This is invoked from busy loops with IRQs disabled such as the contended\n spinlock loop. The default implementation is a weak function that calls\n arch_nop(). Architectures may implement this function to perform extra\n checks or power management tricks if needed."]
    pub fn arch_spin_relax();
}
extern "C" {
    #[link_name = "read_mpuir__extern"]
    pub fn read_mpuir() -> u32;
}
extern "C" {
    #[link_name = "write_mpuir__extern"]
    pub fn write_mpuir(val: u32);
}
extern "C" {
    #[link_name = "read_mpidr__extern"]
    pub fn read_mpidr() -> u32;
}
extern "C" {
    #[link_name = "write_mpidr__extern"]
    pub fn write_mpidr(val: u32);
}
extern "C" {
    #[link_name = "read_sctlr__extern"]
    pub fn read_sctlr() -> u32;
}
extern "C" {
    #[link_name = "write_sctlr__extern"]
    pub fn write_sctlr(val: u32);
}
extern "C" {
    #[link_name = "read_prselr__extern"]
    pub fn read_prselr() -> u32;
}
extern "C" {
    #[link_name = "write_prselr__extern"]
    pub fn write_prselr(val: u32);
}
extern "C" {
    #[link_name = "read_prbar__extern"]
    pub fn read_prbar() -> u32;
}
extern "C" {
    #[link_name = "write_prbar__extern"]
    pub fn write_prbar(val: u32);
}
extern "C" {
    #[link_name = "read_prlar__extern"]
    pub fn read_prlar() -> u32;
}
extern "C" {
    #[link_name = "write_prlar__extern"]
    pub fn write_prlar(val: u32);
}
extern "C" {
    #[link_name = "read_mair0__extern"]
    pub fn read_mair0() -> u32;
}
extern "C" {
    #[link_name = "write_mair0__extern"]
    pub fn write_mair0(val: u32);
}
extern "C" {
    #[link_name = "read_vbar__extern"]
    pub fn read_vbar() -> u32;
}
extern "C" {
    #[link_name = "write_vbar__extern"]
    pub fn write_vbar(val: u32);
}
extern "C" {
    #[link_name = "read_cntv_ctl__extern"]
    pub fn read_cntv_ctl() -> u32;
}
extern "C" {
    #[link_name = "write_cntv_ctl__extern"]
    pub fn write_cntv_ctl(val: u32);
}
extern "C" {
    #[link_name = "read_ctr__extern"]
    pub fn read_ctr() -> u32;
}
extern "C" {
    #[link_name = "write_ctr__extern"]
    pub fn write_ctr(val: u32);
}
extern "C" {
    #[link_name = "read_tpidruro__extern"]
    pub fn read_tpidruro() -> u32;
}
extern "C" {
    #[link_name = "write_tpidruro__extern"]
    pub fn write_tpidruro(val: u32);
}
extern "C" {
    #[link_name = "read_ICC_SGI1R__extern"]
    pub fn read_ICC_SGI1R() -> u64;
}
extern "C" {
    #[link_name = "write_ICC_SGI1R__extern"]
    pub fn write_ICC_SGI1R(val: u64);
}
extern "C" {
    #[link_name = "read_cntvct__extern"]
    pub fn read_cntvct() -> u64;
}
extern "C" {
    #[link_name = "write_cntvct__extern"]
    pub fn write_cntvct(val: u64);
}
extern "C" {
    #[link_name = "read_cntv_cval__extern"]
    pub fn read_cntv_cval() -> u64;
}
extern "C" {
    #[link_name = "write_cntv_cval__extern"]
    pub fn write_cntv_cval(val: u64);
}
extern "C" {
    #[link_name = "read_ICC_PMR_EL1__extern"]
    pub fn read_ICC_PMR_EL1() -> u32;
}
extern "C" {
    #[link_name = "write_ICC_PMR_EL1__extern"]
    pub fn write_ICC_PMR_EL1(val: u32);
}
extern "C" {
    #[link_name = "read_ICC_IAR1_EL1__extern"]
    pub fn read_ICC_IAR1_EL1() -> u32;
}
extern "C" {
    #[link_name = "write_ICC_IAR1_EL1__extern"]
    pub fn write_ICC_IAR1_EL1(val: u32);
}
extern "C" {
    #[link_name = "read_ICC_EOIR1_EL1__extern"]
    pub fn read_ICC_EOIR1_EL1() -> u32;
}
extern "C" {
    #[link_name = "write_ICC_EOIR1_EL1__extern"]
    pub fn write_ICC_EOIR1_EL1(val: u32);
}
extern "C" {
    #[link_name = "read_ICC_SRE_EL1__extern"]
    pub fn read_ICC_SRE_EL1() -> u32;
}
extern "C" {
    #[link_name = "write_ICC_SRE_EL1__extern"]
    pub fn write_ICC_SRE_EL1(val: u32);
}
extern "C" {
    #[link_name = "read_ICC_IGRPEN1_EL1__extern"]
    pub fn read_ICC_IGRPEN1_EL1() -> u32;
}
extern "C" {
    #[link_name = "write_ICC_IGRPEN1_EL1__extern"]
    pub fn write_ICC_IGRPEN1_EL1(val: u32);
}
extern "C" {
    #[link_name = "arch_curr_cpu__extern"]
    pub fn arch_curr_cpu() -> *mut _cpu_t;
}
extern "C" {
    #[link_name = "arch_proc_id__extern"]
    pub fn arch_proc_id() -> u32;
}
extern "C" {
    #[doc = " @brief Return IRQ level\n This routine returns the interrupt level number of the provided interrupt.\n\n @param irq IRQ number in its zephyr format\n\n @return 1 if IRQ level 1, 2 if IRQ level 2, 3 if IRQ level 3"]
    #[link_name = "irq_get_level__extern"]
    pub fn irq_get_level(irq: ::core::ffi::c_uint) -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " @brief Return the 2nd level interrupt number\n\n This routine returns the second level irq number of the zephyr irq\n number passed in\n\n @param irq IRQ number in its zephyr format\n\n @return 2nd level IRQ number"]
    #[link_name = "irq_from_level_2__extern"]
    pub fn irq_from_level_2(irq: ::core::ffi::c_uint) -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " @brief Converts irq from level 1 to level 2 format\n\n\n This routine converts the input into the level 2 irq number format\n\n @note Values >= 0xFF are invalid\n\n @param irq IRQ number in its zephyr format\n\n @return 2nd level IRQ number"]
    #[link_name = "irq_to_level_2__extern"]
    pub fn irq_to_level_2(irq: ::core::ffi::c_uint) -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " @brief Returns the parent IRQ of the level 2 raw IRQ number\n\n\n The parent of a 2nd level interrupt is in the 1st byte\n\n @param irq IRQ number in its zephyr format\n\n @return 2nd level IRQ parent"]
    #[link_name = "irq_parent_level_2__extern"]
    pub fn irq_parent_level_2(irq: ::core::ffi::c_uint) -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " @brief Return the 3rd level interrupt number\n\n\n This routine returns the third level irq number of the zephyr irq\n number passed in\n\n @param irq IRQ number in its zephyr format\n\n @return 3rd level IRQ number"]
    #[link_name = "irq_from_level_3__extern"]
    pub fn irq_from_level_3(irq: ::core::ffi::c_uint) -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " @brief Converts irq from level 1 to level 3 format\n\n\n This routine converts the input into the level 3 irq number format\n\n @note Values >= 0xFF are invalid\n\n @param irq IRQ number in its zephyr format\n\n @return 3rd level IRQ number"]
    #[link_name = "irq_to_level_3__extern"]
    pub fn irq_to_level_3(irq: ::core::ffi::c_uint) -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " @brief Returns the parent IRQ of the level 3 raw IRQ number\n\n\n The parent of a 3rd level interrupt is in the 2nd byte\n\n @param irq IRQ number in its zephyr format\n\n @return 3rd level IRQ parent"]
    #[link_name = "irq_parent_level_3__extern"]
    pub fn irq_parent_level_3(irq: ::core::ffi::c_uint) -> ::core::ffi::c_uint;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _callee_saved {
    pub v1: u32,
    pub v2: u32,
    pub v3: u32,
    pub v4: u32,
    pub v5: u32,
    pub v6: u32,
    pub v7: u32,
    pub v8: u32,
    pub psp: u32,
}
#[test]
fn bindgen_test_layout__callee_saved() {
    const UNINIT: ::core::mem::MaybeUninit<_callee_saved> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_callee_saved>(),
        36usize,
        concat!("Size of: ", stringify!(_callee_saved))
    );
    assert_eq!(
        ::core::mem::align_of::<_callee_saved>(),
        4usize,
        concat!("Alignment of ", stringify!(_callee_saved))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(v1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v2) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(v2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v3) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(v3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v4) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(v4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v5) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(v5)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v6) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(v6)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v7) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(v7)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v8) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(v8)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).psp) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_callee_saved),
            "::",
            stringify!(psp)
        )
    );
}
pub type _callee_saved_t = _callee_saved;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _thread_arch {
    pub basepri: u32,
    pub swap_return_value: u32,
}
#[test]
fn bindgen_test_layout__thread_arch() {
    const UNINIT: ::core::mem::MaybeUninit<_thread_arch> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_thread_arch>(),
        8usize,
        concat!("Size of: ", stringify!(_thread_arch))
    );
    assert_eq!(
        ::core::mem::align_of::<_thread_arch>(),
        4usize,
        concat!("Alignment of ", stringify!(_thread_arch))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).basepri) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_arch),
            "::",
            stringify!(basepri)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).swap_return_value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_thread_arch),
            "::",
            stringify!(swap_return_value)
        )
    );
}
pub type _thread_arch_t = _thread_arch;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __esf {
    pub basic: __esf___basic_sf,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __esf___basic_sf {
    pub __bindgen_anon_1: __esf___basic_sf__bindgen_ty_1,
    pub __bindgen_anon_2: __esf___basic_sf__bindgen_ty_2,
    pub __bindgen_anon_3: __esf___basic_sf__bindgen_ty_3,
    pub __bindgen_anon_4: __esf___basic_sf__bindgen_ty_4,
    pub __bindgen_anon_5: __esf___basic_sf__bindgen_ty_5,
    pub __bindgen_anon_6: __esf___basic_sf__bindgen_ty_6,
    pub __bindgen_anon_7: __esf___basic_sf__bindgen_ty_7,
    pub xpsr: u32,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __esf___basic_sf__bindgen_ty_1 {
    pub a1: u32,
    pub r0: u32,
}
#[test]
fn bindgen_test_layout___esf___basic_sf__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<__esf___basic_sf__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__esf___basic_sf__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__esf___basic_sf__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf___basic_sf__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf___basic_sf__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).a1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf___basic_sf__bindgen_ty_1),
            "::",
            stringify!(a1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r0) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf___basic_sf__bindgen_ty_1),
            "::",
            stringify!(r0)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __esf___basic_sf__bindgen_ty_2 {
    pub a2: u32,
    pub r1: u32,
}
#[test]
fn bindgen_test_layout___esf___basic_sf__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<__esf___basic_sf__bindgen_ty_2> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__esf___basic_sf__bindgen_ty_2>(),
        4usize,
        concat!("Size of: ", stringify!(__esf___basic_sf__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf___basic_sf__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf___basic_sf__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).a2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf___basic_sf__bindgen_ty_2),
            "::",
            stringify!(a2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf___basic_sf__bindgen_ty_2),
            "::",
            stringify!(r1)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __esf___basic_sf__bindgen_ty_3 {
    pub a3: u32,
    pub r2: u32,
}
#[test]
fn bindgen_test_layout___esf___basic_sf__bindgen_ty_3() {
    const UNINIT: ::core::mem::MaybeUninit<__esf___basic_sf__bindgen_ty_3> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__esf___basic_sf__bindgen_ty_3>(),
        4usize,
        concat!("Size of: ", stringify!(__esf___basic_sf__bindgen_ty_3))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf___basic_sf__bindgen_ty_3>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf___basic_sf__bindgen_ty_3))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).a3) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf___basic_sf__bindgen_ty_3),
            "::",
            stringify!(a3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r2) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf___basic_sf__bindgen_ty_3),
            "::",
            stringify!(r2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __esf___basic_sf__bindgen_ty_4 {
    pub a4: u32,
    pub r3: u32,
}
#[test]
fn bindgen_test_layout___esf___basic_sf__bindgen_ty_4() {
    const UNINIT: ::core::mem::MaybeUninit<__esf___basic_sf__bindgen_ty_4> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__esf___basic_sf__bindgen_ty_4>(),
        4usize,
        concat!("Size of: ", stringify!(__esf___basic_sf__bindgen_ty_4))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf___basic_sf__bindgen_ty_4>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf___basic_sf__bindgen_ty_4))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).a4) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf___basic_sf__bindgen_ty_4),
            "::",
            stringify!(a4)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r3) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf___basic_sf__bindgen_ty_4),
            "::",
            stringify!(r3)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __esf___basic_sf__bindgen_ty_5 {
    pub ip: u32,
    pub r12: u32,
}
#[test]
fn bindgen_test_layout___esf___basic_sf__bindgen_ty_5() {
    const UNINIT: ::core::mem::MaybeUninit<__esf___basic_sf__bindgen_ty_5> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__esf___basic_sf__bindgen_ty_5>(),
        4usize,
        concat!("Size of: ", stringify!(__esf___basic_sf__bindgen_ty_5))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf___basic_sf__bindgen_ty_5>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf___basic_sf__bindgen_ty_5))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ip) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf___basic_sf__bindgen_ty_5),
            "::",
            stringify!(ip)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r12) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf___basic_sf__bindgen_ty_5),
            "::",
            stringify!(r12)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __esf___basic_sf__bindgen_ty_6 {
    pub lr: u32,
    pub r14: u32,
}
#[test]
fn bindgen_test_layout___esf___basic_sf__bindgen_ty_6() {
    const UNINIT: ::core::mem::MaybeUninit<__esf___basic_sf__bindgen_ty_6> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__esf___basic_sf__bindgen_ty_6>(),
        4usize,
        concat!("Size of: ", stringify!(__esf___basic_sf__bindgen_ty_6))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf___basic_sf__bindgen_ty_6>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf___basic_sf__bindgen_ty_6))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf___basic_sf__bindgen_ty_6),
            "::",
            stringify!(lr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r14) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf___basic_sf__bindgen_ty_6),
            "::",
            stringify!(r14)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __esf___basic_sf__bindgen_ty_7 {
    pub pc: u32,
    pub r15: u32,
}
#[test]
fn bindgen_test_layout___esf___basic_sf__bindgen_ty_7() {
    const UNINIT: ::core::mem::MaybeUninit<__esf___basic_sf__bindgen_ty_7> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__esf___basic_sf__bindgen_ty_7>(),
        4usize,
        concat!("Size of: ", stringify!(__esf___basic_sf__bindgen_ty_7))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf___basic_sf__bindgen_ty_7>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf___basic_sf__bindgen_ty_7))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf___basic_sf__bindgen_ty_7),
            "::",
            stringify!(pc)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r15) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf___basic_sf__bindgen_ty_7),
            "::",
            stringify!(r15)
        )
    );
}
#[test]
fn bindgen_test_layout___esf___basic_sf() {
    const UNINIT: ::core::mem::MaybeUninit<__esf___basic_sf> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__esf___basic_sf>(),
        32usize,
        concat!("Size of: ", stringify!(__esf___basic_sf))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf___basic_sf>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf___basic_sf))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xpsr) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf___basic_sf),
            "::",
            stringify!(xpsr)
        )
    );
}
#[test]
fn bindgen_test_layout___esf() {
    const UNINIT: ::core::mem::MaybeUninit<__esf> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__esf>(),
        32usize,
        concat!("Size of: ", stringify!(__esf))
    );
    assert_eq!(
        ::core::mem::align_of::<__esf>(),
        4usize,
        concat!("Alignment of ", stringify!(__esf))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).basic) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__esf),
            "::",
            stringify!(basic)
        )
    );
}
extern "C" {
    pub static mut z_arm_coredump_fault_sp: u32;
}
pub type z_arch_esf_t = __esf;
extern "C" {
    pub fn z_arm_exc_exit();
}
#[doc = " @brief Initialization function for init entries.\n\n Init entries support both the system initialization and the device\n APIs. Each API has its own init function signature; hence, we have a\n union to cover both."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union init_function {
    #[doc = " System initialization function.\n\n @retval 0 On success\n @retval -errno If init fails."]
    pub sys: ::core::option::Option<unsafe extern "C" fn() -> ::core::ffi::c_int>,
    #[doc = " Device initialization function.\n\n @param dev Device instance.\n\n @retval 0 On success\n @retval -errno If device initialization fails."]
    pub dev: ::core::option::Option<unsafe extern "C" fn(dev: *const device) -> ::core::ffi::c_int>,
}
#[test]
fn bindgen_test_layout_init_function() {
    const UNINIT: ::core::mem::MaybeUninit<init_function> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<init_function>(),
        4usize,
        concat!("Size of: ", stringify!(init_function))
    );
    assert_eq!(
        ::core::mem::align_of::<init_function>(),
        4usize,
        concat!("Alignment of ", stringify!(init_function))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sys) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(init_function),
            "::",
            stringify!(sys)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(init_function),
            "::",
            stringify!(dev)
        )
    );
}
#[doc = " @brief Structure to store initialization entry information.\n\n @internal\n Init entries need to be defined following these rules:\n\n - Their name must be set using Z_INIT_ENTRY_NAME().\n - They must be placed in a special init section, given by\n   Z_INIT_ENTRY_SECTION().\n - They must be aligned, e.g. using Z_DECL_ALIGN().\n\n See SYS_INIT_NAMED() for an example.\n @endinternal"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct init_entry {
    #[doc = " Initialization function."]
    pub init_fn: init_function,
    pub __bindgen_anon_1: init_entry__bindgen_ty_1,
}
#[doc = " If the init entry belongs to a device, this fields stores a\n reference to it, otherwise it is set to NULL."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union init_entry__bindgen_ty_1 {
    pub dev: *const device,
}
#[test]
fn bindgen_test_layout_init_entry__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<init_entry__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<init_entry__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(init_entry__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<init_entry__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(init_entry__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(init_entry__bindgen_ty_1),
            "::",
            stringify!(dev)
        )
    );
}
#[test]
fn bindgen_test_layout_init_entry() {
    const UNINIT: ::core::mem::MaybeUninit<init_entry> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<init_entry>(),
        8usize,
        concat!("Size of: ", stringify!(init_entry))
    );
    assert_eq!(
        ::core::mem::align_of::<init_entry>(),
        4usize,
        concat!("Alignment of ", stringify!(init_entry))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_fn) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(init_entry),
            "::",
            stringify!(init_fn)
        )
    );
}
extern "C" {
    #[link_name = "z_mem_phys_addr__extern"]
    pub fn z_mem_phys_addr(virt: *mut ::core::ffi::c_void) -> usize;
}
extern "C" {
    #[link_name = "z_mem_virt_addr__extern"]
    pub fn z_mem_virt_addr(phys: usize) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " Map a physical memory region into the kernel's virtual address space\n\n This function is intended for mapping memory-mapped I/O regions into\n the virtual address space. Given a physical address and a size, return a\n linear address representing the base of where the physical region is mapped\n in the virtual address space for the Zephyr kernel.\n\n This function alters the active page tables in the area reserved\n for the kernel. This function will choose the virtual address\n and return it to the caller.\n\n Portable code should never assume that phys_addr and linear_addr will\n be equal.\n\n Caching and access properties are controlled by the 'flags' parameter.\n Unused bits in 'flags' are reserved for future expansion.\n A caching mode must be selected. By default, the region is read-only\n with user access and code execution forbidden. This policy is changed\n by passing K_MEM_CACHE_* and K_MEM_PERM_* macros into the 'flags' parameter.\n\n If there is insufficient virtual address space for the mapping this will\n generate a kernel panic.\n\n This API is only available if CONFIG_MMU is enabled.\n\n It is highly discouraged to use this function to map system RAM page\n frames. It may conflict with anonymous memory mappings and demand paging\n and produce undefined behavior.  Do not use this for RAM unless you know\n exactly what you are doing. If you need a chunk of memory, use k_mem_map().\n If you need a contiguous buffer of physical memory, statically declare it\n and pin it at build time, it will be mapped when the system boots.\n\n This API is part of infrastructure still under development and may\n change.\n\n @param virt [out] Output virtual address storage location\n @param phys Physical address base of the memory region\n @param size Size of the memory region\n @param flags Caching mode and access flags, see K_MAP_* macros"]
    pub fn z_phys_map(virt_ptr: *mut *mut u8, phys: usize, size: usize, flags: u32);
}
extern "C" {
    #[doc = " Unmap a virtual memory region from kernel's virtual address space.\n\n This function is intended to be used by drivers and early boot routines\n where temporary memory mappings need to be made. This allows these\n memory mappings to be discarded once they are no longer needed.\n\n This function alters the active page tables in the area reserved\n for the kernel.\n\n This will align the input parameters to page boundaries so that\n this can be used with the virtual address as returned by\n z_phys_map().\n\n This API is only available if CONFIG_MMU is enabled.\n\n It is highly discouraged to use this function to unmap memory mappings.\n It may conflict with anonymous memory mappings and demand paging and\n produce undefined behavior. Do not use this unless you know exactly\n what you are doing.\n\n This API is part of infrastructure still under development and may\n change.\n\n @param virt Starting address of the virtual address region to be unmapped.\n @param size Size of the virtual address region"]
    pub fn z_phys_unmap(virt: *mut u8, size: usize);
}
#[doc = " Paging Statistics."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_mem_paging_stats_t {}
#[test]
fn bindgen_test_layout_k_mem_paging_stats_t() {
    assert_eq!(
        ::core::mem::size_of::<k_mem_paging_stats_t>(),
        0usize,
        concat!("Size of: ", stringify!(k_mem_paging_stats_t))
    );
    assert_eq!(
        ::core::mem::align_of::<k_mem_paging_stats_t>(),
        1usize,
        concat!("Alignment of ", stringify!(k_mem_paging_stats_t))
    );
}
#[doc = " Paging Statistics Histograms."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct k_mem_paging_histogram_t {}
#[test]
fn bindgen_test_layout_k_mem_paging_histogram_t() {
    assert_eq!(
        ::core::mem::size_of::<k_mem_paging_histogram_t>(),
        0usize,
        concat!("Size of: ", stringify!(k_mem_paging_histogram_t))
    );
    assert_eq!(
        ::core::mem::align_of::<k_mem_paging_histogram_t>(),
        1usize,
        concat!("Alignment of ", stringify!(k_mem_paging_histogram_t))
    );
}
extern "C" {
    #[doc = " Evict a page-aligned virtual memory region to the backing store\n\n Useful if it is known that a memory region will not be used for some time.\n All the data pages within the specified region will be evicted to the\n backing store if they weren't already, with their associated page frames\n marked as available for mappings or page-ins.\n\n None of the associated page frames mapped to the provided region should\n be pinned.\n\n Note that there are no guarantees how long these pages will be evicted,\n they could take page faults immediately.\n\n If CONFIG_DEMAND_PAGING_ALLOW_IRQ is enabled, this function may not be\n called by ISRs as the backing store may be in-use.\n\n @param addr Base page-aligned virtual address\n @param size Page-aligned data region size\n @retval 0 Success\n @retval -ENOMEM Insufficient space in backing store to satisfy request.\n         The region may be partially paged out."]
    pub fn k_mem_page_out(addr: *mut ::core::ffi::c_void, size: usize) -> ::core::ffi::c_int;
}
extern "C" {
    #[doc = " Load a virtual data region into memory\n\n After the function completes, all the page frames associated with this\n function will be paged in. However, they are not guaranteed to stay there.\n This is useful if the region is known to be used soon.\n\n If CONFIG_DEMAND_PAGING_ALLOW_IRQ is enabled, this function may not be\n called by ISRs as the backing store may be in-use.\n\n @param addr Base page-aligned virtual address\n @param size Page-aligned data region size"]
    pub fn k_mem_page_in(addr: *mut ::core::ffi::c_void, size: usize);
}
extern "C" {
    #[doc = " Pin an aligned virtual data region, paging in as necessary\n\n After the function completes, all the page frames associated with this\n region will be resident in memory and pinned such that they stay that way.\n This is a stronger version of z_mem_page_in().\n\n If CONFIG_DEMAND_PAGING_ALLOW_IRQ is enabled, this function may not be\n called by ISRs as the backing store may be in-use.\n\n @param addr Base page-aligned virtual address\n @param size Page-aligned data region size"]
    pub fn k_mem_pin(addr: *mut ::core::ffi::c_void, size: usize);
}
extern "C" {
    #[doc = " Un-pin an aligned virtual data region\n\n After the function completes, all the page frames associated with this\n region will be no longer marked as pinned. This does not evict the region,\n follow this with z_mem_page_out() if you need that.\n\n @param addr Base page-aligned virtual address\n @param size Page-aligned data region size"]
    pub fn k_mem_unpin(addr: *mut ::core::ffi::c_void, size: usize);
}
extern "C" {
    #[doc = " Get the paging statistics since system startup\n\n This populates the paging statistics struct being passed in\n as argument.\n\n @param[in,out] stats Paging statistics struct to be filled."]
    #[link_name = "k_mem_paging_stats_get__extern"]
    pub fn k_mem_paging_stats_get(stats: *mut k_mem_paging_stats_t);
}
extern "C" {
    #[doc = " Get the paging statistics since system startup for a thread\n\n This populates the paging statistics struct being passed in\n as argument for a particular thread.\n\n @param[in] thread Thread\n @param[in,out] stats Paging statistics struct to be filled."]
    #[link_name = "k_mem_paging_thread_stats_get__extern"]
    pub fn k_mem_paging_thread_stats_get(thread: *mut k_thread, stats: *mut k_mem_paging_stats_t);
}
extern "C" {
    #[doc = " Get the eviction timing histogram\n\n This populates the timing histogram struct being passed in\n as argument.\n\n @param[in,out] hist Timing histogram struct to be filled."]
    #[link_name = "k_mem_paging_histogram_eviction_get__extern"]
    pub fn k_mem_paging_histogram_eviction_get(hist: *mut k_mem_paging_histogram_t);
}
extern "C" {
    #[doc = " Get the backing store page-in timing histogram\n\n This populates the timing histogram struct being passed in\n as argument.\n\n @param[in,out] hist Timing histogram struct to be filled."]
    #[link_name = "k_mem_paging_histogram_backing_store_page_in_get__extern"]
    pub fn k_mem_paging_histogram_backing_store_page_in_get(hist: *mut k_mem_paging_histogram_t);
}
extern "C" {
    #[doc = " Get the backing store page-out timing histogram\n\n This populates the timing histogram struct being passed in\n as argument.\n\n @param[in,out] hist Timing histogram struct to be filled."]
    #[link_name = "k_mem_paging_histogram_backing_store_page_out_get__extern"]
    pub fn k_mem_paging_histogram_backing_store_page_out_get(hist: *mut k_mem_paging_histogram_t);
}
extern "C" {
    pub fn z_impl_k_mem_paging_stats_get(stats: *mut k_mem_paging_stats_t);
}
extern "C" {
    pub fn z_impl_k_mem_paging_thread_stats_get(
        thread: *mut k_thread,
        stats: *mut k_mem_paging_stats_t,
    );
}
extern "C" {
    pub fn z_impl_k_mem_paging_histogram_eviction_get(hist: *mut k_mem_paging_histogram_t);
}
extern "C" {
    pub fn z_impl_k_mem_paging_histogram_backing_store_page_in_get(
        hist: *mut k_mem_paging_histogram_t,
    );
}
extern "C" {
    pub fn z_impl_k_mem_paging_histogram_backing_store_page_out_get(
        hist: *mut k_mem_paging_histogram_t,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct z_page_frame {
    _unused: [u8; 0],
}
extern "C" {
    #[doc = " Select a page frame for eviction\n\n The kernel will invoke this to choose a page frame to evict if there\n are no free page frames.\n\n This function will never be called before the initial\n k_mem_paging_eviction_init().\n\n This function is invoked with interrupts locked.\n\n @param [out] dirty Whether the page to evict is dirty\n @return The page frame to evict"]
    pub fn k_mem_paging_eviction_select(dirty: *mut bool) -> *mut z_page_frame;
}
extern "C" {
    #[doc = " Initialization function\n\n Called at POST_KERNEL to perform any necessary initialization tasks for the\n eviction algorithm. k_mem_paging_eviction_select() is guaranteed to never be\n called until this has returned, and this will only be called once."]
    pub fn k_mem_paging_eviction_init();
}
extern "C" {
    #[doc = " Reserve or fetch a storage location for a data page loaded into a page frame\n\n The returned location token must be unique to the mapped virtual address.\n This location will be used in the backing store to page out data page\n contents for later retrieval. The location value must be page-aligned.\n\n This function may be called multiple times on the same data page. If its\n page frame has its Z_PAGE_FRAME_BACKED bit set, it is expected to return\n the previous backing store location for the data page containing a cached\n clean copy. This clean copy may be updated on page-out, or used to\n discard clean pages without needing to write out their contents.\n\n If the backing store is full, some other backing store location which caches\n a loaded data page may be selected, in which case its associated page frame\n will have the Z_PAGE_FRAME_BACKED bit cleared (as it is no longer cached).\n\n pf->addr will indicate the virtual address the page is currently mapped to.\n Large, sparse backing stores which can contain the entire address space\n may simply generate location tokens purely as a function of pf->addr with no\n other management necessary.\n\n This function distinguishes whether it was called on behalf of a page\n fault. A free backing store location must always be reserved in order for\n page faults to succeed. If the page_fault parameter is not set, this\n function should return -ENOMEM even if one location is available.\n\n This function is invoked with interrupts locked.\n\n @param pf Virtual address to obtain a storage location\n @param [out] location storage location token\n @param page_fault Whether this request was for a page fault\n @return 0 Success\n @return -ENOMEM Backing store is full"]
    pub fn k_mem_paging_backing_store_location_get(
        pf: *mut z_page_frame,
        location: *mut usize,
        page_fault: bool,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[doc = " Free a backing store location\n\n Any stored data may be discarded, and the location token associated with\n this address may be re-used for some other data page.\n\n This function is invoked with interrupts locked.\n\n @param location Location token to free"]
    pub fn k_mem_paging_backing_store_location_free(location: usize);
}
extern "C" {
    #[doc = " Copy a data page from Z_SCRATCH_PAGE to the specified location\n\n Immediately before this is called, Z_SCRATCH_PAGE will be mapped read-write\n to the intended source page frame for the calling context.\n\n Calls to this and k_mem_paging_backing_store_page_in() will always be\n serialized, but interrupts may be enabled.\n\n @param location Location token for the data page, for later retrieval"]
    pub fn k_mem_paging_backing_store_page_out(location: usize);
}
extern "C" {
    #[doc = " Copy a data page from the provided location to Z_SCRATCH_PAGE.\n\n Immediately before this is called, Z_SCRATCH_PAGE will be mapped read-write\n to the intended destination page frame for the calling context.\n\n Calls to this and k_mem_paging_backing_store_page_out() will always be\n serialized, but interrupts may be enabled.\n\n @param location Location token for the data page"]
    pub fn k_mem_paging_backing_store_page_in(location: usize);
}
extern "C" {
    #[doc = " Update internal accounting after a page-in\n\n This is invoked after k_mem_paging_backing_store_page_in() and interrupts\n have been* re-locked, making it safe to access the z_page_frame data.\n The location value will be the same passed to\n k_mem_paging_backing_store_page_in().\n\n The primary use-case for this is to update custom fields for the backing\n store in the page frame, to reflect where the data should be evicted to\n if it is paged out again. This may be a no-op in some implementations.\n\n If the backing store caches paged-in data pages, this is the appropriate\n time to set the Z_PAGE_FRAME_BACKED bit. The kernel only skips paging\n out clean data pages if they are noted as clean in the page tables and the\n Z_PAGE_FRAME_BACKED bit is set in their associated page frame.\n\n @param pf Page frame that was loaded in\n @param location Location of where the loaded data page was retrieved"]
    pub fn k_mem_paging_backing_store_page_finalize(pf: *mut z_page_frame, location: usize);
}
extern "C" {
    #[doc = " Backing store initialization function.\n\n The implementation may expect to receive page in/out calls as soon as this\n returns, but not before that. Called at POST_KERNEL.\n\n This function is expected to do two things:\n - Initialize any internal data structures and accounting for the backing\n   store.\n - If the backing store already contains all or some loaded kernel data pages\n   at boot time, Z_PAGE_FRAME_BACKED should be appropriately set for their\n   associated page frames, and any internal accounting set up appropriately."]
    pub fn k_mem_paging_backing_store_init();
}
extern "C" {
    #[doc = " Return the amount of free memory available\n\n The returned value will reflect how many free RAM page frames are available.\n If demand paging is enabled, it may still be possible to allocate more.\n\n The information reported by this function may go stale immediately if\n concurrent memory mappings or page-ins take place.\n\n @return Free physical RAM, in bytes"]
    pub fn k_mem_free_get() -> usize;
}
extern "C" {
    #[doc = " Map anonymous memory into Zephyr's address space\n\n This function effectively increases the data space available to Zephyr.\n The kernel will choose a base virtual address and return it to the caller.\n The memory will have access permissions for all contexts set per the\n provided flags argument.\n\n If user thread access control needs to be managed in any way, do not enable\n K_MEM_PERM_USER flags here; instead manage the region's permissions\n with memory domain APIs after the mapping has been established. Setting\n K_MEM_PERM_USER here will allow all user threads to access this memory\n which is usually undesirable.\n\n Unless K_MEM_MAP_UNINIT is used, the returned memory will be zeroed.\n\n The mapped region is not guaranteed to be physically contiguous in memory.\n Physically contiguous buffers should be allocated statically and pinned\n at build time.\n\n Pages mapped in this way have write-back cache settings.\n\n The returned virtual memory pointer will be page-aligned. The size\n parameter, and any base address for re-mapping purposes must be page-\n aligned.\n\n Note that the allocation includes two guard pages immediately before\n and after the requested region. The total size of the allocation will be\n the requested size plus the size of these two guard pages.\n\n Many K_MEM_MAP_* flags have been implemented to alter the behavior of this\n function, with details in the documentation for these flags.\n\n @param size Size of the memory mapping. This must be page-aligned.\n @param flags K_MEM_PERM_*, K_MEM_MAP_* control flags.\n @return The mapped memory location, or NULL if insufficient virtual address\n         space, insufficient physical memory to establish the mapping,\n         or insufficient memory for paging structures."]
    pub fn k_mem_map(size: usize, flags: u32) -> *mut ::core::ffi::c_void;
}
extern "C" {
    #[doc = " Un-map mapped memory\n\n This removes a memory mapping for the provided page-aligned region.\n Associated page frames will be free and the kernel may re-use the associated\n virtual address region. Any paged out data pages may be discarded.\n\n Calling this function on a region which was not mapped to begin with is\n undefined behavior.\n\n @param addr Page-aligned memory region base virtual address\n @param size Page-aligned memory region size"]
    pub fn k_mem_unmap(addr: *mut ::core::ffi::c_void, size: usize);
}
extern "C" {
    #[doc = " Given an arbitrary region, provide a aligned region that covers it\n\n The returned region will have both its base address and size aligned\n to the provided alignment value.\n\n @param aligned_addr [out] Aligned address\n @param aligned_size [out] Aligned region size\n @param addr Region base address\n @param size Region size\n @param align What to align the address and size to\n @retval offset between aligned_addr and addr"]
    pub fn k_mem_region_align(
        aligned_addr: *mut usize,
        aligned_size: *mut usize,
        addr: usize,
        size: usize,
        align: usize,
    ) -> usize;
}
pub type io_port_t = u32;
pub type mm_reg_t = usize;
pub type mem_addr_t = usize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct z_device_mmio_rom {
    #[doc = " MMIO linear address"]
    pub addr: mm_reg_t,
}
#[test]
fn bindgen_test_layout_z_device_mmio_rom() {
    const UNINIT: ::core::mem::MaybeUninit<z_device_mmio_rom> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<z_device_mmio_rom>(),
        4usize,
        concat!("Size of: ", stringify!(z_device_mmio_rom))
    );
    assert_eq!(
        ::core::mem::align_of::<z_device_mmio_rom>(),
        4usize,
        concat!("Alignment of ", stringify!(z_device_mmio_rom))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(z_device_mmio_rom),
            "::",
            stringify!(addr)
        )
    );
}
#[doc = " @brief Type used to represent a \"handle\" for a device.\n\n Every @ref device has an associated handle. You can get a pointer to a\n @ref device from its handle and vice versa, but the handle uses less space\n than a pointer. The device.h API mainly uses handles to store lists of\n multiple devices in a compact way.\n\n The extreme values and zero have special significance. Negative values\n identify functionality that does not correspond to a Zephyr device, such as\n the system clock or a SYS_INIT() function.\n\n @see device_handle_get()\n @see device_from_handle()"]
pub type device_handle_t = i16;
#[doc = " @brief Runtime device dynamic structure (in RAM) per driver instance\n\n Fields in this are expected to be default-initialized to zero. The\n kernel driver infrastructure and driver access functions are\n responsible for ensuring that any non-zero initialization is done\n before they are accessed."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct device_state {
    #[doc = " Device initialization return code (positive errno value).\n\n Device initialization functions return a negative errno code if they\n fail. In Zephyr, errno values do not exceed 255, so we can store the\n positive result value in a uint8_t type."]
    pub init_res: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_device_state() {
    const UNINIT: ::core::mem::MaybeUninit<device_state> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<device_state>(),
        2usize,
        concat!("Size of: ", stringify!(device_state))
    );
    assert_eq!(
        ::core::mem::align_of::<device_state>(),
        1usize,
        concat!("Alignment of ", stringify!(device_state))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).init_res) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(device_state),
            "::",
            stringify!(init_res)
        )
    );
}
impl device_state {
    #[inline]
    pub fn initialized(&self) -> bool {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_initialized(&mut self, val: bool) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(initialized: bool) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let initialized: u8 = unsafe { ::core::mem::transmute(initialized) };
            initialized as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pm_device {
    _unused: [u8; 0],
}
#[doc = " @defgroup sys_init System Initialization\n @ingroup os_services\n\n Zephyr offers an infrastructure to call initialization code before `main`.\n Such initialization calls can be registered using SYS_INIT() or\n SYS_INIT_NAMED() macros. By using a combination of initialization levels and\n priorities init sequence can be adjusted as needed. The available\n initialization levels are described, in order, below:\n\n - `EARLY`: Used very early in the boot process, right after entering the C\n   domain (``z_cstart()``). This can be used in architectures and SoCs that\n   extend or implement architecture code and use drivers or system services\n   that have to be initialized before the Kernel calls any architecture\n   specific initialization code.\n - `PRE_KERNEL_1`: Executed in Kernel's initialization context, which uses\n   the interrupt stack. At this point Kernel services are not yet available.\n - `PRE_KERNEL_2`: Same as `PRE_KERNEL_1`.\n - `POST_KERNEL`: Executed after Kernel is alive. From this point on, Kernel\n   primitives can be used.\n - `APPLICATION`: Executed just before application code (`main`).\n - `SMP`: Only available if @kconfig{CONFIG_SMP} is enabled, specific for\n   SMP.\n\n Initialization priority can take a value in the range of 0 to 99.\n\n @note The same infrastructure is used by devices.\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct device {
    #[doc = " Name of the device instance"]
    pub name: *const ::core::ffi::c_char,
    #[doc = " Address of device instance config information"]
    pub config: *const ::core::ffi::c_void,
    #[doc = " Address of the API structure exposed by the device instance"]
    pub api: *const ::core::ffi::c_void,
    #[doc = " Address of the common device state"]
    pub state: *mut device_state,
    #[doc = " Address of the device instance private data"]
    pub data: *mut ::core::ffi::c_void,
}
#[test]
fn bindgen_test_layout_device() {
    const UNINIT: ::core::mem::MaybeUninit<device> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<device>(),
        20usize,
        concat!("Size of: ", stringify!(device))
    );
    assert_eq!(
        ::core::mem::align_of::<device>(),
        4usize,
        concat!("Alignment of ", stringify!(device))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(device),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).config) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(device),
            "::",
            stringify!(config)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).api) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(device),
            "::",
            stringify!(api)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(device),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(device),
            "::",
            stringify!(data)
        )
    );
}
extern "C" {
    #[doc = " @brief Get the handle for a given device\n\n @param dev the device for which a handle is desired.\n\n @return the handle for the device, or DEVICE_HANDLE_NULL if the device does\n not have an associated handle."]
    #[link_name = "device_handle_get__extern"]
    pub fn device_handle_get(dev: *const device) -> device_handle_t;
}
extern "C" {
    #[doc = " @brief Get the device corresponding to a handle.\n\n @param dev_handle the device handle\n\n @return the device that has that handle, or a null pointer if @p dev_handle\n does not identify a device."]
    #[link_name = "device_from_handle__extern"]
    pub fn device_from_handle(dev_handle: device_handle_t) -> *const device;
}
extern "C" {
    #[doc = " @brief Get a @ref device reference from its @ref device.name field.\n\n This function iterates through the devices on the system. If a device with\n the given @p name field is found, and that device initialized successfully at\n boot time, this function returns a pointer to the device.\n\n If no device has the given @p name, this function returns `NULL`.\n\n This function also returns NULL when a device is found, but it failed to\n initialize successfully at boot time. (To troubleshoot this case, set a\n breakpoint on your device driver's initialization function.)\n\n @param name device name to search for. A null pointer, or a pointer to an\n empty string, will cause NULL to be returned.\n\n @return pointer to device structure with the given name; `NULL` if the device\n is not found or if the device with that name's initialization function\n failed."]
    #[link_name = "device_get_binding__extern"]
    pub fn device_get_binding(name: *const ::core::ffi::c_char) -> *const device;
}
extern "C" {
    #[doc = " @brief Get access to the static array of static devices.\n\n @param devices where to store the pointer to the array of statically\n allocated devices. The array must not be mutated through this pointer.\n\n @return the number of statically allocated devices."]
    pub fn z_device_get_all_static(devices: *mut *const device) -> usize;
}
extern "C" {
    #[doc = " @brief Verify that a device is ready for use.\n\n This is the implementation underlying device_is_ready(), without the overhead\n of a syscall wrapper.\n\n @param dev pointer to the device in question.\n\n @retval true If the device is ready for use.\n @retval false If the device is not ready for use or if a NULL device pointer\n is passed as argument.\n\n @see device_is_ready()"]
    pub fn z_device_is_ready(dev: *const device) -> bool;
}
extern "C" {
    #[doc = " @brief Verify that a device is ready for use.\n\n Indicates whether the provided device pointer is for a device known to be\n in a state where it can be used with its standard API.\n\n This can be used with device pointers captured from DEVICE_DT_GET(), which\n does not include the readiness checks of device_get_binding(). At minimum\n this means that the device has been successfully initialized.\n\n @param dev pointer to the device in question.\n\n @retval true If the device is ready for use.\n @retval false If the device is not ready for use or if a NULL device pointer\n is passed as argument."]
    #[link_name = "device_is_ready__extern"]
    pub fn device_is_ready(dev: *const device) -> bool;
}
extern "C" {
    #[link_name = "z_impl_device_is_ready__extern"]
    pub fn z_impl_device_is_ready(dev: *const device) -> bool;
}
extern "C" {
    pub static __device_dts_ord_0: device;
}
extern "C" {
    pub static __device_dts_ord_3: device;
}
extern "C" {
    pub static __device_dts_ord_1: device;
}
extern "C" {
    pub static __device_dts_ord_6: device;
}
extern "C" {
    pub static __device_dts_ord_7: device;
}
extern "C" {
    pub static __device_dts_ord_85: device;
}
extern "C" {
    pub static __device_dts_ord_115: device;
}
extern "C" {
    pub static __device_dts_ord_89: device;
}
extern "C" {
    pub static __device_dts_ord_75: device;
}
extern "C" {
    pub static __device_dts_ord_125: device;
}
extern "C" {
    pub static __device_dts_ord_126: device;
}
extern "C" {
    pub static __device_dts_ord_127: device;
}
extern "C" {
    pub static __device_dts_ord_130: device;
}
extern "C" {
    pub static __device_dts_ord_131: device;
}
extern "C" {
    pub static __device_dts_ord_113: device;
}
extern "C" {
    pub static __device_dts_ord_86: device;
}
extern "C" {
    pub static __device_dts_ord_103: device;
}
extern "C" {
    pub static __device_dts_ord_91: device;
}
extern "C" {
    pub static __device_dts_ord_10: device;
}
extern "C" {
    pub static __device_dts_ord_73: device;
}
extern "C" {
    pub static __device_dts_ord_107: device;
}
extern "C" {
    pub static __device_dts_ord_98: device;
}
extern "C" {
    pub static __device_dts_ord_78: device;
}
extern "C" {
    pub static __device_dts_ord_74: device;
}
extern "C" {
    pub static __device_dts_ord_117: device;
}
extern "C" {
    pub static __device_dts_ord_79: device;
}
extern "C" {
    pub static __device_dts_ord_80: device;
}
extern "C" {
    pub static __device_dts_ord_81: device;
}
extern "C" {
    pub static __device_dts_ord_82: device;
}
extern "C" {
    pub static __device_dts_ord_83: device;
}
extern "C" {
    pub static __device_dts_ord_84: device;
}
extern "C" {
    pub static __device_dts_ord_69: device;
}
extern "C" {
    pub static __device_dts_ord_72: device;
}
extern "C" {
    pub static __device_dts_ord_118: device;
}
extern "C" {
    pub static __device_dts_ord_119: device;
}
extern "C" {
    pub static __device_dts_ord_120: device;
}
extern "C" {
    pub static __device_dts_ord_121: device;
}
extern "C" {
    pub static __device_dts_ord_122: device;
}
extern "C" {
    pub static __device_dts_ord_123: device;
}
extern "C" {
    pub static __device_dts_ord_124: device;
}
extern "C" {
    pub static __device_dts_ord_93: device;
}
extern "C" {
    pub static __device_dts_ord_90: device;
}
extern "C" {
    pub static __device_dts_ord_116: device;
}
extern "C" {
    pub static __device_dts_ord_128: device;
}
extern "C" {
    pub static __device_dts_ord_129: device;
}
extern "C" {
    pub static __device_dts_ord_106: device;
}
extern "C" {
    pub static __device_dts_ord_11: device;
}
extern "C" {
    pub static __device_dts_ord_105: device;
}
extern "C" {
    pub static __device_dts_ord_77: device;
}
extern "C" {
    pub static __device_dts_ord_25: device;
}
extern "C" {
    pub static __device_dts_ord_59: device;
}
extern "C" {
    pub static __device_dts_ord_60: device;
}
extern "C" {
    pub static __device_dts_ord_61: device;
}
extern "C" {
    pub static __device_dts_ord_62: device;
}
extern "C" {
    pub static __device_dts_ord_63: device;
}
extern "C" {
    pub static __device_dts_ord_64: device;
}
extern "C" {
    pub static __device_dts_ord_65: device;
}
extern "C" {
    pub static __device_dts_ord_66: device;
}
extern "C" {
    pub static __device_dts_ord_67: device;
}
extern "C" {
    pub static __device_dts_ord_68: device;
}
extern "C" {
    pub static __device_dts_ord_26: device;
}
extern "C" {
    pub static __device_dts_ord_27: device;
}
extern "C" {
    pub static __device_dts_ord_28: device;
}
extern "C" {
    pub static __device_dts_ord_29: device;
}
extern "C" {
    pub static __device_dts_ord_30: device;
}
extern "C" {
    pub static __device_dts_ord_31: device;
}
extern "C" {
    pub static __device_dts_ord_32: device;
}
extern "C" {
    pub static __device_dts_ord_33: device;
}
extern "C" {
    pub static __device_dts_ord_34: device;
}
extern "C" {
    pub static __device_dts_ord_35: device;
}
extern "C" {
    pub static __device_dts_ord_36: device;
}
extern "C" {
    pub static __device_dts_ord_37: device;
}
extern "C" {
    pub static __device_dts_ord_43: device;
}
extern "C" {
    pub static __device_dts_ord_44: device;
}
extern "C" {
    pub static __device_dts_ord_45: device;
}
extern "C" {
    pub static __device_dts_ord_46: device;
}
extern "C" {
    pub static __device_dts_ord_47: device;
}
extern "C" {
    pub static __device_dts_ord_48: device;
}
extern "C" {
    pub static __device_dts_ord_49: device;
}
extern "C" {
    pub static __device_dts_ord_50: device;
}
extern "C" {
    pub static __device_dts_ord_51: device;
}
extern "C" {
    pub static __device_dts_ord_52: device;
}
extern "C" {
    pub static __device_dts_ord_53: device;
}
extern "C" {
    pub static __device_dts_ord_54: device;
}
extern "C" {
    pub static __device_dts_ord_38: device;
}
extern "C" {
    pub static __device_dts_ord_39: device;
}
extern "C" {
    pub static __device_dts_ord_40: device;
}
extern "C" {
    pub static __device_dts_ord_41: device;
}
extern "C" {
    pub static __device_dts_ord_42: device;
}
extern "C" {
    pub static __device_dts_ord_55: device;
}
extern "C" {
    pub static __device_dts_ord_56: device;
}
extern "C" {
    pub static __device_dts_ord_57: device;
}
extern "C" {
    pub static __device_dts_ord_58: device;
}
extern "C" {
    pub static __device_dts_ord_5: device;
}
extern "C" {
    pub static __device_dts_ord_17: device;
}
extern "C" {
    pub static __device_dts_ord_18: device;
}
extern "C" {
    pub static __device_dts_ord_19: device;
}
extern "C" {
    pub static __device_dts_ord_20: device;
}
extern "C" {
    pub static __device_dts_ord_21: device;
}
extern "C" {
    pub static __device_dts_ord_22: device;
}
extern "C" {
    pub static __device_dts_ord_23: device;
}
extern "C" {
    pub static __device_dts_ord_24: device;
}
extern "C" {
    pub static __device_dts_ord_70: device;
}
extern "C" {
    pub static __device_dts_ord_71: device;
}
extern "C" {
    pub static __device_dts_ord_12: device;
}
extern "C" {
    pub static __device_dts_ord_13: device;
}
extern "C" {
    pub static __device_dts_ord_14: device;
}
extern "C" {
    pub static __device_dts_ord_15: device;
}
extern "C" {
    pub static __device_dts_ord_16: device;
}
extern "C" {
    pub static __device_dts_ord_4: device;
}
extern "C" {
    pub static __device_dts_ord_2: device;
}
extern "C" {
    pub fn z_impl_device_get_binding(name: *const ::core::ffi::c_char) -> *const device;
}
extern "C" {
    pub fn _isr_wrapper();
}
extern "C" {
    pub fn z_irq_spurious(unused: *const ::core::ffi::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _isr_table_entry {
    pub arg: *const ::core::ffi::c_void,
    pub isr: ::core::option::Option<unsafe extern "C" fn(arg1: *const ::core::ffi::c_void)>,
}
#[test]
fn bindgen_test_layout__isr_table_entry() {
    const UNINIT: ::core::mem::MaybeUninit<_isr_table_entry> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_isr_table_entry>(),
        8usize,
        concat!("Size of: ", stringify!(_isr_table_entry))
    );
    assert_eq!(
        ::core::mem::align_of::<_isr_table_entry>(),
        4usize,
        concat!("Alignment of ", stringify!(_isr_table_entry))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).arg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_table_entry),
            "::",
            stringify!(arg)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).isr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_table_entry),
            "::",
            stringify!(isr)
        )
    );
}
extern "C" {
    pub static mut _sw_isr_table: [_isr_table_entry; 0usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _irq_parent_entry {
    pub dev: *const device,
    pub irq: ::core::ffi::c_uint,
    pub offset: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout__irq_parent_entry() {
    const UNINIT: ::core::mem::MaybeUninit<_irq_parent_entry> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_irq_parent_entry>(),
        12usize,
        concat!("Size of: ", stringify!(_irq_parent_entry))
    );
    assert_eq!(
        ::core::mem::align_of::<_irq_parent_entry>(),
        4usize,
        concat!("Alignment of ", stringify!(_irq_parent_entry))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_irq_parent_entry),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).irq) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_irq_parent_entry),
            "::",
            stringify!(irq)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_irq_parent_entry),
            "::",
            stringify!(offset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _isr_list {
    #[doc = " IRQ line number"]
    pub irq: i32,
    #[doc = " Flags for this IRQ, see ISR_FLAG_* definitions"]
    pub flags: i32,
    #[doc = " ISR to call"]
    pub func: *mut ::core::ffi::c_void,
    #[doc = " Parameter for non-direct IRQs"]
    pub param: *const ::core::ffi::c_void,
}
#[test]
fn bindgen_test_layout__isr_list() {
    const UNINIT: ::core::mem::MaybeUninit<_isr_list> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_isr_list>(),
        16usize,
        concat!("Size of: ", stringify!(_isr_list))
    );
    assert_eq!(
        ::core::mem::align_of::<_isr_list>(),
        4usize,
        concat!("Alignment of ", stringify!(_isr_list))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).irq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_list),
            "::",
            stringify!(irq)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_list),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).func) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_list),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).param) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_list),
            "::",
            stringify!(param)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct _isr_list_sname {
    #[doc = " IRQ line number"]
    pub irq: i32,
    #[doc = " Flags for this IRQ, see ISR_FLAG_* definitions"]
    pub flags: i32,
    #[doc = " The section name"]
    pub sname: __IncompleteArrayField<::core::ffi::c_char>,
}
#[test]
fn bindgen_test_layout__isr_list_sname() {
    const UNINIT: ::core::mem::MaybeUninit<_isr_list_sname> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_isr_list_sname>(),
        8usize,
        concat!("Size of: ", stringify!(_isr_list_sname))
    );
    assert_eq!(
        ::core::mem::align_of::<_isr_list_sname>(),
        4usize,
        concat!("Alignment of ", stringify!(_isr_list_sname))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).irq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_list_sname),
            "::",
            stringify!(irq)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_list_sname),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sname) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_isr_list_sname),
            "::",
            stringify!(sname)
        )
    );
}
extern "C" {
    pub fn z_arm_irq_priority_set(irq: ::core::ffi::c_uint, prio: ::core::ffi::c_uint, flags: u32);
}
extern "C" {
    pub fn z_arm_int_exit();
}
extern "C" {
    pub fn z_arm_interrupt_init();
}
extern "C" {
    #[link_name = "arch_isr_direct_header__extern"]
    pub fn arch_isr_direct_header();
}
extern "C" {
    #[link_name = "arch_isr_direct_footer__extern"]
    pub fn arch_isr_direct_footer(maybe_swap: ::core::ffi::c_int);
}
extern "C" {
    pub fn sys_clock_cycle_get_32() -> u32;
}
extern "C" {
    pub fn sys_clock_cycle_get_64() -> u64;
}
extern "C" {
    #[link_name = "arch_nop__extern"]
    pub fn arch_nop();
}
pub type paddr_t = usize;
pub type vaddr_t = *mut ::core::ffi::c_void;
extern "C" {
    #[doc = " @brief find most significant bit set in a 32-bit word\n\n This routine finds the first bit set starting from the most significant bit\n in the argument passed in and returns the index of that bit.  Bits are\n numbered starting at 1 from the least significant bit.  A return value of\n zero indicates that the value passed is zero.\n\n @return most significant bit set, 0 if @a op is 0"]
    #[link_name = "find_msb_set__extern"]
    pub fn find_msb_set(op: u32) -> ::core::ffi::c_uint;
}
extern "C" {
    #[doc = " @brief find least significant bit set in a 32-bit word\n\n This routine finds the first bit set starting from the least significant bit\n in the argument passed in and returns the index of that bit.  Bits are\n numbered starting at 1 from the least significant bit.  A return value of\n zero indicates that the value passed is zero.\n\n @return least significant bit set, 0 if @a op is 0"]
    #[link_name = "find_lsb_set__extern"]
    pub fn find_lsb_set(op: u32) -> ::core::ffi::c_uint;
}
extern "C" {
    #[link_name = "sys_set_bit__extern"]
    pub fn sys_set_bit(addr: mem_addr_t, bit: ::core::ffi::c_uint);
}
extern "C" {
    #[link_name = "sys_clear_bit__extern"]
    pub fn sys_clear_bit(addr: mem_addr_t, bit: ::core::ffi::c_uint);
}
extern "C" {
    #[link_name = "sys_test_bit__extern"]
    pub fn sys_test_bit(addr: mem_addr_t, bit: ::core::ffi::c_uint) -> ::core::ffi::c_int;
}
extern "C" {
    #[link_name = "sys_set_bits__extern"]
    pub fn sys_set_bits(addr: mem_addr_t, mask: ::core::ffi::c_uint);
}
extern "C" {
    #[link_name = "sys_clear_bits__extern"]
    pub fn sys_clear_bits(addr: mem_addr_t, mask: ::core::ffi::c_uint);
}
extern "C" {
    #[link_name = "sys_bitfield_set_bit__extern"]
    pub fn sys_bitfield_set_bit(addr: mem_addr_t, bit: ::core::ffi::c_uint);
}
extern "C" {
    #[link_name = "sys_bitfield_clear_bit__extern"]
    pub fn sys_bitfield_clear_bit(addr: mem_addr_t, bit: ::core::ffi::c_uint);
}
extern "C" {
    #[link_name = "sys_bitfield_test_bit__extern"]
    pub fn sys_bitfield_test_bit(addr: mem_addr_t, bit: ::core::ffi::c_uint) -> ::core::ffi::c_int;
}
extern "C" {
    #[link_name = "sys_test_and_set_bit__extern"]
    pub fn sys_test_and_set_bit(addr: mem_addr_t, bit: ::core::ffi::c_uint) -> ::core::ffi::c_int;
}
extern "C" {
    #[link_name = "sys_test_and_clear_bit__extern"]
    pub fn sys_test_and_clear_bit(addr: mem_addr_t, bit: ::core::ffi::c_uint)
        -> ::core::ffi::c_int;
}
extern "C" {
    #[link_name = "sys_bitfield_test_and_set_bit__extern"]
    pub fn sys_bitfield_test_and_set_bit(
        addr: mem_addr_t,
        bit: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[link_name = "sys_bitfield_test_and_clear_bit__extern"]
    pub fn sys_bitfield_test_and_clear_bit(
        addr: mem_addr_t,
        bit: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    #[link_name = "sys_read8__extern"]
    pub fn sys_read8(addr: mem_addr_t) -> u8;
}
extern "C" {
    #[link_name = "sys_write8__extern"]
    pub fn sys_write8(data: u8, addr: mem_addr_t);
}
extern "C" {
    #[link_name = "sys_read16__extern"]
    pub fn sys_read16(addr: mem_addr_t) -> u16;
}
extern "C" {
    #[link_name = "sys_write16__extern"]
    pub fn sys_write16(data: u16, addr: mem_addr_t);
}
extern "C" {
    #[link_name = "sys_read32__extern"]
    pub fn sys_read32(addr: mem_addr_t) -> u32;
}
extern "C" {
    #[link_name = "sys_write32__extern"]
    pub fn sys_write32(data: u32, addr: mem_addr_t);
}
extern "C" {
    #[link_name = "sys_read64__extern"]
    pub fn sys_read64(addr: mem_addr_t) -> u64;
}
extern "C" {
    #[link_name = "sys_write64__extern"]
    pub fn sys_write64(data: u64, addr: mem_addr_t);
}
#[doc = " Generic CPU exception, not covered by other codes"]
pub const k_fatal_error_reason_K_ERR_CPU_EXCEPTION: k_fatal_error_reason = 0;
#[doc = " Unhandled hardware interrupt"]
pub const k_fatal_error_reason_K_ERR_SPURIOUS_IRQ: k_fatal_error_reason = 1;
#[doc = " Faulting context overflowed its stack buffer"]
pub const k_fatal_error_reason_K_ERR_STACK_CHK_FAIL: k_fatal_error_reason = 2;
#[doc = " Moderate severity software error"]
pub const k_fatal_error_reason_K_ERR_KERNEL_OOPS: k_fatal_error_reason = 3;
#[doc = " High severity software error"]
pub const k_fatal_error_reason_K_ERR_KERNEL_PANIC: k_fatal_error_reason = 4;
#[doc = " Arch specific fatal errors"]
pub const k_fatal_error_reason_K_ERR_ARCH_START: k_fatal_error_reason = 16;
#[doc = " @defgroup fatal_types Fatal error base types\n @ingroup fatal_apis\n @{"]
pub type k_fatal_error_reason = ::core::ffi::c_uint;
pub const k_fatal_error_reason_arch_K_ERR_ARM_MEM_GENERIC: k_fatal_error_reason_arch = 16;
pub const k_fatal_error_reason_arch_K_ERR_ARM_MEM_STACKING: k_fatal_error_reason_arch = 17;
pub const k_fatal_error_reason_arch_K_ERR_ARM_MEM_UNSTACKING: k_fatal_error_reason_arch = 18;
pub const k_fatal_error_reason_arch_K_ERR_ARM_MEM_DATA_ACCESS: k_fatal_error_reason_arch = 19;
pub const k_fatal_error_reason_arch_K_ERR_ARM_MEM_INSTRUCTION_ACCESS: k_fatal_error_reason_arch =
    20;
pub const k_fatal_error_reason_arch_K_ERR_ARM_MEM_FP_LAZY_STATE_PRESERVATION:
    k_fatal_error_reason_arch = 21;
pub const k_fatal_error_reason_arch_K_ERR_ARM_BUS_GENERIC: k_fatal_error_reason_arch = 22;
pub const k_fatal_error_reason_arch_K_ERR_ARM_BUS_STACKING: k_fatal_error_reason_arch = 23;
pub const k_fatal_error_reason_arch_K_ERR_ARM_BUS_UNSTACKING: k_fatal_error_reason_arch = 24;
pub const k_fatal_error_reason_arch_K_ERR_ARM_BUS_PRECISE_DATA_BUS: k_fatal_error_reason_arch = 25;
pub const k_fatal_error_reason_arch_K_ERR_ARM_BUS_IMPRECISE_DATA_BUS: k_fatal_error_reason_arch =
    26;
pub const k_fatal_error_reason_arch_K_ERR_ARM_BUS_INSTRUCTION_BUS: k_fatal_error_reason_arch = 27;
pub const k_fatal_error_reason_arch_K_ERR_ARM_BUS_FP_LAZY_STATE_PRESERVATION:
    k_fatal_error_reason_arch = 28;
pub const k_fatal_error_reason_arch_K_ERR_ARM_USAGE_GENERIC: k_fatal_error_reason_arch = 29;
pub const k_fatal_error_reason_arch_K_ERR_ARM_USAGE_DIV_0: k_fatal_error_reason_arch = 30;
pub const k_fatal_error_reason_arch_K_ERR_ARM_USAGE_UNALIGNED_ACCESS: k_fatal_error_reason_arch =
    31;
pub const k_fatal_error_reason_arch_K_ERR_ARM_USAGE_STACK_OVERFLOW: k_fatal_error_reason_arch = 32;
pub const k_fatal_error_reason_arch_K_ERR_ARM_USAGE_NO_COPROCESSOR: k_fatal_error_reason_arch = 33;
pub const k_fatal_error_reason_arch_K_ERR_ARM_USAGE_ILLEGAL_EXC_RETURN: k_fatal_error_reason_arch =
    34;
pub const k_fatal_error_reason_arch_K_ERR_ARM_USAGE_ILLEGAL_EPSR: k_fatal_error_reason_arch = 35;
pub const k_fatal_error_reason_arch_K_ERR_ARM_USAGE_UNDEFINED_INSTRUCTION:
    k_fatal_error_reason_arch = 36;
pub const k_fatal_error_reason_arch_K_ERR_ARM_SECURE_GENERIC: k_fatal_error_reason_arch = 37;
pub const k_fatal_error_reason_arch_K_ERR_ARM_SECURE_ENTRY_POINT: k_fatal_error_reason_arch = 38;
pub const k_fatal_error_reason_arch_K_ERR_ARM_SECURE_INTEGRITY_SIGNATURE:
    k_fatal_error_reason_arch = 39;
pub const k_fatal_error_reason_arch_K_ERR_ARM_SECURE_EXCEPTION_RETURN: k_fatal_error_reason_arch =
    40;
pub const k_fatal_error_reason_arch_K_ERR_ARM_SECURE_ATTRIBUTION_UNIT: k_fatal_error_reason_arch =
    41;
pub const k_fatal_error_reason_arch_K_ERR_ARM_SECURE_TRANSITION: k_fatal_error_reason_arch = 42;
pub const k_fatal_error_reason_arch_K_ERR_ARM_SECURE_LAZY_STATE_PRESERVATION:
    k_fatal_error_reason_arch = 43;
pub const k_fatal_error_reason_arch_K_ERR_ARM_SECURE_LAZY_STATE_ERROR: k_fatal_error_reason_arch =
    44;
pub const k_fatal_error_reason_arch_K_ERR_ARM_UNDEFINED_INSTRUCTION: k_fatal_error_reason_arch = 45;
pub const k_fatal_error_reason_arch_K_ERR_ARM_ALIGNMENT_FAULT: k_fatal_error_reason_arch = 46;
pub const k_fatal_error_reason_arch_K_ERR_ARM_BACKGROUND_FAULT: k_fatal_error_reason_arch = 47;
pub const k_fatal_error_reason_arch_K_ERR_ARM_PERMISSION_FAULT: k_fatal_error_reason_arch = 48;
pub const k_fatal_error_reason_arch_K_ERR_ARM_SYNC_EXTERNAL_ABORT: k_fatal_error_reason_arch = 49;
pub const k_fatal_error_reason_arch_K_ERR_ARM_ASYNC_EXTERNAL_ABORT: k_fatal_error_reason_arch = 50;
pub const k_fatal_error_reason_arch_K_ERR_ARM_SYNC_PARITY_ERROR: k_fatal_error_reason_arch = 51;
pub const k_fatal_error_reason_arch_K_ERR_ARM_ASYNC_PARITY_ERROR: k_fatal_error_reason_arch = 52;
pub const k_fatal_error_reason_arch_K_ERR_ARM_DEBUG_EVENT: k_fatal_error_reason_arch = 53;
pub const k_fatal_error_reason_arch_K_ERR_ARM_TRANSLATION_FAULT: k_fatal_error_reason_arch = 54;
pub const k_fatal_error_reason_arch_K_ERR_ARM_UNSUPPORTED_EXCLUSIVE_ACCESS_FAULT:
    k_fatal_error_reason_arch = 55;
pub type k_fatal_error_reason_arch = ::core::ffi::c_uint;
pub type locale_t = *mut __locale_t;
extern "C" {
    pub fn memchr(
        arg1: *const ::core::ffi::c_void,
        arg2: ::core::ffi::c_int,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn memcmp(
        arg1: *const ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn memcpy(
        arg1: *mut ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn memmove(
        arg1: *mut ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn memset(
        arg1: *mut ::core::ffi::c_void,
        arg2: ::core::ffi::c_int,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn strcat(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strchr(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strcmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn strcoll(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn strcpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strcspn(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    pub fn strerror(arg1: ::core::ffi::c_int) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strlen(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_uint;
}
extern "C" {
    pub fn strncat(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strncmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn strncpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strpbrk(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strrchr(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strspn(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    pub fn strstr(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strtok(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strxfrm(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
extern "C" {
    pub fn strcoll_l(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: locale_t,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn strerror_l(arg1: ::core::ffi::c_int, arg2: locale_t) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strxfrm_l(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strtok_r(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn memccpy(
        arg1: *mut ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_int,
        arg4: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn stpcpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn stpncpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strdup(arg1: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _strdup_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strndup(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn _strndup_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        arg1: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
    ) -> ::core::ffi::c_int;
}
extern "C" {
    pub fn _strerror_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: ::core::ffi::c_int,
        arg4: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn strnlen(arg1: *const ::core::ffi::c_char, arg2: usize) -> usize;
}
extern "C" {
    pub fn strsignal(__signo: ::core::ffi::c_int) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn __memcpy_chk(
        arg1: *mut ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: usize,
        arg4: usize,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn __memmove_chk(
        arg1: *mut ::core::ffi::c_void,
        arg2: *mut ::core::ffi::c_void,
        arg3: usize,
        arg4: usize,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn __mempcpy_chk(
        arg1: *mut ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: usize,
        arg4: usize,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn __memset_chk(
        arg1: *mut ::core::ffi::c_void,
        arg2: ::core::ffi::c_int,
        arg3: usize,
        arg4: usize,
    ) -> *mut ::core::ffi::c_void;
}
extern "C" {
    pub fn __stpcpy_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn __strcat_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn __strcpy_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn __strncat_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
        arg4: usize,
    ) -> *mut ::core::ffi::c_char;
}
extern "C" {
    pub fn __strncpy_chk(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
        arg4: usize,
    ) -> *mut ::core::ffi::c_char;
}
#[doc = "< -15  Reset Vector, invoked on Power up and warm reset"]
pub const IRQn_Type_Reset_IRQn: IRQn_Type = -15;
#[doc = "< -14  Non maskable Interrupt, cannot be stopped or preempted"]
pub const IRQn_Type_NonMaskableInt_IRQn: IRQn_Type = -14;
#[doc = "< -13  Hard Fault, all classes of Fault"]
pub const IRQn_Type_HardFault_IRQn: IRQn_Type = -13;
#[doc = "< -12  Memory Management, MPU mismatch, including Access Violation\nand No Match"]
pub const IRQn_Type_MemoryManagement_IRQn: IRQn_Type = -12;
#[doc = "< -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory\nrelated Fault"]
pub const IRQn_Type_BusFault_IRQn: IRQn_Type = -11;
#[doc = "< -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition"]
pub const IRQn_Type_UsageFault_IRQn: IRQn_Type = -10;
#[doc = "< -5 System Service Call via SVC instruction"]
pub const IRQn_Type_SVCall_IRQn: IRQn_Type = -5;
#[doc = "< -4 Debug Monitor"]
pub const IRQn_Type_DebugMonitor_IRQn: IRQn_Type = -4;
#[doc = "< -2 Pendable request for system service"]
pub const IRQn_Type_PendSV_IRQn: IRQn_Type = -2;
#[doc = "< -1 System Tick Timer"]
pub const IRQn_Type_SysTick_IRQn: IRQn_Type = -1;
#[doc = "< 0  POWER_CLOCK"]
pub const IRQn_Type_POWER_CLOCK_IRQn: IRQn_Type = 0;
#[doc = "< 1  RADIO"]
pub const IRQn_Type_RADIO_IRQn: IRQn_Type = 1;
#[doc = "< 2  UARTE0_UART0"]
pub const IRQn_Type_UARTE0_UART0_IRQn: IRQn_Type = 2;
#[doc = "< 3  SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0"]
pub const IRQn_Type_SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn: IRQn_Type = 3;
#[doc = "< 4  SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1"]
pub const IRQn_Type_SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn: IRQn_Type = 4;
#[doc = "< 5  NFCT"]
pub const IRQn_Type_NFCT_IRQn: IRQn_Type = 5;
#[doc = "< 6  GPIOTE"]
pub const IRQn_Type_GPIOTE_IRQn: IRQn_Type = 6;
#[doc = "< 7  SAADC"]
pub const IRQn_Type_SAADC_IRQn: IRQn_Type = 7;
#[doc = "< 8  TIMER0"]
pub const IRQn_Type_TIMER0_IRQn: IRQn_Type = 8;
#[doc = "< 9  TIMER1"]
pub const IRQn_Type_TIMER1_IRQn: IRQn_Type = 9;
#[doc = "< 10 TIMER2"]
pub const IRQn_Type_TIMER2_IRQn: IRQn_Type = 10;
#[doc = "< 11 RTC0"]
pub const IRQn_Type_RTC0_IRQn: IRQn_Type = 11;
#[doc = "< 12 TEMP"]
pub const IRQn_Type_TEMP_IRQn: IRQn_Type = 12;
#[doc = "< 13 RNG"]
pub const IRQn_Type_RNG_IRQn: IRQn_Type = 13;
#[doc = "< 14 ECB"]
pub const IRQn_Type_ECB_IRQn: IRQn_Type = 14;
#[doc = "< 15 CCM_AAR"]
pub const IRQn_Type_CCM_AAR_IRQn: IRQn_Type = 15;
#[doc = "< 16 WDT"]
pub const IRQn_Type_WDT_IRQn: IRQn_Type = 16;
#[doc = "< 17 RTC1"]
pub const IRQn_Type_RTC1_IRQn: IRQn_Type = 17;
#[doc = "< 18 QDEC"]
pub const IRQn_Type_QDEC_IRQn: IRQn_Type = 18;
#[doc = "< 19 COMP_LPCOMP"]
pub const IRQn_Type_COMP_LPCOMP_IRQn: IRQn_Type = 19;
#[doc = "< 20 SWI0_EGU0"]
pub const IRQn_Type_SWI0_EGU0_IRQn: IRQn_Type = 20;
#[doc = "< 21 SWI1_EGU1"]
pub const IRQn_Type_SWI1_EGU1_IRQn: IRQn_Type = 21;
#[doc = "< 22 SWI2_EGU2"]
pub const IRQn_Type_SWI2_EGU2_IRQn: IRQn_Type = 22;
#[doc = "< 23 SWI3_EGU3"]
pub const IRQn_Type_SWI3_EGU3_IRQn: IRQn_Type = 23;
#[doc = "< 24 SWI4_EGU4"]
pub const IRQn_Type_SWI4_EGU4_IRQn: IRQn_Type = 24;
#[doc = "< 25 SWI5_EGU5"]
pub const IRQn_Type_SWI5_EGU5_IRQn: IRQn_Type = 25;
#[doc = "< 26 TIMER3"]
pub const IRQn_Type_TIMER3_IRQn: IRQn_Type = 26;
#[doc = "< 27 TIMER4"]
pub const IRQn_Type_TIMER4_IRQn: IRQn_Type = 27;
#[doc = "< 28 PWM0"]
pub const IRQn_Type_PWM0_IRQn: IRQn_Type = 28;
#[doc = "< 29 PDM"]
pub const IRQn_Type_PDM_IRQn: IRQn_Type = 29;
#[doc = "< 32 MWU"]
pub const IRQn_Type_MWU_IRQn: IRQn_Type = 32;
#[doc = "< 33 PWM1"]
pub const IRQn_Type_PWM1_IRQn: IRQn_Type = 33;
#[doc = "< 34 PWM2"]
pub const IRQn_Type_PWM2_IRQn: IRQn_Type = 34;
#[doc = "< 35 SPIM2_SPIS2_SPI2"]
pub const IRQn_Type_SPIM2_SPIS2_SPI2_IRQn: IRQn_Type = 35;
#[doc = "< 36 RTC2"]
pub const IRQn_Type_RTC2_IRQn: IRQn_Type = 36;
#[doc = "< 37 I2S"]
pub const IRQn_Type_I2S_IRQn: IRQn_Type = 37;
#[doc = "< 38 FPU"]
pub const IRQn_Type_FPU_IRQn: IRQn_Type = 38;
#[doc = "< 39 USBD"]
pub const IRQn_Type_USBD_IRQn: IRQn_Type = 39;
#[doc = "< 40 UARTE1"]
pub const IRQn_Type_UARTE1_IRQn: IRQn_Type = 40;
#[doc = "< 41 QSPI"]
pub const IRQn_Type_QSPI_IRQn: IRQn_Type = 41;
#[doc = "< 42 CRYPTOCELL"]
pub const IRQn_Type_CRYPTOCELL_IRQn: IRQn_Type = 42;
#[doc = "< 45 PWM3"]
pub const IRQn_Type_PWM3_IRQn: IRQn_Type = 45;
#[doc = "< 47 SPIM3"]
pub const IRQn_Type_SPIM3_IRQn: IRQn_Type = 47;
#[doc = " @addtogroup Configuration_of_CMSIS\n @{"]
pub type IRQn_Type = ::core::ffi::c_int;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct T_UINT32 {
    pub v: u32,
}
#[test]
fn bindgen_test_layout_T_UINT32() {
    const UNINIT: ::core::mem::MaybeUninit<T_UINT32> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<T_UINT32>(),
        4usize,
        concat!("Size of: ", stringify!(T_UINT32))
    );
    assert_eq!(
        ::core::mem::align_of::<T_UINT32>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT32))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT32),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct T_UINT16_WRITE {
    pub v: u16,
}
#[test]
fn bindgen_test_layout_T_UINT16_WRITE() {
    const UNINIT: ::core::mem::MaybeUninit<T_UINT16_WRITE> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<T_UINT16_WRITE>(),
        2usize,
        concat!("Size of: ", stringify!(T_UINT16_WRITE))
    );
    assert_eq!(
        ::core::mem::align_of::<T_UINT16_WRITE>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT16_WRITE))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT16_WRITE),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct T_UINT16_READ {
    pub v: u16,
}
#[test]
fn bindgen_test_layout_T_UINT16_READ() {
    const UNINIT: ::core::mem::MaybeUninit<T_UINT16_READ> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<T_UINT16_READ>(),
        2usize,
        concat!("Size of: ", stringify!(T_UINT16_READ))
    );
    assert_eq!(
        ::core::mem::align_of::<T_UINT16_READ>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT16_READ))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT16_READ),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct T_UINT32_WRITE {
    pub v: u32,
}
#[test]
fn bindgen_test_layout_T_UINT32_WRITE() {
    const UNINIT: ::core::mem::MaybeUninit<T_UINT32_WRITE> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<T_UINT32_WRITE>(),
        4usize,
        concat!("Size of: ", stringify!(T_UINT32_WRITE))
    );
    assert_eq!(
        ::core::mem::align_of::<T_UINT32_WRITE>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT32_WRITE))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT32_WRITE),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct T_UINT32_READ {
    pub v: u32,
}
#[test]
fn bindgen_test_layout_T_UINT32_READ() {
    const UNINIT: ::core::mem::MaybeUninit<T_UINT32_READ> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<T_UINT32_READ>(),
        4usize,
        concat!("Size of: ", stringify!(T_UINT32_READ))
    );
    assert_eq!(
        ::core::mem::align_of::<T_UINT32_READ>(),
        1usize,
        concat!("Alignment of ", stringify!(T_UINT32_READ))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).v) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(T_UINT32_READ),
            "::",
            stringify!(v)
        )
    );
}
extern "C" {
    #[link_name = "__ISB__extern"]
    pub fn __ISB();
}
extern "C" {
    #[link_name = "__DSB__extern"]
    pub fn __DSB();
}
extern "C" {
    #[link_name = "__DMB__extern"]
    pub fn __DMB();
}
extern "C" {
    #[link_name = "__REV__extern"]
    pub fn __REV(value: u32) -> u32;
}
extern "C" {
    #[link_name = "__REV16__extern"]
    pub fn __REV16(value: u32) -> u32;
}
extern "C" {
    #[link_name = "__REVSH__extern"]
    pub fn __REVSH(value: i16) -> i16;
}
extern "C" {
    #[link_name = "__ROR__extern"]
    pub fn __ROR(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__RBIT__extern"]
    pub fn __RBIT(value: u32) -> u32;
}
extern "C" {
    #[link_name = "__CLZ__extern"]
    pub fn __CLZ(value: u32) -> u8;
}
extern "C" {
    #[link_name = "__LDREXB__extern"]
    pub fn __LDREXB(addr: *mut u8) -> u8;
}
extern "C" {
    #[link_name = "__LDREXH__extern"]
    pub fn __LDREXH(addr: *mut u16) -> u16;
}
extern "C" {
    #[link_name = "__LDREXW__extern"]
    pub fn __LDREXW(addr: *mut u32) -> u32;
}
extern "C" {
    #[link_name = "__STREXB__extern"]
    pub fn __STREXB(value: u8, addr: *mut u8) -> u32;
}
extern "C" {
    #[link_name = "__STREXH__extern"]
    pub fn __STREXH(value: u16, addr: *mut u16) -> u32;
}
extern "C" {
    #[link_name = "__STREXW__extern"]
    pub fn __STREXW(value: u32, addr: *mut u32) -> u32;
}
extern "C" {
    #[link_name = "__CLREX__extern"]
    pub fn __CLREX();
}
extern "C" {
    #[link_name = "__RRX__extern"]
    pub fn __RRX(value: u32) -> u32;
}
extern "C" {
    #[link_name = "__LDRBT__extern"]
    pub fn __LDRBT(ptr: *mut u8) -> u8;
}
extern "C" {
    #[link_name = "__LDRHT__extern"]
    pub fn __LDRHT(ptr: *mut u16) -> u16;
}
extern "C" {
    #[link_name = "__LDRT__extern"]
    pub fn __LDRT(ptr: *mut u32) -> u32;
}
extern "C" {
    #[link_name = "__STRBT__extern"]
    pub fn __STRBT(value: u8, ptr: *mut u8);
}
extern "C" {
    #[link_name = "__STRHT__extern"]
    pub fn __STRHT(value: u16, ptr: *mut u16);
}
extern "C" {
    #[link_name = "__STRT__extern"]
    pub fn __STRT(value: u32, ptr: *mut u32);
}
extern "C" {
    #[link_name = "__enable_irq__extern"]
    pub fn __enable_irq();
}
extern "C" {
    #[link_name = "__disable_irq__extern"]
    pub fn __disable_irq();
}
extern "C" {
    #[link_name = "__get_CONTROL__extern"]
    pub fn __get_CONTROL() -> u32;
}
extern "C" {
    #[link_name = "__set_CONTROL__extern"]
    pub fn __set_CONTROL(control: u32);
}
extern "C" {
    #[link_name = "__get_IPSR__extern"]
    pub fn __get_IPSR() -> u32;
}
extern "C" {
    #[link_name = "__get_APSR__extern"]
    pub fn __get_APSR() -> u32;
}
extern "C" {
    #[link_name = "__get_xPSR__extern"]
    pub fn __get_xPSR() -> u32;
}
extern "C" {
    #[link_name = "__get_PSP__extern"]
    pub fn __get_PSP() -> u32;
}
extern "C" {
    #[link_name = "__set_PSP__extern"]
    pub fn __set_PSP(topOfProcStack: u32);
}
extern "C" {
    #[link_name = "__get_MSP__extern"]
    pub fn __get_MSP() -> u32;
}
extern "C" {
    #[link_name = "__set_MSP__extern"]
    pub fn __set_MSP(topOfMainStack: u32);
}
extern "C" {
    #[link_name = "__get_PRIMASK__extern"]
    pub fn __get_PRIMASK() -> u32;
}
extern "C" {
    #[link_name = "__set_PRIMASK__extern"]
    pub fn __set_PRIMASK(priMask: u32);
}
extern "C" {
    #[link_name = "__enable_fault_irq__extern"]
    pub fn __enable_fault_irq();
}
extern "C" {
    #[link_name = "__disable_fault_irq__extern"]
    pub fn __disable_fault_irq();
}
extern "C" {
    #[link_name = "__get_BASEPRI__extern"]
    pub fn __get_BASEPRI() -> u32;
}
extern "C" {
    #[link_name = "__set_BASEPRI__extern"]
    pub fn __set_BASEPRI(basePri: u32);
}
extern "C" {
    #[link_name = "__set_BASEPRI_MAX__extern"]
    pub fn __set_BASEPRI_MAX(basePri: u32);
}
extern "C" {
    #[link_name = "__get_FAULTMASK__extern"]
    pub fn __get_FAULTMASK() -> u32;
}
extern "C" {
    #[link_name = "__set_FAULTMASK__extern"]
    pub fn __set_FAULTMASK(faultMask: u32);
}
extern "C" {
    #[link_name = "__get_FPSCR__extern"]
    pub fn __get_FPSCR() -> u32;
}
extern "C" {
    #[link_name = "__set_FPSCR__extern"]
    pub fn __set_FPSCR(fpscr: u32);
}
extern "C" {
    #[link_name = "__SADD8__extern"]
    pub fn __SADD8(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__QADD8__extern"]
    pub fn __QADD8(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__SHADD8__extern"]
    pub fn __SHADD8(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__UADD8__extern"]
    pub fn __UADD8(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__UQADD8__extern"]
    pub fn __UQADD8(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__UHADD8__extern"]
    pub fn __UHADD8(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__SSUB8__extern"]
    pub fn __SSUB8(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__QSUB8__extern"]
    pub fn __QSUB8(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__SHSUB8__extern"]
    pub fn __SHSUB8(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__USUB8__extern"]
    pub fn __USUB8(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__UQSUB8__extern"]
    pub fn __UQSUB8(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__UHSUB8__extern"]
    pub fn __UHSUB8(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__SADD16__extern"]
    pub fn __SADD16(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__QADD16__extern"]
    pub fn __QADD16(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__SHADD16__extern"]
    pub fn __SHADD16(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__UADD16__extern"]
    pub fn __UADD16(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__UQADD16__extern"]
    pub fn __UQADD16(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__UHADD16__extern"]
    pub fn __UHADD16(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__SSUB16__extern"]
    pub fn __SSUB16(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__QSUB16__extern"]
    pub fn __QSUB16(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__SHSUB16__extern"]
    pub fn __SHSUB16(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__USUB16__extern"]
    pub fn __USUB16(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__UQSUB16__extern"]
    pub fn __UQSUB16(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__UHSUB16__extern"]
    pub fn __UHSUB16(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__SASX__extern"]
    pub fn __SASX(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__QASX__extern"]
    pub fn __QASX(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__SHASX__extern"]
    pub fn __SHASX(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__UASX__extern"]
    pub fn __UASX(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__UQASX__extern"]
    pub fn __UQASX(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__UHASX__extern"]
    pub fn __UHASX(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__SSAX__extern"]
    pub fn __SSAX(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__QSAX__extern"]
    pub fn __QSAX(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__SHSAX__extern"]
    pub fn __SHSAX(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__USAX__extern"]
    pub fn __USAX(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__UQSAX__extern"]
    pub fn __UQSAX(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__UHSAX__extern"]
    pub fn __UHSAX(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__USAD8__extern"]
    pub fn __USAD8(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__USADA8__extern"]
    pub fn __USADA8(op1: u32, op2: u32, op3: u32) -> u32;
}
extern "C" {
    #[link_name = "__UXTB16__extern"]
    pub fn __UXTB16(op1: u32) -> u32;
}
extern "C" {
    #[link_name = "__UXTAB16__extern"]
    pub fn __UXTAB16(op1: u32, op2: u32) -> u32;
}
extern "C" {
    #[link_name = "__SXTB16__extern"]
    pub fn __SXTB16(op1: u32) -> u32;
}
extern "C" {
    #[link_name = "__SXTB16_RORn__extern"]
    pub fn __SXTB16_RORn(op1: u32, rotate: u32) -> u32;
}
extern "C" {
    #[link_name = "__SXTAB16__extern"]
    pub fn __SXTAB16(op1: u32, op2: u32) -> u32;
}
extern "C" {
